Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/Add-on-Store-Proposal.po
Languages: es

source: - Check to see if the GitHub user submitting the PR is a maintainer of the Addon version being submitted.
es: - Comprobar si el usuario de GitHub que envía la solicitud de cambios es un responsable de mantenimiento de la versión del complemento que se envía.

source: - Consider using CI (Appveyor) to check the addon installs cleanly:
es: - Plantearse usar integración continua (Appveyor) para comprobar que el complemento se instala limpiamente:

source: - Install NVDA (the most recent version supported by the addon)
es: - Instalar NVDA (la versión más reciente soportada por el complemento)

source: - Install the addon
es: - Instalar el complemento

source: - Restart NVDA and check for errors
es: - Reiniciar NVDA y comprobar si hay errores

source: ### Concerns
es: ### Comentarios

source: This approach requires that an addon repository is already a valid (and installable) addon once it is zipped. Most addons require build steps.
es: Este enfoque requiere que el repositorio de un complemento sea un complemento válido (e instalable) una vez se comprima. Muchos complementos necesitan pasos adicionales en su construcción.

source: - Can github actions be used to run these steps and produce a certifiable build artifact?
es: - ¿Se pueden usar las acciones de GitHub para ejecutar estos pasos y producir un resultado de compilación certificable?

source: - If we can certify the source for a commit, and the source for the github actions that produces the artifact, then the artifact itself is certified?
es: - Si se puede certificar el código de un commit, y el código de las acciones de GitHub que producen el complemento, ¿significa que el complemento en sí está certificado?

source: - If this is true we can provide this action along with the addon-template.
es: - Si esto es así, se puede proporcionar la acción de GitHub junto a la plantilla de complemento.

source: ### Other notes
es: ### Otras notas

source: - By using a git repository and and PR process, `git blame` and `git log` can be used to get more context about addons listed in the store. For instance:
es: - Utilizando un repositorio de GitHub y un proceso basado en solicitudes de cambios, `git blame` y `git log` se pueden emplear para obtener más contexto sobre los complementos listados en la tienda. Por ejemplo:

source: - When was the addon accepted
es: - Cuándo se aceptó el complemento

source: - What did the review look like
es: - Qué pinta tuvo la revisión

source: - How often does this addon have updates accepted
es: - Con qué frecuencia se aceptan actualizaciones de este complemento

source: - GitHub allows assigning reviews to reviewers
es: - GitHub permite asignar revisiones a revisores

source: ## `NVDA-Addon-store-data` GitHub Repository
es: ## Repositorio `NVDA-Addon-store-data` de GitHub

source: Holds meta-data about addons accepted to the store.
es: Contiene metadatos de complementos aceptados en la tienda.

source: Using a separate repository for this data store separates concerns, gives greater flexibility for managing permissions, makes it easier to verify changes (eg in a PR, or via automation), and simplifies the commit history (no automation commits "updating data store")
es: Al usar un repositorio separado para el almacenamiento de datos se separan conceptos, se da mayor flexibilidad para gestionar permisos, y se facilita la verificación de cambios (por ejemplo en una solicitud de cambios o mediante automatización), y se simplifica el historial de commits (no hay commits automatizados del tipo "Se actualiza el almacén de datos")

source: The exact implementation details for this repository are not exposed to users, because on one side the `NVDA-Addon-submission` repository feeds data in and the NV Access server is on the other side fetching and providing data to NVDA or a web based store.
es: Los detalles exactos de implementación de este repositorio no se exponen a los usuarios, ya que por un lado tenemos al repositorio `NVDA-Addon-submission` alimentando con datos, y por otro está el servidor de NV Access recuperando y proporcionando datos a NVDA o a una tienda basada en web.

source: This means that changing the layout or implementation of this repository does not cause wide breaking changes to the process and it can be updated independently.
es: Esto significa que cambiar la disposición o la implementación de este repositorio no causará daños colaterales al proceso y se puede actualizar de forma independiente.

source: Since the details of this repository don't really matter too much they don't need to be concrete at this point, however I'll give a brief overview of the current plan.
es: Aunque los detalles de este repositorio realmente no importan demasiado, no es necesario que sean muy concretos en este momento. Sin embargo, se proporciona una breve visión general del plan actual.

source: ### Overview
es: ### Descripción

source: For each version of NVDA, the meta-data of the most recent (highest version number) of each Addon is automatically added, based on the data in 'NVDA-Addon-submission'.
es: Para cada versión de NVDA, los metadatos de cada complemento más reciente (con número de versión más alto) se añaden automáticamente, basándose en los datos de 'NVDA-Addon-submission'.

source: - `/NVDA API Version/addon-1-ID/release.json`
es: - `/Versión de API de NVDA/addon-1-ID/release.json`

source: - `/NVDA API Version/addon-1-ID/pre-rel.json`
es: - `/Versión de API de NVDA/addon-1-ID/pre-rel.json`

source: - `/NVDA API Version/addon-2-ID/release.json`
es: - `/Versión de API de NVDA/addon-2-ID/release.json`

source: - `/NVDA API Version/all.json`
es: - `/Versión de API de NVDA/all.json`

source: Notes:
es: Notas:

source: - 'NVDA API Version' will be something like '2019.3', there will be one folder for each NVDA API Version.
es: - 'Versión de la API de NVDA' será algo como '2019.3', habrá una carpeta para cada versión de la API de NVDA.

source: - The `pre-rel.json` and `release.json` contain the information necessary for a store entry.
es: - Los archivos `pre-rel.json` y `release.json` contienen la información necesaria para una entrada de la tienda.

source: This is essentially the URL to download the addon (a zip of the commit), and the rest of the contents of the addon manifest. Of course, by including translated descriptions in the manifest a multilingual addon store can be created, though possible not the core goal of this proposal.
es: En esencia, sería la URL de descarga del complemento (un zip del commit), y el resto de contenidos del manifiesto del complemento. Por supuesto, incluyendo descripciones traducidas en el manifiesto se puede crear una tienda de complementos multiidioma, aunque posiblemente no sea el objetivo de esta propuesta.

source: - The contents of `all.data` is all (pre-release and release) data for this NVDA API version together.
es: -Los contenidos de `all.json` son todos los datos (versiones de desarrollo y estables) de esta versión de la API de NVDA juntos.

source: The simplicity of this is that the NV Access server can just forward these files on directly when asked "what are the latest Addons for NVDA API Version X" or "What is the latest version of Addon-ID for NVDA API Version X". Using the NV Access server as the endpoint for this is important in case the implementation has to change or be migrated away from GitHub for some reason.
es: La simplicidad de esto radica en que el servidor de NV Access puede simplemente reenviar estos archivos directamente al preguntarle "cuáles son los últimos complementos para la versión X de la API de NVDA" o "Cuál es la última versión de addon-id para la versión X de la API de NVDA". Usar el servidor de NV Access como un extremo para esto es importante en caso de que haya que cambiar la implementación o migrar fuera de GitHub por alguna razón.

source: ### How does data arrive
es: ### Cómo llegan los datos

source: For the sake of a simple explanation, optimisations and minor details will be omitted from this description.
es: Con el objetivo de simplificar la explicación, se omitirán optimizaciones y detalles menores en esta descripción.

source: A GitHub Action is created to respond to a new commit on the `NVDA-Addon-submission` repository. For each commit in each `*.commits` file in the `NVDA-Addon-submission` repository, the manifest for the addon is fetched.
es: Se crea una acción de GitHub para responder a un nuevo commit en el repositorio `NVDA-Addon-submission`. Por cada commit de cada archivo `*.commits` del repositorio `NVDA-Addon-submission`, se recupera el manifiesto del complemento.

source: Addons manifests that support each NVDA API version are found.
es: Se buscan los manifiestos que soporten cada versión de la API de NVDA.

source: For each NVDA API version the most recent (based on version number) release and pre-release addon manifest is kept.
es: Para cada versión de la API, se conserva el manifiesto del complemento de las versiones estables y de desarrollo más recientes (basándose en el número de versión).

source: These remaining manifest files are used to reconstruct the data in the repository and commit it.
es: Los archivos de manifiesto recuperados se usan para reconstruir los datos del repositorio y hacer commit.

source: ## Suffix
es: ## Epílogo

source: ### Example of bot message for `NVDA-Addon-submission` PR.
es: ### Ejemplo de mensaje de bot en una solicitud de cambio de `NVDA-Addon-submission`.

source: Added Version.
es: Añadida versión.

source: - [Browse source](https://github.com/nvaccess/nvda-ocr/tree/632d037dae906cd582ff4995628aa3fbaacd84e9)
es: - [Explorar código](https://github.com/nvaccess/nvda-ocr/tree/632d037dae906cd582ff4995628aa3fbaacd84e9)

source: - [Download zip](https://github.com/nvaccess/nvda-ocr/archive/632d037dae906cd582ff4995628aa3fbaacd84e9.zip)
es: - [Descargar zip](https://github.com/nvaccess/nvda-ocr/archive/632d037dae906cd582ff4995628aa3fbaacd84e9.zip)

source: ### Pre-release addon version support
es: ### Soporte para versiones de desarrollo de complementos

source: This will require an update to the addon-manifest. While this proposal plans for it, it will not be in the initial scope of work.
es: Será necesaria una actualización del manifiesto del complemento. Aunque en la propuesta se contempla, no estará en el ámbito del trabajo inicial.

source: ### Invalid Addon references
es: ### Referencias inválidas de complementos

source: When building the data-store, any references to commits that no longer exist (repo deleted, history rewritten etc) will obviously be excluded since the manifest can not be fetched. Although not high priority, a mechanism may need to be developed to update the 'NVDA-Addon-submission' repository so that these invalid references can be removed.
es: Al construir el almacén de datos, cualquier referencia a commits que no existen (repositorio eliminado, historial reescrito, etc.) obviamente se excluirán, ya que el manifiesto no se puede descargar. Aunque no es de alta prioridad, se debería implementar un mecanismo para actualizar el repositorio 'NVDA-Addon-submission' de tal forma que se eliminen estas referencias inválidas.

source: ### Terminology: Addon version vs Addon release
es: ### Terminología: versión de complemento frente a liberación de complemento

source: Since this proposal supports pre-release addons, I have tried to avoid using the term "addon release", instead favouring "addon version".
es: Ya que en esta propuesta se da soporte a los complementos en desarrollo, se ha intentado evitar el uso del término "liberación de complemento" en favor de "versión de complemento".
