Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/Add-on-Store-Proposal.po
Languages: es

source: # Add on Store Proposal
es: # Propuesta de tienda de complementos

source: The intention of this proposal is to improve the end to end process and supporting infrastructure for hosting Addons.
es: La intención de esta propuesta es mejorar de principio a fin el proceso y la infraestructura de soporte de los complementos.

source: This is the current plan from NV Access.
es: Este es el plan actual de NV Access.

source: However, before starting this work we would like feedback from the add-ons community, particularly addon authors and addon reviewers since this will affect them the most.
es: Sin embargo, antes de empezar a trabajar en él nos gustaría recibir comentarios de la comunidad de complementos, particularmente autores y revisores de complementos, ya que serán los más afectados.

source: The main goal of this is to enable an "NVDA addon store" accessible from within NVDA itself.
es: El objetivo principal de todo esto es habilitar una "Tienda de complementos de NVDA", accesible desde dentro del propio NVDA.

source: In this proposal the word "store" is used to refer to the system allowing users to acquire addons, there is no intention of supporting paid addons.
es: En esta propuesta, la palabra "tienda" se usa para referirse al sistema que permite a los usuarios adquirir complementos, no hay intención de soportar complementos de pago.

source: This "store" system includes any website, API, process, or infrastructure to support users to browse, search, install and update Addons for NVDA.
es: Este sistema de "tienda" incluye cualquier sitio web, API, proceso, o infraestructura de apoyo para que los usuarios puedan explorar, buscar, instalar y actualizar complementos de NVDA.

source: Many considerations in this proposal have been given to creating a more secure and robust NVDA Addon store.
es: Se han dado muchas consideraciones en esta propuesta para crear una tienda de complementos de NVDA más segura y robusta.

source: While there is little that can be done to guarantee an addon is safe to run, we can ensure that all versions are viewed, and that users are running the addon they think they are.
es: Aunque poco se puede hacer para garantizar que es seguro ejecutar un complemento, podemos asegurar que se ven todas las versiones, y que los usuarios ejecutan el complemento que creen que están ejecutando.

source: The process is intended to be as transparent as possible to make it simple (for developers) to understand the current state of the store or the state of a submission of a new / updated addon pending review.
es: El proceso está pensado paraser tan transparente como sea posible, y que el estado actual de la tienda o el estado de envío de un complemento nuevo o actualizado pendiente de revisión sean simples de entender (para los desarrolladores).

source: The process should enable authors and reviewers to learn about and improve the addon-review process.
es: El proceso debería dar la capacidad a autores y revisores de aprender y mejorar la tarea de revisar complementos.

source: Much of the recent [conversation on the addons mailing list](https://nvda-addons.groups.io/g/nvda-addons/topic/69393202#10878) has been about reviewing Addons.
es: Gran parte de la [conversación reciente en la lista de correo de complementos](https://nvda-addons.groups.io/g/nvda-addons/topic/69393202#10878) ha sido sobre la revisión de complementos.

source: While NV Access has some opinions on this, I think it will be more productive to first focus on the steps around this.
es: Aunque NV Access tiene opiniones al respecto, puede ser más productivo centrarse primero en los pasos del proceso.

source: For now, this step will just be referred to as 'review performed'.
es: Por ahora, nos referiremos a este paso como 'Revisión realizada'.

source: Later, I suggest a new thread to agree on a "addon review check list".
es: Más adelante, se sugiere un hilo para ponerse deacuerdo en una "lista de comprobación de revisión de complementos".

source: With the right infrastructure, we can automate many checks and reduce the burden on reviewers.
es: Con la infraestructura adecuada, se pueden automatizar muchas comprobaciones y reducir la carga de los revisores.

source: This proposal does not intend to restrict Addon authors from developing, publishing, and distributing Addons outside of this store.
es: Esta propuesta no tiene la intención de impedir que los autores de complementos desarrollen, publiquen y distribuyan complementos fuera de esta tienda.

source: NVDA will still allow local installation from a `*.nvda-addon` file.
es: NVDA todavía permitirá la instalación local desde un archivo `.nvda-addon`.

source: ## Too Long; Didn't Read for Addon authors
es: ## Si eres autor de complementos

source: With this proposal if an addon author wishes to submit their addon to be visible in this addon store they will need to:
es: Con esta propuesta, si un autor de complementos desea enviar su complemento para que sea visible en la tienda deberá:

source: - Store their addon on Github in an open (not private) repository.
es: - Alojar su complemento en GitHub en un repositorio abierto (no privado).

source: - Create an issue on the `addon-store-submission` repository for each addon version they want to make available.
es: - Crear una incidencia en el repositorio `addon-store-submission` para cada versión del complemento que quiera publicar.

source: - Paste into the issue description a link to the commit or github release.
es: - Pegar en la descripción de la incidencia un enlace al commit o a la liberación de GitHub.

source: - Wait for it to be reviewed and accepted or participate in review actions and resubmit the new version.
es: - Esperar a que se revise y se acepte o participar en las acciones de revisión y volver a enviar la nueva versión.

source: ## Too Long; Didn't Read for Addon reviewers
es: ## Si eres revisor de complementos

source: As an Addon reviewer you will:
es: Como revisor de complementos, deberás:

source: - Look at pending PR's on the `addon-store-submission` repository.
es: - Mirar las solicitudes de cambio en el repositorio `addon-store-submission`.

source: - These will include a link to the addon version being reviewed.
es: - Estas incluirán un enlace al complemento que se revisa.

source: - Follow the review process (yet to be documented here).
es: - Sigue el proceso de revisión (sin documentar todavía por aquí).

source: - Either 'approve' the PR, or 'request changes' while providing feedback and close the PR.
es: - Aprueba la solicitud de cambios, o solicita cambios mientras proporcionas comentarios y la cierras.

source: - When approving the PR, press the merge button to finalise the submision.
es: - Al aprobar la solicitud de cambio, pulsa el botón Merge para finalizar el proceso.

source: ## Considerations
es: ## Consideraciones

source: - Submissions and reviews should be easy to find and get the status of.
es: - Debería ser fácil localizar y conocer el estado de los envíos y revisiones.

source: - Make it possible to automate many steps in the process, saving reviewers time.
es: - Hacer posible la automatización de muchos pasos del proceso, ahorrando tiempo a los revisores.

source: - Once submitted an addon version should be immutable. No changing the addon on an external server, it must be updated in the store via the submission process.
es: - Una vez enviada, la versión de un complemento jamás debería cambiar. Nada de cambiar el complemento en un servidor externo, debe ser actualizado en la tienda mediante el proceso de envío.

source: - Allow addon authors to easily revoke a version if it is buggy / no longer supported. It should no longer be presented in the store, halting installation by new users.
es: - Se debe permitir a los autores revocar fácilmente una versión si es defectuosa o ya no recibe soporte. No debería presentarse más en la tienda, evitando así la instalación por parte de nuevos usuarios.

source: - Enable support in the store for multiple versions of an Addon, based on NVDA version.
es: - Se debe dar soporte a varias versiones de un complemento, en base a la versión de NVDA.

source: - EG addon version 1.2.5 for NVDA 2019.3 and addon version 1.3.2 for NVDA 2020.1
es: - Ejemplo: versión del complemento 1.2.5 para NVDA 2019.3 y versión del complemento 1.3.2 para NVDA 2020.1

source: - Enable support in the store for 'pre-release' Addons, for instance:
es: - Se debe dar soporte en la tienda a los complementos en desarrollo, por ejemplo:

source: - Addons being developed against alpha / beta NVDA.
es: - Complementos que se desarrollan con NVDA alpha/beta.

source: - Addons that want early feedback from end users.
es: - Complementos que necesitan comentarios de los usuarios desde el principio.

source: - End users can choose "show me pre-release addons"
es: - Los usuarios finales pueden elegir "Mostrarme complementos en desarrollo".

source: ## Overview
es: ## Descripción general

source: Use GitHub reviews for store submissions.
es: Se usan revisiones de GitHub para alojar envíos.

source: Use GitHub for storage of meta-data for addons available from the store.
es: Se usa GitHub para almacenar los metadatos de los complementos disponibles en la tienda.

source: Use GitHub actions (or other integrations) to automate construction of the data store, and as many of the review checks as possible. This will all be open source and extensible by the community.
es: Se usan las acciones de GitHub (u otras integraciones) para automatizar la construcción del almacén de datos, y tantas comprobaciones de la revisión como sea posible. Todo esto será de código abierto y la comunidad podrá extenderlo.

source: ### Why GitHub reviews?
es: ### ¿Por qué revisiones de GitHub?

source: - GitHub is where much of the NVDA development ecosystem is already based.
es: - Gran parte del ecosistema de desarrollo de NVDA ya está basado en GitHub.

source: - Handles all the of the CRUD ([create, read, update, delete](https://en.wikipedia.org/wiki/CRUD)) for users, authentication is handled, and we can determine how a user relates to an addon repository and what their permissions are for that repository. Are they actually an owner / maintainer?
es: - Maneja todo el CRUD ([Creación, lectura, actualización y eliminación](https://en.wikipedia.org/wiki/CRUD)) de los usuarios, maneja la autenticación, y se puede determinar la relación entre un usuario y el repositorio de un complemento y sus permisos en ese repositorio. ¿Es realmente el propietario o un responsable de mantenimiento?

source: - GitHub has a review system that allows for proposing changes and discussing these changes. We can leverage this for a store submission and review process.
es: - GitHub incorpora un sistema de revisiones que permite proponer cambios y debatir sobre ellos. Se puede utilizar para los envíos a la tienda y el proceso de revisión.

source: - GitHub PR's provided a atomic view of a store submission.
es: - Las solicitudes de cambio de GitHub proporcionan una vista atómica del envío hacia la tienda.

source: - Interested parties can 'watch' PR's they care about without being subjected to the noise from PR's they don't care about.
es: - Las partes interesadas pueden observar las solicitudes de cambio que les importan sin estar sujetas al ruido de otras solicitudes de cambio que no les importan.

source: - The result (open / merged / closed) of the PR is clear.
es: - El resultado de la solicitud de cambios es claro (abierta / mezclada / cerrada).

source: - GitHub allows us to manage permissions for accepting reviews more easily.
es: - GitHub nos permite gestionar permisos para aceptar revisiones con más facilidad.

source: ## Infrastructure
es: ## Infraestructura

source: - `NVDA-Addon-submission` GitHub Repository
es: - Repositorio `NVDA-Addon-submission` en GitHub

source: - For Addon authors / reviewers.
es: - Para autores y revisores de complementos.

source: - Where new Addon versions are submitted
es: - Donde se envían las nuevas versiones de los complementos

source: - Where reviews of Addon submissions happen
es: - Donde tienen lugar las revisiones de los envíos

source: - `NVDA-Addon-store-data` GitHub Repository
es: - Repositorio `NVDA-Addon-store-data` en GitHub

source: - For storage of meta-data about addons "in the store"
es: - Para almacenamiento de metadatos de los complementos "de la tienda"

source: - This repository acts as a back-end database, but is more transparent.
es: - Este repositorio actúa como una base de datos back-end, pero es más transparente.

source: - Since our needs are simple, preconfigured "views" of the data will suffice.
es: - Como las necesidades son simples, serán suficientes algunas "vistas" preconfiguradas de los datos.

source: - NV Access server - To provide the endpoint for "available Addons" meta-data
es: - Servidor de NV Access - para proporcionar el punto de acceso para los metadatos de "complementos disponibles"

source: - While this is technically not necessary, it provides a good separation from implementation.
es: - Aunque técnicamente no es necesario, proporciona una buena separación de la implementación.

source: If we wished to change our storage mechanism, we would not be breaking old versions of NVDA.
es: Si quisiéramos modificar nuestro mecanismo de almacenamiento, no se romperían las versiones anteriores de NVDA.

source: ## `NVDA-Addon-submission` GitHub Repository
es: ## Repositorio `NVDA-Addon-submission` en GitHub

source: Essentially this repository holds references to all the accepted versions of Addons which are included in the store. A reference to an old version of an addon remains until it is explicitly removed or becomes invalid, allowing delivery to older versions of NVDA, or as a fall back in case the newer version is revoked after a critical bug is found.
es: En esencia, este repositorio almacena referencias a todas las versiones aceptadas de los complementos que se han incluido en la tienda. Una referencia a una versión antigua de un complemento permanece hasta que se elimina explícitamente o se vuelve inválida, permitiendo su entrega a versiones antiguas de NVDA, o como respaldo si se revoca una versión más nueva porque se detecta un fallo.

source: Addons versions are submitted by submitting a pull request, adding the commit for that version to a file that describes the GitHub repository for the addon.
es: Las versiones de los complementos se envían mediante una solicitud de cambios, añadiendo el commit de esa versión a un archivo que describe el repositorio en GitHub del complemento.

source: ### Layout
es: ### Disposición

source: Root directory of repository:
es: Carpeta raíz del repositorio:

source: - `readme.md` - A guide for submission
es: - `readme.md` - Una guía para los envíos

source: - `addons/owner1/repo1.commits`
es: - `addons/autor1/repo1.commits`

source: - `addons/owner1/repo2.commits`
es: - `addons/autor1/repo2.commits`

source: - `addons/owner2/repo3.commits`
es: - `addons/autor2/repo3.commits`

source: Example for the NV Access addon, 'NVDA - OCR': `addons/nvaccess/nvda-ocr.commits`
es: Ejemplo de un complemento de NV Access, 'NVDA-OCR': `addons/nvaccess/nvda-ocr.commits`

source: Contents of a `*.commits` file, is a (newline separated) list of git SHAs, one for each commit which could be available in the store.
es: Los contenidos de un archivo `.commits` constan de una lista (separada por saltos de línea) de hashes SHA de Git, uno por cada commit que podría estar disponible en la tienda.

source: This is intentionally a very simple format to maximise the ease of editing, and minimise the risk of format corruption.
es: Se ha diseñado este formato tan simple intencionadamente para maximizar la facilidad de edición, y minimizar el riesgo de corrupción del formato.

source: Commits are used rather than tags because tags can be changed after creation, a SHA collision should be quite difficult to achieve.
es: Se usan commits en vez de tags porque los tags pueden cambiarse después de su creación, y una colisión SHA es bastante difícil de provocar.

source: This is important to stop the possibility of a malicious author changing an addon post review, bypassing the review process.
es: Esto es importante para eliminar la posibilidad de que un autor malicioso modifique su complemento tras la revisión, evitando el proceso de revisión.

source: ### Submitting an Addon version
es: ### Enviar una versión de un complemento

source: Pre-requisites:
es: Requisitos previos:

source: - An addon must be stored on GitHub in a public repository
es: - El complemento debe alojarse en un repositorio público en GitHub

source: - The commit which will be submitted must be a valid NVDA `*.nvda-addon` file if zipped and renamed.
es: - El commit que se enviará debe ser un archivo `*.nvda-addon` de NVDA válido si se comprime y renombra.

source: Process:
es: Proceso:

source: 1. A PR is created on the `NVDA-Addon-submission` repository
es: 1. Se crea una solicitud de cambios en el repositorio `NVDA-Addon-submission`

source: - It adds/removes the SHA of the commit (for the submitted version) to the appropriate `addons/owner/repo.commits` file.
es: - En ella se añade o elimina el SHA del commit (de la versión enviada) al archivo `addons/autor/repo.commits` adecuado.

source: - Refer to 'Creating the submission PR' below
es: - Consulta la sección `Creación de la solicitud de envío` que hay más adelante

source: 1. A bot adds a comment in the PR with links to the addon versions that are added or removed
es: 2. Un bot añade un comentario en la solicitud de cambios con enlaces a las versiones del complemento que se añaden o eliminan

source: - NOTE: the URL for this link can be is built from 'owner', 'repo', 'commit' of the lines added / removed.
es: - Nota: la URL de este enlace puede ser construida desde 'autor', 'repo' y 'commit' de las líneas añadidas o eliminadas.

source: - This allows the reviewer to browse the source online or download the addon with, see (in suffix) heading "Example of bot message for `NVDA-Addon-submission` PR" for an example message.
es: - Esto permite que el revisor examine el código en línea o descargue el complemento, consulta el encabezado "Ejemplo de mensaje de bot para una solicitud de cambios en `NVDA-Addon-submission`" para ver un mensaje de ejemplo.

source: 1. A review is performed (resulting in: request changes, merge, close)
es: 3. Se lleva a cabo una revisión (que da como resultado: pedir cambios, mezclar o cerrar)

source: - A bot may perform some automated checks or provide helpful information, refer to 'automated review ideas' below
es: - Un bot puede realizar ciertas comprobaciones automatizadas o proporcionar información útil, consulta 'Ideas de revisión automatizada' más abajo

source: - Manual review is done according to some published review check list (so that everyone knows what to expect)
es: - Se hace una revisión manual siguiendo alguna lista de comprobación de revisión publicada (para que todo el mundo sepa qué puede esperar)

source: - Automated and human process can be decided later, we can address these details as they come up and improve upon the process
es: - Se pueden decidir más adelante los procesos automatizados y humanos, ya resolveremos estos detalles sobre la marcha para mejorar el proceso

source: 1. When the PR is merged, the Addon becomes available in the store.
es: 4. Cuando se mezcla la solicitud de cambios, el complemento aparece disponible en la tienda.

source: ### Creating the submission PR
es: ### Creación de la solicitud de envío

source: To simplify the initial implementation of this process the PR will need to be created manually, later we can streamline this, and automate only requiring the addon author to paste a link in a new issue.
es: Para simplificar la implementación inicial de este proceso, la solicitud de cambios deberá crearse manualmente, más adelante se podrá automatizar, de tal forma que un autor sólo tenga que pegar un enlace en una nueva incidencia.

source: A new Pull Request (PR) is created on the `NVDA-Addon-submission` repository.
es: Se crea una nueva solicitud de cambios en el repositorio `NVDA-Addon-submission`.

source: 1. Find or create a file: `addons/owner/repo.commits`
es: 1. Busca o crea un archivo: `addons/autor/repo.commits`

source: - Example: `addons/nvaccess/nvda-ocr.commits`
es: - Ejemplo: `addons/nvaccess/nvda-ocr.commits`

source: - Where 'owner' is the username or organisation that owns the addon GitHub repository. E.G. for `nvda-ocr` it is `nvaccess`
es: - Donde 'autor' es el nombre de usuario u organización a la que pertenece el repositorio de GitHub del complemento. Por ejemplo: para `nvda-ocr` es `nvaccess`

source: - Where 'repo' is the name of the repository. E.G. `nvda-ocr`
es: - Donde 'repo' es el nombre del repositorio. Por ejemplo: `nvda-ocr`

source: - NOTE: creating the file means this is an entirely new submission
es: - Nota: crear el archivo significa que este es un envío completamente nuevo

source: 1. To submit a new version, add the SHA of the commit to the file
es: 2. Para enviar una nueva versión, añade el SHA del commit al archivo

source: 1. For no longer supported addon versions, remove the SHA of the commit.
es: 3. Para las versiones del complemento que no estén soportadas, elimina el SHA del commit.

source: This could be done with the web editor, though screen reader users may be more comfortable making the changes locally with their chosen editor.
es: Esto se podría hacer con el editor web, aunque los usuarios de lectores de pantalla pueden sentirse más cómodos haciendo los cambios localmente con un editor de su elección.

source: Because this requires addon authors to fork the `NVDA-Addon-submission` repository, this is a little cumbersome.
es: Debido a que esto requiere que los autores de complementos hagan fork del repositorio `NVDA-Addon-submission`, la situación se vuelve un poco engorrosa.

source: To streamline this process, we could use GitHub issues.
es: Para agilizar este proceso, se podrían usar incidencias de GitHub.

source: - The addon author would pick from two issue templates:
es: - El autor del complemento escogería entre dos plantillas de incidencia:

source: - "Add addon version"
es: - "Añadir versión de complemento"

source: - "Remove addon version"
es: - "Eliminar versión de complemento"

source: - In the template they would paste a link to the commit or tag that should be added or removed.
es: - En la plantilla, pegarían un enlace al commit o al tag que debería añadirse o eliminarse.

source: - Automation creates the PR automatically from this and closes the issue.
es: - La automatización crea automáticamente la solicitud de cambios y cierra la incidencia.

source: - NOTE: In this approach it is safe to use a git tag, because the commit ID can be determined from the tag. The commit is then used in the PR and the rest of the process is the same.
es: - Nota: en este enfoque sí es seguro usar un tag de Git, ya que se puede determinar el identificador del commit desde el tag. A continuación, se usa el commit en la solicitud de cambios y el resto del proceso no varía.

source: ### Automated review ideas
es: ### Ideas de revisión automatizada

source: Several suggestions for automated review ideas to streamline the process.
es: Varias sugerencias de ideas para la revisión automatizada con el fin de agilizar el proceso.

source: - Check manifest validity
es: - Comprobar la validez del manifest

source: - Provide links to relevant diffs
es: - Proporcionar enlaces a diffs relevantes
