Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/developer_guide.po
Languages: es

source: It is possible to provide locale-specific information and messages for your add-on. Locale information can be stored in a locale directory in the archive. This directory should contain directories for each language it supports, using the same language code format as the rest of NVDA; e.g. en for English, fr\_CA for French Canadian.
es: Es posible proporcionar información y mensajes específicos del idioma para tu complemento. La información traducida puede almacenarse en un directorio locale en el archivo. Este directorio debería contener directorios para cada idioma que soporte, usando el mismo formato de código de idioma que el resto de NVDA; por ejemplo en para inglés, fr\_ca para francés de Canadá.

source: #### 4.5.1. Locale-specific Manifest Files
es: #### 4.5.1. Archivos de manifiesto específicos del idioma

source: Each of these language directories can contain a locale-specific manifest file called manifest.ini, which can contain a small subset of the manifest fields for translation. These fields are summary and description. All other fields will be ignored.
es: Cada uno de estos directorios de idioma puede contener un archivo de manifiesto específico del idioma llamado manifest.ini, que puede tener un pequeño subconjunto de los campos de manifiesto para traducir. Estos campos son summary y description. Todos los demás campos se ignoran.

source: #### 4.5.2. Locale-specific Messages
es: #### 4.5.2. Mensajes específicos del idioma

source: Each language directory can also contain gettext information, which is the system used to translate the rest of NVDA's user interface and reported messages. As with the rest of NVDA, an nvda.mo compiled gettext database file should be placed in the LC\_MESSAGES directory within this directory. to allow plugins in your add-on to access gettext message information via calls to \_\(\), you must initialize translations at the top of each Python module by calling addonHandler.initTranslation\(\). For more information about gettext and NVDA translation in general, please read <https://github.com/nvaccess/nvda/wiki/Translating>
es: Cada directorio de idioma puede contener también información Gettext, que es el sistema usado para traducir el resto de la interfaz de usuario de NVDA y los mensajes verbalizados. Como en el resto de NVDA, se debería situar en el directorio LC\_MESSAGES dentro del directorio del idioma un archivo de base de datos de Gettext compilada, llamado nvda.mo. Para permitir que las extensiones de tu complemento accedan a la información de mensajes de Gettext mediante llamadas a \_\(\), debes inicializar las traducciones al principio de cada módulo Python llamando a addonHandler.initTranslation\(\). Para más información sobre Gettext y la traducción de NVDA en general, lee la documentación para traductores que se encuentra en nuestra web.

source: ### 4.6. Add-on Documentation
es: ### 4.6. Documentación del complemento

source: Documentation for an add-on should be placed in a doc directory in the archive. Similar to the locale directory, this directory should contain directories for each language in which documentation is available.
es: La documentación para un complemento debería situarse en un directorio doc en el archivo. De forma similar al directorio locale, este directorio debería contener carpetas para cada idioma en el que haya disponible documentación.

source: Users can access documentation for a particular add-on by opening the Add-ons Manager, selecting the add-on and pressing the Add-on help button. This will open the file named in the docFileName parameter of the manifest. NVDA will search for this file in the appropriate language directories. For example, if docFileName is set to readme.html and the user is using English, NVDA will open doc\en\readme.html.
es: Los usuarios pueden acceder a la documentación para un complemento específico abriendo el gestor de complementos, seleccionando el complemento y pulsando el botón de ayuda del complemento. Esto abrirá el archivo especificado en el parámetro docFileName del manifiesto. NVDA buscará este archivo en los directorios concretos del idioma. Por ejemplo, si se establece docFileName a readme.html y el usuario utiliza NVDA en inglés, NVDA abrirá doc\en\readme.html.

source: ## 5\. NVDA Python Console
es: ##5\. La consola Python de NVDA

source: The NVDA Python console emulates the interactive Python interpreter from within NVDA. It is a development tool which is useful for debugging, general inspection of NVDA internals or inspection of the accessibility hierarchy of an application.
es: La consola Python de NVDA emula el intérprete interactivo de Python desde NVDA. Es una herramienta de desarrollo útil para depuración, inspección interna general de NVDA, o inspección de la jerarquía de accesibilidad de una aplicación.

source: ### 5.1. Usage
es: ### 5.1. Modo de uso

source: The console can be activated in two ways:
es: La consola puede activarse de dos formas:

source: * By pressing NVDA+control+z. If activated in this fashion, a snapshot of the current state of NVDA at the time the key was pressed will be taken and saved in certain variables available in the console. See Snapshot Variables for more details.
es: * Pulsando NVDA+ctrl+z. Si se activa de este modo, se tomará una instantánea de NVDA en el momento en que se pulsaron las teclas y se guardará en ciertas variables disponibles en la consola. Mira la sección de variables instantáneas para más detalles.

source: * By selecting Tools -> Python console from the NVDA system tray menu.
es: * Seleccionando Herramientas -> Consola Python desde el menú de NVDA de la bandeja del sistema.

source: The console is similar to the standard interactive Python interpreter. Input is accepted one line at a time and processed when enter is pressed. Multiple lines can be pasted at once from the clipboard and will be processed one by one. You can navigate through the history of previously entered lines using the up and down arrow keys.
es: La consola es similar al intérprete interactivo estándar de Python. La entrada sólo acepta una línea cada vez y la procesa al pulsar intro. Se pueden pegar varias líneas a la vez desde el portapapeles y se procesarán una a una. Puedes navegar por el historial de líneas introducidas anteriormente usando flechas arriba y abajo.

source: Output \(responses from the interpreter\) will be spoken when enter is pressed. The f6 key toggles between the input and output controls. When on the output control, alt+up/down jumps to the previous/next result \(add shift for selecting\). Pressing control+l clears the output.
es: La salida \(respuestas del intérprete\) se verbalizará al pulsar intro. La tecla f6 permite desplazarse entre los controles de entrada y salida. Cuando te encuentres en el control de salida, alt+arriba/abajo salta al resultado anterior o siguiente \(añade shift para seleccionar\). Al pulsar control+l se limpia la salida.

source: The result of the last executed command is stored in the "\_" global variable. This shadows the gettext function which is stored as a built-in with the same name. It can be unshadowed by executing "del \_" and avoided altogether by executing "\_ = \_".
es: El resultado del último comando ejecutado se almacena en la variable global "\_". Esto impide usar la función de Gettext que se aloja como función incorporada con el mismo nombre. Se puede suprimir esta superposición ejecutando "del \_", y evitarse con "\_=\_".

source: Closing the console window \(with escape or alt+F4\) simply hides it. This allows the user to return to the session as it was left when it was closed, including history and variables.
es: Cerrar la ventana de la consola \(con escape o alt+f4\) simplemente la oculta. Esto permite al usuario volver a la sesión tal y como la dejó cuando la cerró, incluyendo historial y variables.

source: ### 5.2. Namespace
es: ### 5.2. Espacio de nombres

source: #### 5.2.1. Automatic Imports
es: #### 5.2.1. Importaciones automáticas

source: For convenience, the following modules and variables are automatically imported in the console: sys, os, wx, log \(from logHandler\), api, queueHandler, config, controlTypes, textInfos, braille, speech, vision, appModules, globalPlugins
es: Los siguientes módulos y variables se importan automáticamente en la consola por conveniencia: sys, os, wx, log \(de logHandler\), api, queueHandler, config, controlTypes, textInfos, braille, speech, vision, appModules, globalPlugins

source: See: pythonConsole.PythonConsole.initNamespace
es: Consulta: pythonConsole.PythonConsole.initNamespace

source: #### 5.2.2. Snapshot Variables
es: #### 5.2.2. Variables instantáneas

source: Whenever NVDA+control+z is pressed, certain variables available in the console will be assigned according to the current state of NVDA. These variables are:
es: Cada vez que se pulse NVDA+ctrl+z, se asignarán ciertas variables en la consola basándose en el estado actual de NVDA. Estas variables son:

source: * focus: The current focus object
es: * focus: el objeto actual con el foco

source: * focusAnc: The ancestors of the current focus object
es: * focusAnc: los antepasados del objeto actual con el foco

source: * fdl: Focus difference level; i.e. the level at which the ancestors for the current and previous focus differ
es: * fdl: nivel de diferencia del foco; es decir, el nivel al que los antepasados difieren entre el objeto que tenía previamente el foco y el actual

source: * fg: The current foreground object
es: * fg: el objeto actual en primer plano

source: * nav: The current navigator object
es: * nav: el navegador de objetos actual

source: * mouse: The current mouse object
es: * mouse: el objeto actual del ratón

source: * brlRegions: The braille regions from the active braille buffer
es: * brlRegions: las regiones braille del buffer braille activo

source: ### 5.3. Tab completion
es: ### 5.3. Autocompletado con el tabulador

source: The input control supports tab-completion of variables and member attributes names. Hit the tab key once to complete the current input if there is one single candidate. If there is more than one, hit the tab key a second time to open a menu listing all matching possibilities. By default, only "public" member attributes are listed. That is, if the input is "nav.", attribute names with no leading underscore are proposed. If the input is "nav.\_", attribute names with a single leading underscore are proposed. Similarly, if the input is "nav.\_\_", attribute names with two leading underscores are proposed.
es: El control de entrada soporta el autocompletado mediante tabulador de variables y nombres de atributos miembros. Pulsa el tabulador una vez para autocompletar la entrada actual si hay un candidato único. Si hay más de uno, pulsa el tabulador por segunda vez para abrir un menú que liste todas las posibilidades que encajen. Por defecto, sólo se listan los atributos y miembros "públicos". Esto significa que si por ejemplo la entrada es "nav.", se proponen los nombres de atributo que no comiencen con un guión bajo. Si la entrada es "nav.\_", se proponen los atributos miembros con un guión bajo al principio. De manera similar, si la entrada es "nav.\_\_", se proponen los atributos que comiencen con dos guiones bajos.

source: ## 6\. Remote Python Console
es: ## 6\. La consola Python remota

source: A remote Python console is available in source builds of NVDA, for situations where remote debugging of NVDA is useful. It is similar to the local Python console discussed above, but is accessed via TCP.
es: En las compilaciones de código fuente de NVDA, se encuentra disponible una consola Python remota para situaciones donde la depuración remota de NVDA es útil. Es similar a la consola Python local expuesta arriba, pero se accede a ella a través de tcp.

source: Please be aware that this is a huge security risk. It is not available in binary builds distributed by NV Access, and You should only enable it if you are connected to trusted networks.
es: Por favor, sé consciente de que supone un enorme riesgo de seguridad. No se encuentra disponible en las compilaciones binarias distribuidas por NV Access, y sólo deberías activarla si estás conectado a una red de confianza.

source: ### 6.1. Usage
es: ### 6.1. Modo de uso

source: To enable the remote Python console, use the local Python console to import remotePythonConsole and call remotePythonConsole.initialize\(\). You can then connect to it via TCP port 6832.
es: Para activar la consola Python remota, usa la consola Python local para importar remotePythonConsole y llama a remotePythonConsole.initialize\(\). A continuación puedes conectarte a ella por el puerto tcp 6832.

source: History of previously entered lines is not supported.
es: No se soporta el historial de líneas introducidas previamente.

source: The namespace is the same as the namespace in the local Python console.
es: El espacio de nombres es el mismo que el de la consola Python local.

source: There are some special functions:
es: Hay algunas funciones especiales:

source: * snap\(\): Takes a snapshot of the current state of NVDA and saves it in the snapshot variables.
es: * snap\(\): toma una instantánea del estado actual de NVDA y la guarda en las variables instantáneas.

source: * rmSnap\(\): Removes all snapshot variables.
es: * rmSnap\(\): elimina todas las variables instantáneas.
