Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/developer_guide.po
Languages: es

source: There are also a few simplified navigation properties such as simpleParent, simpleNext, simpleFirstChild and simpleLastChild. These are like their respective navigation properties described above, but NVDA filters out unuseful objects. These properties are used when NVDA's simple review mode is turned on, which is the default. These simple properties may be easier to use, but the real navigation properties more closely reflect the underlying Operating System structure. Also, these may change in future versions of NVDA as improvements are made to simple review, so they should generally be avoided when programmatically locating specific objects.
es: También hay unas pocas propiedades de navegación simplificada, como simpleParent, simpleNext, simpleFirstChild y simpleLastChild. Son como sus respectivas propiedades de navegación descritas más arriba, pero NVDA filtra y desecha objetos inútiles. Estas propiedades se usan cuando el modo de revisión simple de NVDA está activado, lo que viene así por defecto. Estas propiedades simples pueden ser más fáciles de utilizar, pero las propiedades de navegación real reflejan de forma más cercana la estructura subyacente del sistema operativo. Además, también pueden cambiar en versiones futuras de NVDA según se hagan mejoras a la revisión simple, por lo que generalmente deberían evitarse al ubicar mediante programación los objetos.

source: When developing plugins, most of the time, it is not important what toolkit or API backs an NVDA Object, as the plugin will usually only access standard properties such as name, role and value. However, as plugins become more advanced, it is certainly possible to delve deeper into NVDA Objects to find out toolkit or API specific information if required.
es: Al desarrollar extensiones, en la mayoría de los casos, no es importante el kit de herramientas o la api que hay tras un objeto de NVDA, ya que la extensión normalmente sólo accederá a propiedades estándar como name, role y value. Sin embargo, según las extensiones se vuelven más avanzadas, es ciertamente posible tener que profundizar en los objetos de NVDA para obtener información específica de la api o kit de herramientas si es necesario.

source: Plugins make use of NVDA Objects in three particular ways:
es: Las extensiones hacen uso de los objetos de NVDA de tres formas concretas:

source: * Most events that plugins receive take an argument which is the NVDA Object on which the event occurred. For example, event\_gainFocus takes the NVDA Object that represents the control gaining focus.
es: * La mayoría de eventos que las extensiones reciben tienen un argumento que es el objeto en el que ha ocurrido el evento. Por ejemplo, event\_gainFocus recibe el objeto de NVDA que representa el control que obtiene el foco.

source: * Scripts, events or other code may fetch objects of interest such as the NVDA Object with focus, NVDA's current navigator object, or perhaps the Desktop NVDA Object. The code may then retreave information from that object or perhaps even retreave another object related to it \(e.g. its parent, first child, etc.\).
es: * Los eventos, scripts u otro código pueden tomar objetos de interés como el objeto NVDA que tiene el foco, el objeto NVDA actual del navegador de objetos, o tal vez el objeto NVDA del escritorio. El código puede a continuación recuperar información de ese objeto o tal vez incluso recuperar otro objeto relacionado con él \(por ejemplo su padre, primer hijo, etc.\).

source: * the Plugin may define its own custom NVDA Object classes which will be used to wrap a specific control to give it extra functionality, mutate its properties, etc.
es: * La extensión puede definir sus propias clases de objetos de NVDA personalizadas, que se usarán para envolver un control específico para darle funcionalidad extra, modificar sus propiedades, etc.

source: Just like App Modules and Global Plugins, NVDA Objects can also define events, scripts and gesture bindings.
es: Al igual que los módulos de aplicación o las extensiones, los objetos de NVDA también pueden definir eventos, scripts y asociaciones de gestos.

source: ### 3.10. Scripts and Gesture Bindings
es: ### 3.10. Scripts y asociación de gestos

source: App Modules, Global Plugins and NVDA Objects can define special methods which can be bound to a particular piece of input such as a key press. NVDA refers to these methods as scripts.
es: Los módulos de aplicación, extensiones globales y objetos de NVDA pueden definir métodos especiales que pueden asociarse a una unidad de entrada particular como una pulsación de teclado. NVDA se refiere a estos métodos llamándolos scripts.

source: A script is a standard Python instance method with a name starting with "script\_"; e.g. "script\_sayDateTime".
es: Un script es un método de instancia de Python estándar con un nombre que empieza por "script\_"; por ejemplo, "script\_sayDateTime".

source: A script method takes two arguments:
es: Un método de script recibe dos argumentos:

source: * self: a reference to the App Module, Global Plugin or NVDA Object instance the script was called on.
es: * self: una referencia a la instancia del módulo de aplicación, extensión global u objeto de NVDA donde se ha llamado al script.

source: * gesture: an Input Gesture object, which represents the input that caused the script to run.
es: * gesture: un objeto de gesto de entrada, que representa el gesto que provocó la llamada al script.

source: As well as the actual script method, some form of gesture binding must be defined, so that NVDA knows what input should execute the script.
es: Además del método del script, se debe definir alguna forma de asociación del gesto, de tal forma que NVDA sepa qué entrada debería ejecutarlo.

source: A gesture identifier string is a simple string representation of a piece of input. It consists of a two letter character code denoting the source of the input, an optional device in brackets, a colon \(:\) and one or more names separated by a plus \(+\) denoting the actual keys or input values.
es: Una cadena identificadora de gesto es una representación en forma de cadena de una unidad de entrada simple. Consiste en un código de dos caracteres que identifica la fuente de la entrada, un dispositivo opcional entre paréntesis, dos puntos \(:\) y uno o más nombres separados por el signo más \(+\) que identifican las teclas o valores de entrada.

source: Some examples of gesture string identifiers are:
es: Algunos ejemplos de cadenas identificadoras de gestos son:

source: Currently, the input sources in NVDA are:
es: Actualmente, las fuentes de entrada en NVDA son:

source: * kb: system keyboard input
es: * kb: entrada desde el teclado del sistema

source: * br: braille display controls
es: * br: controles de la pantalla braille

source: * ts: touch screen
es: * ts: pantalla táctil

source: * bk: braille keyboard input
es: * bk: entrada por teclado braille

source: When NVDA receives input, it looks for a matching gesture binding in a particular order. Once a gesture binding is found, the script is executed and no further bindings are used, nore is that particular gesture passed on automatically to the Operating System.
es: Cuando NVDA recibe entrada, busca una asociación de gesto que encaje con ella en un orden particular. Una vez se encuentra una asociación de gesto, se ejecuta el script y no se usan otras asociaciones, ni se pasa el gesto automáticamente al sistema operativo.

source: The order for gesture binding lookup is:
es: El orden de búsqueda de asociación de gestos es:

source: * The user specific gesture map
es: * El mapa de gestos específico del usuario

source: * The locale specific gesture map
es: * El mapa de gestos específico del idioma

source: * The braille display driver specific gesture map
es: * El mapa de gestos específico del controlador de la pantalla braille

source: * Loaded Global Plugins
es: * Extensiones globales cargadas

source: * App Module of the active application
es: * Módulo de aplicación de la aplicación activa

source: * Tree Interceptor of the NVDA Object with focus if any; e.g. a virtualBuffer
es: * Interceptor de árbol del objeto NVDA con el foco si lo hubiera; por ejemplo un virtualBuffer

source: * NVDA Object with focus
es: * Objeto NVDA con el foco

source: * Global Commands \(built in commands like quitting NVDA, object navigation commands, etc.\)
es: * Órdenes globales \(órdenes incorporadas como salir de NVDA, órdenes de navegación por objetos, etc.\)

source: #### 3.10.1. Defining script properties
es: #### 3.10.1. Definición de propiedades de los scripts

source: For NVDA 2018.3 and above, the recommended way to set script properties is by means of the so called script decorator. In short, a decorator is a function that modifies the behavior of a particular function or method. The script decorator modifies the script in such a way that it will be properly bound to the desired gestures. Furthermore, it ensures that the script is listed with the description you specify, and that it is categorised under the desired category in the input gestures dialog.
es: En NVDA 2018.3 y versiones posteriores, la forma recomendada de establecer las propiedades de un script se conoce como el decorador de scripts. En resumen, un decorador es una función que modifica el comportamiento de otra función o método concretos. El decorador de script modifica el script de tal manera que se asocie adecuadamente a los gestos deseados. Además, garantiza que el script se liste con la descripción especificada, y se incluya bajo la categoría deseada en el diálogo Gestos de entrada.

source: In order for you to use the script decorator, you will have to import it from the scriptHandler module.
es: Para que puedas usar el decorador de scripts, deberás importarlo desde el módulo scriptHandler.

source: After that, just above your script definition, add the script decorator, providing it the desired arguments. For example:
es: Después, justo encima de la definición de tu script, añade el decorador para scripts, proporcionándole los argumentos deseados. Por ejemplo:

source: In this example, your script will be listed in the input gestures dialog under the "Miscellaneous" category. It will have the description "Speaks the date and time", and will be bound to the "NVDA+shift+t" and "NVDA+alt+r" key combinations on the keyboard.
es: En este ejemplo, tu script se listará en el diálogo Gestos de entrada bajo la categoría "Miscelánea". Tendrá la descripción "Speaks the date and time", y estará asociado a las combinaciones de teclado "NVDA+shift+t" y "NVDA+alt+r".

source: The following keyword arguments can be used when applying the script decorator:
es: Se pueden usar los siguientes argumentos al aplicar el decorador de script:

source: * description: A short, translatable string which describes the command for users. This is reported to users when in Input Help mode and shown in the input gestures dialog. The script will not appear in the Input Gestures dialog unless you specify a description.
es: * description: una cadena corta y traducible que describa la orden a los usuarios. Los usuarios escucharán esta información en el modo ayuda de entrada y la verán en el diálogo Gestos de entrada. El script no aparecerá en el diálogo Gestos de entrada a menos que se especifique una descripción.

source: * category: The category of the script in order for it to be grouped with other similar scripts. For example, a script in a global plugin which adds browse mode quick navigation keys may be categorized under the "Browse mode" category. The category can be set for individual scripts, but you can also set the "scriptCategory" attribute on the plugin class, which will be used for scripts which do not specify a category. There are constants for common categories prefixed with SCRCAT\_ in the inputCore and globalCommands modules, which can also be specified. The script will be listed under the specified category in the Input Gestures dialog. If no category is specified, the script will be categorized under "Miscellaneous".
es: * category: categoría del script para agruparlo con otros scripts similares. Por ejemplo, un script en una extensión global que añade teclas rápidas de navegación en el modo exploración puede meterse bajo la categoría "Modo exploración". Se puede establecer la categoría de cada script individualmente, pero también puedes establecer el atributo "scriptCategory" en la clase de la extensión, que se usará para scripts que no especifiquen una categoría. Hay constantes para categorías comunes, prefijadas con SCRCAT\_ en los módulos inputCore y globalCommands. El script se listará en la categoría especificada en el diálogo Gestos de entrada. Si no se especifica categoría, el script se meterá en "Miscelánea".

source: * gesture: A string containing a single gesture associated with this script, e.g. "kb:NVDA+shift+r".
es: * gesture: una cadena que contiene un único gesto asociado con este script, por ejemplo "kb:NVDA+shift+r".

source: * gestures: A string list of multiple gestures associated with this script, e.g. \["kb:NVDA+shift+r", "kb:NVDA+alt+t"\]. When both gesture and gestures are specified, they are combined. Either gesture, or any item in gestures can be used to trigger the script.
es: * gestures: una lista de cadenas con varios gestos asociados a este script, por ejemplo \["kb:NVDA+shift+r", "kb:NVDA+alt+t"\]. Cuando se especifican tanto gesture como gestures, se combinan. Cualquier elemento de gesture o gestures se puede usar para activar el script.

source: * canPropagate: A boolean indicating whether this script should also apply when it belongs to a focus ancestor object. For example, this can be used when you want to specify a script on a particular foreground object, or another object in the focus ancestry which is not the current focus object. This option defaults to False.
es: * canPropagate: un booleano que indica si este script debería aplicarse también a los antecesores del objeto con el foco. Por ejemplo, se puede usar cuando quieres especificar un script en particular para un objeto en primer plano, o en cualquier objeto en la ascendencia del foco que no sea el objeto actualmente enfocado. Esta opción es por defecto False.

source: * bypassInputHelp: A boolean indicating whether this script should run when input help is active. This option defaults to False.
es: * bypassInputHelp: un booleano que indica si este script debería ejecutarse con el modo de ayuda de entrada activado. Por defecto esta opción es False.

source: * allowInSleepMode: A boolean indicating whether this script should run when sleep mode is active. This option defaults to False.
es: * allowInSleepMode: Un booleano que indica si este script debería funcionar con el modo silencioso activado. El valor predeterminado de esta opción es False.

source: * resumeSayAllMode: The say all mode that should be resumed when active before executing this script. The constants for say all mode are prefixed with CURSOR\_ and specified in the sayAllHandler modules. If resumeSayAllMode is not specified, say all does not resume after this script.
es: * resumeSayAllMode: el modo verbalizar todo que debería reanudarse si estaba activo antes de ejecutar este script. Las constantes del modo verbalizar todo llevan el prefijo CURSOR\_ y se especifican en el módulo sayAllHandler. Si no se especifica resumeSayAllMode, verbalizar todo no se reanuda tras ejecutar este script.

source: Though the script decorator makes the script definition process a lot easier, there are more ways of binding gestures and setting script properties. For example, a special "\_\_gestures" Python dictionary can be defined as a class variable on an App Module, Global Plugin or NVDA Object. This dictionary should contain gesture identifier strings pointing to the name of the requested script, without the "script\_" prefix. You can also specify a description of the script in the method's " _doc_ " attribute. However, beware not to include an inline docstring at the start of the method if you do not set the " _doc_ " attribute, as it would render the description not translatable. The script decorator does not suffer from this limitation, so you are encouraged to provide inline docstrings as needed when using it. Furthermore, an alternative way of specifying the script's category is by means of setting a "category" attribute on the script method to a string containing the name of the category.
es: Aunque el decorador script hace mucho más fácil el proceso de definición de scripts, hay más formas de asociar scripts y establecer sus propiedades. Por ejemplo, se puede definir como variable de clase un diccionario Python especial llamado "\_\_gestures" en un módulo de aplicación, extensión global u objeto NVDA. Este diccionario debería contener cadenas con identificadores de gestos apuntando al nombre del script solicitado, sin el prefijo "script\_". También se puede especificar una descripción para el script en el atributo "_doc_" del método. Sin embargo, procura no incluir una cadena de documentación en línea como comienzo del método si no configuras el atributo "_doc_", ya que la descripción renderizada no sería traducible. El decorador script no padece esta limitación, por lo que se recomienda que uses cadenas de documentación en línea según sea necesario cuando lo emplees. Además, una forma alternativa de especificar la categoría del script es crear un atributo "category" en la función del script que contenga una cadena con el nombre de la categoría.

source: ### 3.11. Example 4: A Global Plugin to Find out Window Class and Control ID
es: ### 3.11. Ejemplo 4: una extensión global para encontrar la clase de la ventana y el identificador del control

source: The following Global Plugin allows you to press NVDA+leftArrow to have the window class of the current focus announced, and NVDA+rightArrow to have the window control ID of the current focus announced. This example shows you how to define one or more scripts and gesture bindings on a class such as an App Module, Global Plugin or NVDA Object.
es: La siguiente extensión global te permite pulsar NVDA+flecha izquierda para verbalizar la clase de ventana del objeto con el foco; y NVDA+flecha derecha para anunciar el identificador de ventana del control actual con el foco. Este ejemplo te muestra cómo definir uno o más scripts y asociaciones de gestos en una clase tal como un módulo de aplicación, extensión global u objeto de NVDA.

source: Copy and paste the code between \(but not including\) the start and end markers into a new text file with a name of example3.py, which should be saved in the globalPlugins subdirectory. Be very careful to keep all tabs and spaces intact.
es: Copia el código entre \(pero sin incluir\) los marcadores de inicio y fin en un nuevo archivo de texto con el nombre example3.py, y guárdalo en el subdirectorio globalPlugins. Ten mucho cuidado para mantener todos los tabuladores y espacios intactos.

source: #Window utility scripts for NVDA
es: #Scripts de utilidades de ventana para NVDA

source: #Developer guide example 4
es: # Ejemplo 4 de la guía del desarrollador

source: ui.message("class for %s window: %s" % (name, windowClassName))
es: ui.message("clase para ventana %s: %s" % (name, windowClassName))

source: ui.message("Control ID for %s window: %d" % (name, windowControlID))
es: ui.message("Identificador de control para la ventana %s: %d" % (name, windowControlID))

source: ### 3.12. Events
es: ### 3.12. Eventos

source: When NVDA detects particular toolkit, API or Operating System events, it abstracts these and fires its own internal events on plugins and NVDA Objects.
es: Cuando NVDA detecta eventos particulares del kit de herramientas, api o sistema operativo, los abstrae y dispara sus propios eventos en extensiones y objetos NVDA.

source: Although most events are related to a specific NVDA Object \(e.g. name change, gain focus, state change, etc.\), these events can be handled at various levels. When an event is handled, it is stopped from going further down the chain. However, code inside the event can choose to propagate it further if needed.
es: Aunque la mayoría de eventos están relacionados con un objeto de NVDA específico \(por ejemplo cambio de nombre, obtención de foco, cambio de estado, etc.\), estos eventos pueden manejarse a varios niveles. Cuando un evento se captura, se impide que pase al siguiente punto de la cadena. Sin embargo, el código dentro del evento puede elegir si se propaga más adelante.

source: The order of levels through which the event passes until an event method is found is:
es: El orden de niveles por los que pasa el evento hasta que se encuentra un método de evento es:

source: * The App Module associated with the NVDA Object on which the event was fired
es: * El módulo de aplicación asociado con el objeto de NVDA en el que se ha disparado el evento

source: * The Tree Interceptor \(if any\) associated with the NVDAObject on which the event was fired
es: * El interceptor de árbol \(si lo hay\) asociado con el objeto de NVDA donde se ha disparado el evento

source: * the NVDAObject itself.
es: * El propio objeto de NVDA.

source: Events are Python instance methods, with a name starting with "event\_" followed by the actual name of the event \(e.g. gainFocus\).
es: Los eventos son métodos Python de instancia, con un nombre que empieza por "event\_" seguido del nombre real del evento \(por ejemplo, gainFocus\).

source: These event methods take slightly different arguments depending at what level they are defined.
es: Estos métodos de evento reciben argumentos ligeramente diferentes dependiendo del nivel en el que se definan.

source: If an event for an NVDA Object is defined on an NVDA Object itself, the method only takes one mandatory argument which is the 'self' argument; i.e. the NVDA Object instance\). Some events may take extra arguments, though this is quite rare.
es: Si se define un evento para un objeto de NVDA en ese objeto, el método sólo recibe un argumento obligatorio, el argumento 'self'; es decir, la instancia del objeto de NVDA. Algunos eventos pueden recibir argumentos extra, aunque es bastante raro.

source: If an event for an NVDA Object is defined on a Global Plugin, App Module or Tree Interceptor, the event takes the following arguments:
es: Si se define un evento para un objeto de NVDA en una extensión global, módulo de aplicación o interceptor de árbol, el evento recibe los siguientes argumentos:

source: * self: the instance of the Global Plugin, App Module or Tree Interceptor
es: * self: la instancia de la extensión global, módulo de aplicación o interceptor de árbol

source: * obj: the NVDA Object on which the event was fired
es: * obj: el objeto de NVDA en el que se ha disparado el evento

source: * nextHandler: a function that when called will propagate the event further down the chain.
es: * nextHandler: una función que al ser llamada propaga el evento al siguiente punto de la cadena.

source: Some common NVDA Object events are:
es: Algunos eventos comunes de objetos de NVDA son:

source: * foreground: this NVDA Object has become the new foreground object; i.e. active top-level object
es: * foreground: este objeto de NVDA se ha convertido en el nuevo objeto en primer plano; es decir, el objeto activo de nivel superior.

source: * focusEntered: Focus has moved inside this object; i.e. it is an ancestor of the focus object
es: * focusEntered: el foco se ha movido dentro de este objeto; es decir, es un antepasado del objeto con el foco

source: * caret: when the caret \(insertion point\) within this NVDA Object moves
es: * caret: cuando el caret \(punto de inserción\) se mueve dentro de este objeto de NVDA
