Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/developer_guide.po
Languages: es

source: If you wish to improve NVDA's access to a particular application, it is most likely you will want to write an App Module. In contrast, if you wish to add some overall functionality to NVDA \(e.g. a script that announces current Wireless network strength while in any application\), then a Global Plugin is what you want.
es: Si quieres mejorar el acceso de NVDA a una aplicación en particular, lo más probable es que necesites escribir un módulo de aplicación. En contraste, si quisieras añadir alguna funcionalidad general a NVDA \(por ejemplo, un script que verbalice la fuerza de la señal de la red wi-fi desde cualquier aplicación\), lo que necesitas entonces es una extensión global.

source: Both App Modules and Global Plugins share a common look and feel. They are both Python source files \(with a .py extension\), they both define a special class containing all events, scripts and bindings, and they both may define custom classes to access controls, text content and complex documents. However, they do differ in some ways.
es: Tanto los módulos de aplicación como las extensiones globales tienen mucho en común. Ambos son archivos con código fuente Python \(con una extensión .py\), ambos definen una clase especial que contiene todos los eventos, scripts y asociaciones, y ambos pueden definir clases personalizadas para acceder a controles, contenido textual y documentos complejos. Sin embargo, difieren en algunos aspectos.

source: Custom appModules and globalPlugins can be packaged into NVDA add-ons. This allows easy distribution, and provides a safe way for the user to install and uninstall the custom code. Please refer to the Add-ons section later on in this document.
es: Las extensiones globales y los módulos de aplicación personalizados pueden empaquetarse como complementos de NVDA. Esto facilita la distribución y proporciona una forma segura para que el usuario instale y desinstale código personalizado. Por favor, lee la sección que habla de complementos más adelante en este documento.

source: In order to test the code while developing, you can place it in a special 'scratchpad' directory in your NVDA user configuration directory. You will also need to configure NVDA to enable loading of custom code from the Developer Scratchpad Directory, by enabling this in the Advanced category of NVDA's Settings dialog. The Advanced category also contains a button to easily open the Developer Scratchpad directory if enabled.
es: Para probar el código durante el desarrollo, puedes situarlo en un directorio especial llamado 'scratchpad' en tu carpeta de configuración de usuario de NVDA. También será necesario configurar NVDA para habilitar la carga de código personalizado desde el directorio scratchpad para desarrolladores. Esto se puede hacer desde la categoría Avanzado del diálogo de opciones de NVDA. La categoría Avanzado también contiene un botón para abrir fácilmente la carpeta scratchpad de desarrollo si está activada.

source: The following few sections will talk separately about App Modules and Global Plugins. After this point, discussion is again more general.
es: Las siguientes secciones hablarán por separado de módulos de aplicación y extensiones globales. Después de este punto, la discusión volverá a ser más general.

source: ### 3.3. Basics of an App Module
es: ### 3.3. Lo básico de un módulo de aplicación

source: App Module files have a .py extension, and are named the same as either the main executable of the application for which you wish them to be used or the package inside a host executable. For example, an App Module for notepad would be called notepad.py, as notepad's main executable is called notepad.exe. For apps hosted inside host executables, see the section on app modules for hosted apps.
es: Los archivos de módulo de aplicación tienen una extensión .py, y tienen el mismo nombre del archivo ejecutable de la aplicación para la que quieras que se usen o el nombre del paquete dentro de un ejecutable contenedor. Por ejemplo, un módulo de aplicación para el bloc de notas se llamaría notepad.py, ya que el ejecutable principal del bloc de notas se llama notepad.exe. Para las aplicaciones alojadas en un ejecutable contenedor, consulta la sección sobre módulos de aplicación para aplicaciones alojadas.

source: App Module files must be placed in the appModules subdirectory of an add-on, or of the scratchpad directory of the NVDA user configuration directory.
es: Los archivos de módulo de aplicación deben situarse en la subcarpeta appModules de un complemento, o en el directorio scratchpad de la carpeta de configuración de usuario de NVDA.

source: App Modules must define a class called AppModule, which inherits from appModuleHandler.AppModule. This class can then define event and script methods, gesture bindings and other code. This will all be covered in depth later.
es: Los módulos de aplicación deben definir una clase llamada AppModule, que hereda de appModuleHandler.AppModule. Esta clase puede definir métodos de eventos y scripts, asociaciones de gestos y otro código. Esto se cubrirá más tarde en profundidad.

source: NVDA loads an App Module for an application as soon as it notices the application is running. The App Module is unloaded once the application is closed or when NVDA is exiting.
es: NVDA carga el módulo de aplicación para una aplicación dada tan pronto como se da cuenta de que esa aplicación se está ejecutando. El módulo de aplicación se descarga una vez se cierra la aplicación o se sale de NVDA.

source: ### 3.4. Example 1: An App Module that Beeps on Focus Change Events
es: ### 3.4. Ejemplo 1: un módulo de aplicación que pita ante eventos de cambio de foco

source: The following example App Module makes NVDA beep each time the focus changes within the notepad application. This example shows you the basic layout of an App Module.
es: El siguiente módulo de aplicación de ejemplo hace que NVDA pite cada vez que cambia el foco en la aplicación bloc de notas. Este ejemplo te muestra la estructura básica de un módulo de aplicación.

source: Copy and paste the code between \(but not including\) the start and end markers into a new text file called notepad.py, which should be saved in the AppModules subdirectory. Be very careful to keep all tabs and spaces intact.
es: Copia y pega el código entre \(pero sin incluir\) los marcadores de inicio y fin en un nuevo archivo de texto llamado notepad.py, que debería guardarse en el subdirectorio appModules. Ten mucho cuidado, debes conservar intactos todos los tabuladores y espacios.

source: Once saved in the correct location, either restart NVDA or choose Reload Plugins found under Tools in the NVDA menu.
es: Una vez guardado en la ubicación correcta, reinicia NVDA o bien elige Recargar plugins en el submenú herramientas del menú de NVDA.

source: Finally, open Notepad and move the focus around the application; e.g. move along the menu bar, open some dialog boxes, etc. You should hear beeps each time the focus changes. Note though that if you move outside of Notepad - for instance, to Windows Explorer - you do not hear beeps.
es: Finalmente, abre el bloc de notas y mueve el foco por la aplicación; por ejemplo muévete a lo largo de la barra de menú, abre algunos cuadros de diálogo, etc. Deberías oír pitidos cada vez que cambie el foco. Date cuenta de que si te mueves fuera del bloc de notas - por ejemplo, al explorador de Windows - no oirás pitidos.

source: --- start ---
es: --- inicio ---

source: # Notepad App Module for NVDA
es: # Módulo de aplicación del bloc de notas para NVDA

source: # Developer guide example 1
es: # Ejemplo 1 de la guía del desarrollador

source: --- end ---
es: --- fin ---

source: This App Module file starts with two comment lines, which describe what the file is for.
es: Este archivo de módulo de aplicación empieza con dos líneas de comentarios, que describen para qué es el archivo.

source: It then imports the appModuleHandler module, so that the App Module then has access to the base AppModule class.
es: Después importa el módulo appModuleHandler, lo que le da al módulo de aplicación acceso a la clase base AppModule.

source: Next, it defines a class called AppModule, which is inherited from appModuleHandler.AppModule.
es: Después, define una clase AppModule, que hereda de appModuleHandler.AppModule.

source: Inside this class, it defines 1 or more events, scripts or gesture bindings. In this example, it defines one event method for gainFocus events \(event\_gainFocus\), which plays a short beep each time it is executed. The implementation of this event is not important for the purposes of this example. The most important part is the class itself. Events will be covered in greater detail later.
es: Dentro de esta clase, define uno o más eventos, scripts o asociaciones de gestos. En este ejemplo, define un método de evento para los eventos gainFocus \(event\_gainFocus\), que reproduce un pitido corto cada vez que se ejecuta. La implementación de este evento no es importante para los propósitos de este ejemplo. La parte más importante es la clase en sí. Los eventos se cubrirán con mucho más detalle más adelante.

source: As with other examples in this guide, remember to delete the created app module when you are finished testing and then restart NVDA or reload plugins, so that original functionality is restored.
es: Como se pide con otros ejemplos de esta guía, recuerda eliminar el módulo de aplicación creado cuando termines de hacer pruebas y reinicia NVDA o recarga las extensiones para que se restaure la funcionalidad original.

source: ### 3.5. App modules for hosted apps
es: ### 3.5. Módulos de aplicación para aplicaciones hospedadas

source: Some executables host various apps inside. These include javaw.exe for running various java programs and wwahost.exe for some apps in Windows 8 and later.
es: Algunos ejecutables hospedan diversas aplicaciones en su interior. Entre ellos se incluyen javaw.exe para ejecutar diversos programas Java, y wwahost.exe para algunas aplicaciones en Windows 8 y posterior.

source: If an app runs inside a host executable, the name of the app module must be the name as defined by the host executable, which can be found through AppModule.appName property. For example, an app module for a java app named "test" hosted inside javaw.exe must be named test.py. For apps hosted inside wwahost, not only must the app module name be the name of the loaded app, but the app module must subclass the app module class found in wwahost.
es: Si una aplicación funciona en un ejecutable contenedor, el nombre del módulo de aplicación debe ser el nombre definido por el ejecutable contenedor, que puede obtenerse mediante la propiedad AppModule.appName. Por ejemplo, un módulo de aplicación para una aplicación Java llamada "prueba" alojada dentro de javaw.exe debe llamarse prueba.py. En el caso de las aplicaciones alojadas dentro de wwahost, el nombre del módulo de aplicación no sólo debe ser el de la aplicación cargada, sino que además se debe crear una subclase que herede de la clase del módulo de aplicación de wwahost.

source: ### 3.6. Example 2: an app module for an app hosted by wwahost.exe
es: ### 3.6. Ejemplo 2: un módulo de aplicación para una aplicación hospedada en wwahost.exe

source: The following example is same as Notepad app module above except this is for an app hosted by wwahost.exe.
es: El siguiente ejemplo es igual que el módulo de aplicación para el bloc de notas anterior, salvo que en este caso es para una aplicación alojada en wwahost.exe.

source: # wwahost/test App Module for NVDA
es: # Módulo de aplicación wwahost/test para NVDA

source: # Developer guide example 2
es: # Ejemplo 2 de la guía del desarrollador

source: The biggest difference from Notepad app module is where wwahost app module comes from. As a built-in app module, wwahost can be imported from nvdaBuiltin.appModules.
es: La mayor diferencia con respecto al módulo de aplicación del bloc de notas es el lugar de procedencia del módulo de aplicación wwahost. Al ser un módulo de aplicación incorporado, se puede importar wwahost desde nvdaBuiltin.appModules.

source: Another difference is how the app module class is defined. As wwahost app module provides necessary infrastructure for apps hosted inside, you just need to subclass the wwahost AppModule class.
es: Otra diferencia es el modo de definir la clase del módulo de aplicación. Ya que el módulo de aplicación wwahost proporciona la infraestructura necesaria para las aplicaciones alojadas en su interior, simplemente es necesario crear una subclase que herede de la clase del módulo de aplicación de wwahost.

source: ### 3.7. Basics of a Global Plugin
es: ### 3.7. Lo básico de una extensión global

source: Global Plugin files have a .py extension, and should have a short unique name which identifies what they do.
es: Los archivos de extensión global tienen la extensión .py, y deberían tener un nombre corto y único que identifique lo que hacen.

source: Global plugin files must be placed in the globalPlugins subdirectory of an add-on, or of the scratchpad directory of the NVDA user configuration directory.
es: Los archivos de extensión global deben situarse en el subdirectorio globalPlugins de un complemento, o en la carpeta scratchpad del directorio de configuración de usuario de NVDA.

source: Global Plugins must define a class called GlobalPlugin, which inherits from globalPluginHandler.GlobalPlugin. This class can then define event and script methods, gesture bindings and other code. This will all be covered in depth later.
es: Las extensiones globales deben definir una clase llamada GlobalPlugin, que hereda de globalPluginHandler.GlobalPlugin. Esta clase puede definir a continuación métodos de eventos y scripts, asociaciones de gestos y otro código. Esto se cubrirá en profundidad más tarde.

source: NVDA loads all global plugins as soon as it starts, and unloads them on exit.
es: NVDA carga todas las extensiones globales tan pronto como se inicia, y las descarga al salir.

source: ### 3.8. Example 3: a Global Plugin Providing a Script to Announce the NVDA Version
es: ### 3.8. Ejemplo 3: una extensión global que proporciona un script para verbalizar la versión de NVDA

source: The following example Global Plugin Allows you to press NVDA+shift+v while anywhere in the Operating System to find out NVDA's version. This example is only to show you the basic layout of a Global Plugin.
es: La siguiente extensión global de ejemplo te permite pulsar NVDA+shift+v en cualquier sitio del sistema operativo para obtener la versión de NVDA. Este ejemplo sólo sirve para mostrarte la estructura básica de una extensión global.

source: Copy and paste the code between \(but not including\) the start and end markers into a new text file with a name of example2.py, which should be saved in the globalPlugins subdirectory. Be very careful to keep all tabs and spaces intact.
es: Copia el código entre \(pero sin incluir\) los marcadores de inicio y fin en un nuevo archivo de texto con el nombre example2.py, y guárdalo en el subdirectorio globalPlugins. Ten mucho cuidado para mantener todos los tabuladores y espacios intactos.

source: Once saved in the right place, either restart NVDA or choose Reload Plugins found under Tools in the NVDA menu.
es: Una vez guardado en el lugar correcto, reinicia NVDA o bien elige recargar plugins en el submenú herramientas del menú de NVDA.

source: From anywhere, you can now press NVDA+shift+v to have NVDA's version spoken and brailled.
es: Desde cualquier sitio, ahora puedes pulsar NVDA+shift+v para que NVDA verbalice y muestre en braille su versión.

source: # Version announcement plugin for NVDA
es: # Extensión de verbalización de versión de NVDA

source: # Developer guide example 3
es: # Ejemplo 3 de la guía del desarrollador

source: This Global Plugin file starts with two comment lines, which describe what the file is for.
es: Este archivo de extensión global comienza con dos líneas de comentarios, que describen para qué sirve el archivo.

source: It then imports the globalPluginHandler module, so that the Global Plugin has access to the base GlobalPlugin class.
es: A continuación importa el módulo globalPluginHandler, de manera que la extensión global tiene acceso a la clase base GlobalPlugin.

source: It also imports a few other modules, namely ui, versionInfo and scriptHandler, which this specific plugin needs in order for it to perform the necessary actions to announce the version.
es: También importa otros módulos llamados ui, versionInfo y scriptHandler, necesarios para que esta extensión concreta haga las acciones adecuadas para verbalizar la versión de NVDA.

source: Next, it defines a class called GlobalPlugin, which is inherited from globalPluginHandler.GlobalPlugin.
es: Después, define una clase llamada GlobalPlugin, que hereda de globalPluginHandler.GlobalPlugin.

source: Inside this class, it defines 1 or more events, scripts or gesture bindings. In this example, it defines a script method that performs the version announcement. The script decorator from the scriptHandler module is used to assign the NVDA+shift+v shortcut to this script. However, the details of the script and its binding are not important for the purposes of this example. The most important part is the class itself. More information about scripts and the script decorator can be found in the Defining script properties section of this guide.
es: En esta clase, define uno o más eventos, scripts o asociaciones de gestos. En este ejemplo, define un método de script que realiza la verbalización de versión, y ofrece una asociación de NVDA+shift+v a este script utilizando el decorador script del módulo scriptHandler. Sin embargo, los detalles del script y su asociación no son importantes para los propósitos de este ejemplo. La parte más importante es la clase en sí. Se puede encontrar más información sobre los scripts y el decorador de scripts en en la sección Definición de propiedades de scripts en esta guía.

source: As with other examples in this guide, remember to delete the created Global Plugin when finished testing and then restart NVDA or reload plugins, so that original functionality is restored.
es: Como se pide con otros ejemplos de esta guía, recuerda eliminar la extensión global creada cuando termines de hacer pruebas y reinicia NVDA o recarga las extensiones para que se restaure la funcionalidad original.

source: ### 3.9. NVDA Objects
es: ### 3.9. Objetos de NVDA

source: NVDA represents controls and other GUI elements as NVDA Objects. These NVDA Objects contain standardised properties, such as name, role, value, states and description, which allow other parts of NVDA to query or present information about a control in a generalised way. For example, the OK button in a dialog would be represented as an NVDA Object with a name of "OK" and a role of button. Similarly, a checkbox with a label of "I agree" would have a name of "I agree", a role of checkbox, and if currently checked, a state of checked.
es: NVDA representa controles y otros elementos gráficos como objetos NVDA. Estos objetos NVDA contienen propiedades estandarizadas, como nombre, rol, valor, estados y descripción, que permiten a otras partes de NVDA consultar o presentar información sobre un control de una manera generalizada. Por ejemplo, el botón Aceptar en un diálogo sería representado como un objeto NVDA con un nombre como "Aceptar" y un rol de botón. De forma similar, una casilla de verificación con una etiqueta de "Acepto" tendría un nombre de "Acepto", un rol de casilla de verificación, y si actualmente está marcada, un estado de marcada.

source: As there are many different GUI Toolkits and platform and accessibility APIs, NVDA Objects abstract these differences into a standard form that NVDA can use, regardless of the toolkit or API a particular control is made with. For example, the Ok button just discussed could be a widget in a Java application, an MSAA object, an IAccessible2 object or a UI Automation element.
es: Como hay muchos kits de herramientas gráficos y apis de accesibilidad y plataforma, los objetos NVDA abstraen sus diferencias de una forma estándar que NVDA pueda usar, sin importar la api o motor gráfico con el que un control esté hecho. Por ejemplo, el botón aceptar del que acabamos de hablar podría ser un widget en una aplicación Java, un objeto MSAA, un objeto IAccessible2 o un elemento de UI Automation.

source: NVDA Objects have many properties. Some of the most useful are:
es: Los objetos NVDA tienen muchas propiedades. Algunas de las más útiles son:

source: * name: the label of the control.
es: * name: la etiqueta del control.

source: * role: one of the ROLE\_\* constants from NVDA's controlTypes module. Button, dialog, editableText, window and checkbox are examples of roles.
es: * role: una de las constantes ROLE\_\* del módulo controlTypes de NVDA. Button, dialog, editableText, window y checkbox son ejemplos de roles.

source: * states: a set of 0 or more of the STATE\_\* constants from NVDA's controlTypes module. Focusable, focused, selected, selectable, expanded, collapsed and checked are some examples of states.
es: * states: un conjunto de 0 o más constantes STATE\_\* del módulo controlTypes de NVDA. Focusable, focused, selected, selectable, expanded, collapsed y checked son algunos ejemplos de estados.

source: * value: the value of the control; e.g. the percentage of a scroll bar or the current setting of a combo box.
es: * value: el valor del control; por ejemplo, el porcentaje de una barra deslizante o el ajuste actual de un cuadro combinado.

source: * description: a sentence or two describing what the control does \(usually the same as its tooltip\).
es: * description: una o dos frases describiendo lo que hace el control \(generalmente lo mismo que su descripción visual\).

source: * location: the object's left, top, width and height positions in screen coordinates.
es: * location: la posición horizontal, vertical, anchura y altura en coordenadas de la pantalla.

source: * parent: this object's parent object. For example, a list item object's parent would be the list containing it.
es: * parent: el objeto padre de este objeto. Por ejemplo, el padre de un objeto de elemento de lista sería la lista que lo contiene.

source: * next: the object directly after this one on the same level in logical order. For example, a menu item NVDA Object's next object is most likely another menu item within the same menu.
es: * next: el objeto directamente después de este en orden lógico en el mismo nivel. Por ejemplo, el siguiente objeto de un objeto NVDA elemento de menú es muy probablemente otro elemento de menú en el mismo menú.

source: * previous: like next but in reverse.
es: * previous: como next pero al revés.

source: * firstChild: the first direct child object of this object. For example, a list's first child would be the first list item.
es: * firstChild: el primer objeto hijo directo de este objeto. Por ejemplo, el primer hijo de una lista sería el primer elemento de lista.

source: * lastChild: the last direct child of this object.
es: * lastChild: el último hijo directo de este objeto.

source: * children: a list of all the direct children of this object; e.g. all the menu items in a menu.
es: * children: una lista de todos los hijos directos de este objeto; por ejemplo, todos los elementos de menú en un menú.
