Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/developer_guide.po
Languages: es

source: # NVDA 2021.1 Developer Guide
es: # Guía del desarrollador de NVDA 2021.1

source: ## Table of Contents
es: ## Índice

source: * 1\. Introduction
es: * 1\. Introducción

source: * 1.1. A Note About Python
es: * 1.1. Una nota sobre Python

source: * 2\. Translation
es: * 2\. Traducción

source: * 2.1. Character Descriptions
es: * 2.1. Descripción de caracteres

source: * 2.2. Symbol Pronunciation
es: * 2.2. Pronunciación de símbolos

source: * 2.2.1. Defining Complex Symbols
es: * 2.2.1. Definición de símbolos complejos

source: * 2.2.2. Defining Symbol Information
es: * 2.2.2. Definición de información de símbolos

source: * 3\. Plugins
es: * 3\. Extensiones

source: * 3.1. Overview
es: * 3.1. Descripción

source: * 3.2. Types of Plugins
es: * 3.2. Tipos de extensiones

source: * 3.3. Basics of an App Module
es: * 3.3. Lo básico de un módulo de aplicación

source: * 3.4. Example 1: An App Module that Beeps on Focus Change Events
es: * 3.4. Ejemplo 1: un módulo de aplicación que pita en los eventos de cambio del foco

source: * 3.5. App modules for hosted apps
es: * 3.5. Módulos de aplicación para aplicaciones hospedadas

source: * 3.6. Example 2: an app module for an app hosted by wwahost.exe
es: * 3.6. Ejemplo 2: un módulo de aplicación para una aplicación hospedada en wwahost.exe

source: * 3.7. Basics of a Global Plugin
es: * 3.7. Lo básico de una extensión global

source: * 3.8. Example 3: a Global Plugin Providing a Script to Announce the NVDA Version
es: * 3.8. Ejemplo 3: una extensión global que proporciona un script para verbalizar la versión de NVDA

source: * 3.9. NVDA Objects
es: * 3.9. Objetos de NVDA

source: * 3.10. Scripts and Gesture Bindings
es: * 3.10. Scripts y asociación de gestos

source: * 3.10.1. Defining script properties
es: * 3.10.1. Definición de propiedades de los scripts

source: * 3.11. Example 4: A Global Plugin to Find out Window Class and Control ID
es: * 3.11. Ejemplo 4: una extensión global para encontrar la clase de la ventana y el identificador del control

source: * 3.12. Events
es: * 3.12. Eventos

source: * 3.13. the App Module SleepMode variable
es: * 3.13. La variable SleepMode en módulos de aplicación

source: * 3.14. Example 5: A Sleep Mode App Module
es: * 3.14. Ejemplo 5: un módulo de aplicación en modo latente

source: * 3.15. Providing Custom NVDA Object Classes
es: * 3.15. Proporcionar clases de objetos personalizados de NVDA

source: * 3.16. Example 6: Command to Retrieve the Length of Text in an Edit Field Using a Custom NVDA Object
es: * 3.16. Ejemplo 6: orden para recuperar la longitud del texto en un cuadro de edición usando un objeto de NVDA personalizado

source: * 3.17. Making Small Changes to an NVDA Object in App Modules
es: * 3.17. Hacer pequeños cambios a un objeto de NVDA en módulos de aplicación

source: * 3.18. Example 7: Labelling the Notepad Edit Field Using event\_NVDAObject\_init
es: * 3.18. Ejemplo 7: etiquetando el cuadro de edición del bloc de notas usando event\_NVDAObject\_init

source: * 4\. Packaging Code as NVDA Add-ons
es: * 4\. Empaquetado de código como complementos de NVDA

source: * 4.1. Non-ASCII File Names in Zip Archives
es: * 4.1. Nombres de fichero no ASCII en archivos Zip

source: * 4.2. Manifest Files
es: * 4.2. Archivos de manifiesto

source: * 4.2.1. Available Fields
es: * 4.2.1. Campos disponibles

source: * 4.2.2. An Example Manifest File
es: * 4.2.2. Ejemplo de archivo de manifiesto

source: * 4.3. Plugins and Drivers
es: * 4.3. Extensiones y controladores

source: * 4.4. Optional install / Uninstall code
es: * 4.4. Código opcional de instalación y desinstalación

source: * 4.4.1. the onInstall function
es: * 4.4.1. La función onInstall

source: * 4.4.2. The onUninstall Function
es: * 4.4.2. La función onUninstall

source: * 4.5. Localizing Add-ons
es: * 4.5. Traducción de complementos

source: * 4.5.1. Locale-specific Manifest Files
es: * 4.5.1. Archivos de manifiesto específicos del idioma

source: * 4.5.2. Locale-specific Messages
es: * 4.5.2. Mensajes específicos del idioma

source: * 4.6. Add-on Documentation
es: * 4.6. Documentación del complemento

source: * 5\. NVDA Python Console
es: * 5\. La consola Python de NVDA

source: * 5.1. Usage
es: * 5.1. Modo de uso

source: * 5.2. Namespace
es: * 5.2. Espacio de nombres

source: * 5.2.1. Automatic Imports
es: * 5.2.1. Importaciones automáticas

source: * 5.2.2. Snapshot Variables
es: * 5.2.2. Variables instantáneas

source: * 5.3. Tab completion
es: * 5.3. Autocompletado con el tabulador

source: * 6\. Remote Python Console
es: * 6\. La consola Python remota

source: * 6.1. Usage
es: * 6.1. Modo de uso

source: ## 1\. Introduction
es: ## 1\. Introducción

source: This guide provides information concerning NVDA development, including translation and the development of components for NVDA.
es: Esta guía proporciona información relacionada con el desarrollo de NVDA, incluyendo traducción y desarrollo de componentes para este lector.

source: ### 1.1. A Note About Python
es: ### 1.1. Una nota sobre Python

source: NVDA and its components are primarily written in the Python programming language. It is not the goal of this guide to teach you Python, though examples are provided through out this guide which will help to familiarise you with the Python syntax. Documentation and other resources related to the Python language can be found at [www.python.org/](http://www.python.org/)
es: NVDA y sus componentes están escritos principalmente en el lenguaje de programación Python. El propósito de esta guía no es enseñarte Python, aunque se proporcionan ejemplos a lo largo de la guía que te ayudarán a familiarizarte con la sintaxis Python. Se pueden encontrar documentación y otros recursos relacionados con el lenguaje de programación Python en [www.python.org/](http://www.python.org/)

source: ## 2\. Translation
es: ##2\. Traducción

source: In order to support multiple languages/locales, NVDA must be translated and data specific to the locale must be provided. This section only includes information on custom NVDA file formats required for translation. Other items need to be translated, such as the NVDA user interface and documentation, but these use standard file formats. For complete documentation about translating NVDA, please see <https://github.com/nvaccess/nvda/wiki/Translating>
es: Para dar soporte a múltiples idiomas / regiones, NVDA debe traducirse y deben proporcionarse datos específicos de la región. Esta sección sólo incluye información sobre formatos de archivo personalizados de NVDA necesarios para la traducción. Es necesario traducir otros elementos, como la interfaz de usuario de NVDA y la documentación, pero aquí se usan formatos de archivo estándar. Para acceder a la documentación completa sobre la traducción de NVDA, visita la sección correspondiente en el área de desarrollo de nuestra web.

source: ### 2.1. Character Descriptions
es: ### 2.1. Descripción de caracteres

source: Sometimes, it can be very difficult or even impossible to distinguish one character from another. For example, two characters might be pronounced the same way, even though they are actually different characters. To help users when this occurs, character descriptions can be provided which describe the character in a unique way.
es: En ocasiones, puede ser muy difícil o incluso imposible distinguir un carácter de otro. Por ejemplo, se podrían pronunciar dos caracteres de la misma manera, incluso aunque sean caracteres realmente diferentes. Para ayudar a los usuarios cuando esto ocurre, pueden proporcionarse descripciones de caracteres que describen el carácter de una forma única.

source: Character descriptions can be provided for a locale in a file named characterDescriptions.dic in the directory for the locale. This is a UTF-8 encoded text file. Blank lines and lines beginning with a "\#" character are ignored. All other lines should contain a character, followed by a tab, then one or more descriptions separated by tabs.
es: Se pueden ofrecer descripciones de caracteres para un idioma en un archivo llamado characterDescriptions.dic en el directorio del idioma. Se trata de un archivo de texto codificado en UTF-8. Las líneas en blanco o las líneas que comienzan con el carácter "\#" se ignoran. Todas las demás líneas deberían contener un carácter, seguido de un tabulador, y una o más descripciones separadas por tabuladores.

source: For example:
es: Por ejemplo:

source: # This is a comment.
es: # Esto es un comentario.

source: See the file locale\en\characterDescriptions.dic for a full example.
es: Mira el archivo locale\en\characterDescriptions.dic para ver un ejemplo completo.

source: In most cases, the characters in this file should be a single lower case character. It is assumed that characters will have the same description regardless of their case, so upper case characters are converted to lower case before looking up their character descriptions.
es: En la mayoría de casos, los caracteres en este archivo deberían de constar de una única letra minúscula. Se asume que los caracteres tendrán la misma descripción independientemente de su estado, por lo que los que están en mayúscula se convierten a minúscula antes de mirar sus descripciones.

source: ### 2.2. Symbol Pronunciation
es: ### 2.2. Pronunciación de símbolos

source: It is often useful to hear punctuation and other symbols pronounced as words when reading text, particularly when moving by character. Unfortunately, the pronunciation of symbols is inconsistent between speech synthesisers and many synthesisers do not speak many symbols and/or do not allow control over what symbols are spoken. Therefore, NVDA allows information about symbol pronunciation to be provided.
es: Con frecuencia es útil oír la puntuación y otros símbolos pronunciados como palabras al leer texto, particularmente al moverse por caracteres. Desafortunadamente, la pronunciación de símbolos es inconsistente entre sintetizadores de voz, y muchos de ellos no pronuncian muchos símbolos y / o no permiten controlar qué símbolos se pronuncian. En consecuencia, NVDA permite ofrecer información sobre la pronunciación de símbolos.

source: This is done for a locale by providing a file named symbols.dic in the directory for the locale. This is a UTF-8 encoded text file. Blank lines and lines beginning with a "\#" character are ignored. All locales implicitly inherit the symbol information for English, though any of this information can be overridden.
es: Esto se hace para un idioma proporcionando un archivo llamado symbols.dic en el directorio del idioma. Se trata de un archivo de texto plano codificado en UTF-8. Las líneas en blanco y aquellas que empiecen con un carácter "\#" se ignoran. Todos los idiomas heredan de forma implícita la información de símbolos del inglés, aunque toda esta información puede sobreescribirse.

source: The file contains two sections.
es: El archivo contiene dos secciones.

source: #### 2.2.1. Defining Complex Symbols
es: #### 2.2.1. Definición de símbolos complejos

source: The first section is optional and defines regular expression patterns for complex symbols. Complex symbols are symbols which aren't simply a character or sequence of characters, but instead require a more complicated match. An example is the full stop \(.\) sentence ending in English. The "." is used for multiple purposes, so a more complicated check is required to determine whether this refers to the end of a sentence.
es: La primera sección es opcional y define patrones de expresiones regulares para símbolos complejos. Los símbolos complejos son símbolos que no constan simplemente de un carácter o secuencia de caracteres, sino que en su lugar necesitan una expresión más complicada. Un ejemplo es el punto \(.\) de fin de frase en inglés. El "." se usa con múltiples propósitos, por lo que se necesita una comprobación más complicada para determinar si se trata del punto final de una frase.

source: The complex symbols section begins with the line:
es: La sección de símbolos complejos comienza con la línea:

source: Subsequent lines contain a textual identifier used to identify the symbol, a tab and the regular expression pattern for that symbol. For example:
es: Las siguientes líneas contienen un identificador textual usado para identificar el símbolo, un tabulador y un patrón de expresión regular para ese símbolo. Por ejemplo:

source: . sentence ending (?<=[^\s.])\.(?=[\"')\s]|$)
es: . final de frase (?<=[^\s.])\.(?=[\"')\s]|$)

source: dates with . \b(\d\d)\.(\d\d)\.(\d{2}|\d{4})\b
es: fechas con . \b(\d\d)\.(\d\d)\.(\d{2}|\d{4})\b

source: Again, the English symbols are inherited by all other locales, so you need not include any complex symbols already defined for English.
es: Una vez más, todos los idiomas heredan los símbolos del inglés, por lo que no es necesario que incluyas símbolos complejos ya definidos en inglés.

source: #### 2.2.2. Defining Symbol Information
es: #### 2.2.2. Definición de la información de símbolos

source: The second section provides information about when and how to pronounce all symbols. It begins with the line:
es: La segunda sección proporciona información sobre cuándo y cómo pronunciar todos los símbolos. Comienza con la línea:

source: Subsequent lines should contain several fields separated by tabs. The only mandatory fields are the identifier and replacement. The default will be used for omitted fields. The fields are as follows:
es: Las siguientes líneas deberían contener varios campos separados por tabuladores. Los únicos campos obligatorios son el identificador y el reemplazo. El valor por defecto se aplicará en los campos omitidos. Los campos son los siguientes:

source: * identifier: The identifier of the symbol. In most cases, this is just the character or characters of the symbol. However, it can also be the identifier of a complex symbol. Certain characters cannot be typed into the file, so the following special sequences can be used:
es: * Identificador: el identificador del símbolo. En la mayoría de casos, se trata del carácter o caracteres del símbolo. Sin embargo, también puede ser el identificador de un símbolo complejo. Ciertos caracteres no pueden escribirse en el archivo, por lo que deben usarse las siguientes secuencias especiales en estos casos:

source: * \0: null
es: * \0: nulo

source: * \t: tab
es: * \t: tabulador

source: * \n: line feed
es: * \n: salto de línea

source: * \r: carriage return
es: * \r: retorno de carro

source: * \f: form feed
es: * \f: salto de página

source: * \\\#: \# character \(needed because \# at the start of a line denotes a comment\)
es: * \\\#: el carácter \# \(necesario porque \# al comienzo de una línea la convierte en comentario\)

source: * replacement: The text which should be spoken for the symbol. If the symbol is a complex symbol, \1, \2, etc. can be used to refer to the groups matches, which will be inlined in the replacement, allowing for simpler rules. This also means that to get a \ character in the replacement, one has to type \\\\.
es: * reemplazo: el texto que se debería verbalizar para el símbolo. Si se trata de un símbolo complejo, se pueden usar \1, \2, etc. para hacer referencia a los grupos de coincidencias, que se incluirán en el reemplazo para permitir reglas más simples. Esto también significa que para conseguir un carácter \ en el reemplazo, hay que escribir \\\\.

source: * level: The symbol level at which the symbol should be spoken. The symbol level is configured by the user and specifies the amount of symbols that should be spoken. This field should contain one of the levels "none", "some", "most", "all" or "char", or "-" to use the default. "char" means that the symbol should only be pronounced when moving by character. The default is to inherit the value or "all" if there is nothing to inherit.
es: * Nivel: el nivel de símbolos en el que el símbolo debería verbalizarse. El usuario configura el nivel de símbolos, que especifica la cantidad de símbolos que deberían verbalizarse. Este campo debería contener uno de los niveles "none", "some", "most", "all" o "char", o "-" para usar el predeterminado. "char" significa que el símbolo sólo debería pronunciarse al moverse por caracteres. Por defecto se hereda el valor o "all" si no hay nada que heredar.

source: * preserve: Whether the symbol itself should be preserved to facilitate correct pronunciation by the synthesiser. For example, symbols which cause pauses or inflection \(such as the comma in English\) should be preserved. This field should be one of the following:
es: * Preservar: indica si el símbolo debería preservarse para facilitar la correcta pronunciación en el sintetizador. Por ejemplo, los símbolos que causan pausas o inflexiones \(como la coma en inglés\) deberían preservarse. Este campo debería contener los siguientes valores:

source: * never: Never preserve the symbol.
es: * never: nunca preservar el símbolo.

source: * always: Always preserve the symbol.
es: * always: preservar el símbolo siempre.

source: * norep: Only preserve the symbol if it is not being replaced; i.e. the user has set symbol level lower than the level of this symbol.
es: * norep: preservar el símbolo sólo si no se reemplaza; es decir, el usuario ha configurado el nivel de símbolos por debajo del nivel de este símbolo.

source: * -: Use the default. The default is to inherit the value or "never" if there is nothing to inherit.
es: * -: usar predeterminado. Por defecto se hereda el valor o "never" si no hay nada que heredar.

source: Finally, a display name for the symbol can be provided in a comment after a tab at the end of the line. This will be shown to users when editing the symbol information and is especially useful for translators to define translated names for English complex symbols.
es: Finalmente, se puede proporcionar un nombre para mostrar el símbolo en un comentario tras un tabulador al final de la línea. Este se mostrará a los usuarios cuando editen la información del símbolo y es especialmente útil para los traductores para definir nombres traducidos para los símbolos complejos en inglés.

source: Here are some examples:
es: Aquí hay algunos ejemplos:

source: ( left paren most
es: ( paréntesis izquierdo most

source: This means that the "\(" character should be spoken as "left paren" only when the symbol level is set to most or higher; i.e. most or all.
es: Esto significa que el carácter "\(" debería verbalizarse como "paréntesis izquierdo" sólo cuando el nivel de símbolos esté establecido en la mayoría o más alto; es decir, la mayoría o todo.

source: , comma all always
es: , coma all always

source: This means that the "," character should be spoken as "comma" when the symbol level is set to all and that the character itself should always be preserved so that the synthesiser will pause appropriately.
es: Esto significa que el carácter "," debería verbalizarse como "coma" cuando el nivel de símbolos esté establecido en todo y que el carácter en sí mismo debería preservarse siempre para que el sintetizador pause de forma apropiada.

source: This line appears in the French symbols.dic file. It means that the ". sentence ending" complex symbol should be spoken as "point". Level and preserve are not specified, so they will be taken from English. A display name is provided so that French users will know what the symbol represents.
es: Esta línea aparece en el archivo symbols.dic francés. Significa que el símbolo complejo ". sentence ending" debería verbalizarse como "point". Nivel y preservar no se han especificado, por lo que se tomarán del inglés. Se ofrece un nombre para mostrar, por lo que los usuarios franceses sabrán lo que representa el símbolo.

source: This line appears in the French symbols.dic file. It means that the first, second, and third groups of the match will be included, separated by the word 'point'. The effect is thus to replace the dots from the date with the word 'point'.
es: Esta línea aparece en el archivo symbols.dyc francés. Significa que se incluirán el primer, segundo y tercer grupo de la coincidencia, separados por la palabra 'point'. El efecto sirve para sustituir los puntos de la fecha por la palabra 'point'.

source: Please see the file locale\en\symbols.dic for the English definitions which are inherited for all locales. This is also a good full example.
es: Por favor, consulta el archivo locale\en\symbols.dic para ver las definiciones inglesas que heredan todos los idiomas. También representa un buen ejemplo completo.

source: ## 3\. Plugins
es: ## 3\. Extensiones

source: ### 3.1. Overview
es: ### 3.1. Descripción

source: Plugins allow you to customize the way NVDA behaves overall or within a particular application. They are able to:
es: Las extensiones permiten personalizar la forma en que NVDA se comporta en general o dentro de una aplicación en particular. Son capaces de:

source: * Respond to particular events such as focus and object property changes; e.g. when a control changes its name.
es: * Responder a eventos particulares como cambios de propiedades de objetos o del foco; por ejemplo, cuando un control cambia su nombre.

source: * Implement commands which are bound to particular key presses or other input.
es: * Implementar órdenes que se asocian a ciertas pulsaciones de teclado u otra entrada.

source: * Customise the behaviour of and implement additional functionality for particular controls.
es: * Personalizar el comportamiento e implementar funcionalidad adicional para controles concretos.

source: * Customise or add new support for text content and complex documents.
es: * Personalizar o añadir nuevo soporte para contenido textual y documentos complejos.

source: This section provides an introduction to developing plugins. Developers should consult the code documentation for a complete reference.
es: Esta sección ofrece una introducción al desarrollo de extensiones. Los desarrolladores deberían consultar la documentación del código para tener una referencia completa.

source: ### 3.2. Types of Plugins
es: ### 3.2. Tipos de extensiones

source: There are two types of plugins. These are:
es: Hay dos tipos de extensiones. Son los siguientes:

source: * App Modules: code specific to a particular application. The App Module receives all events for a particular application, even if that application is not currently active. When the application is active, any commands that the App Module has bound to key presses or other input can be executed by the user.
es: * Módulos de aplicación: código específico para una aplicación concreta. El módulo recibe todos los eventos de la aplicación, incluso si esa aplicación no se encuentra activa actualmente. Cuando la aplicación está activa, cualquier orden que el módulo de aplicación haya asociado a pulsaciones de teclado y otro tipo de entrada puede ser ejecutada por el usuario.

source: * Global Plugins: code global to NVDA; i.e. it is used in all applications. Global Plugins Receive all events for all controls in the Operating System. Any commands bound by a Global Plugin can be executed by the user wherever they are in the operating system, regardless of application.
es: * Extensiones globales: código global para NVDA; es decir, se usa en todas las aplicaciones. Las extensiones reciben eventos para todos los controles del sistema operativo. Cualquier orden vinculada a una extensión global puede ser ejecutada por el usuario independientemente de dónde esté en el sistema operativo, sin importar la aplicación.
