Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/developer_guide.po
Languages: es

source: * locationChange: physical screen location changes
es: * locationChange: la ubicación en la pantalla física cambia

source: There are many other events, though those listed above are usually the most useful.
es: Hay muchos otros eventos, aunque los que se han listado arriba son normalmente los más útiles.

source: For an example of an event handled by an App Module, please refer to example 1 \(focus beeps in notepad\).
es: Para ver un ejemplo de un evento manejado por un módulo de aplicación, mira el ejemplo 1 \(pitidos del foco en el bloc de notas\).

source: ### 3.13. the App Module SleepMode variable
es: ### 3.13. La variable SleepMode en módulos de aplicación

source: App Modules have one very useful property called "sleepMode", which if set to true almost completely disables NVDA within that application. Sleep Mode is very useful for self voicing applications that have their own screen reading functionality, or perhaps even some games that need full use of the keyboard.
es: Los módulos de aplicación tienen una propiedad muy útil llamada "sleepMode", que si se establece a True deshabilita casi completamente NVDA en la aplicación correspondiente. El modo latente es muy útil para aplicaciones con respuesta de voz propia o funciones internas de lectura de pantalla, o quizás incluso algunos juegos que necesitan disponer completamente del teclado.

source: Although sleep mode can be toggled on and off by the user with the key command NVDA+shift+s, a developer can choose to have sleep mode enabled by default for an application. This is done by providing an App Module for that application which simply sets sleepMode to True in the AppModule class.
es: Aunque el modo latente puede ser activado y desactivado por el usuario con la orden de teclado NVDA+shift+s, un desarrollador puede elegir tener el modo latente activado por defecto para una aplicación. Esto se hace proporcionando un módulo de aplicación para esa aplicación que simplemente establezca sleepMode a True en la clase AppModule.

source: ### 3.14. Example 5: A Sleep Mode App Module
es: ### 3.14. Ejemplo 5: un módulo de aplicación en modo latente

source: The following code can be copied and pasted in to a text file, then saved in the appModules directory with the name of the application you wish to enable sleep mode for. As always, the file must have a .py extension.
es: El siguiente código se puede copiar y pegar en un archivo de texto, y guardarse en el directorio appModules con el nombre de la aplicación para la que quieras activar el modo latente. Como siempre, el archivo debe tener extensión .py.

source: ### 3.15. Providing Custom NVDA Object Classes
es: ### 3.15. Proporcionar clases de objetos personalizados de NVDA

source: Providing custom NVDA Object classes is probably the most powerful and useful way to improve the experience of an application in an NVDA plugin. This method allows you to place all the needed logic for a particular control altogether in one NVDA Object class for that control, rather than scattering code for many controls across a plugin's events.
es: Ofrecer clases personalizadas de objetos NVDA es probablemente la forma más potente y útil de mejorar la experiencia para una aplicación en una extensión de NVDA. Este método te permite situar toda la lógica necesaria para un control en particular junta en una única clase de objeto de NVDA para ese control, en vez de crear código para muchos controles a través de los eventos de la extensión.

source: There are two steps to providing a custom NVDA Object class:
es: Hay dos pasos para proporcionar una clase de objeto de NVDA personalizado:

source: * Define the NVDA Object class and its events, scripts, gesture bindings and overridden properties.
es: * Definir la clase del objeto NVDA y sus eventos, scripts, asociaciones de gestos y propiedades sobreescritas.

source: * Tell NVDA to use this NVDA Object class in specific situations by handling it in the plugin's chooseNVDAObjectOverlayClasses method.
es: * Decirle a NVDA que use esta clase de objeto de NVDA en situaciones específicas manejándola en el método chooseNVDAObjectOverlayClasses de la extensión.

source: When defining a custom NVDAObject class, you have many NVDAObject base classes to choose from. These base classes contain the base support for the particular accessibility or OS API underlying the control, such as win32, MSAA or Java access Bridge. You should usually inherit your custom NVDAObject class from the highest base class you need in order to choose your class in the first place. For example, if you choose to use your custom NVDAObject class when the window class name is "Edit" and the window control ID is 15, you should probably inherit from NVDAObjects.window.Window, as clearly you are aware that this is a Window object. Similarly, if you match on MSAA's accRole property, you would probably need to inherit from NVDAObjects.IAccessible.IAccessible. You should also consider what properties you are going to override on the custom NVDA Object. For instance, if you are going to override an IAccessible specific property, such as shouldAllowIAccessibleFocusEvent, then you need to inherit from NVDAObjects.IAccessible.IAccessible.
es: Al definir una clase de objeto NVDA personalizado, tienes muchas clases base de objetos NVDA para elegir. Estas clases base contienen el soporte básico para la api de accesibilidad o del sistema operativo subyacente al control, como por ejemplo Win32, MSAA, o Java Access Bridge. Deberías hacer que tu clase de objeto NVDA personalizado herede de la clase base más alta que necesites para elegir tu clase en primer lugar. Por ejemplo, si eliges usar tu clase de objeto NVDA personalizada cuando el nombre de clase de ventana sea "Edit" y el identificador de control de la ventana sea 15, probablemente deberías heredar de NVDAObjects.window.Window, ya que claramente eres consciente de que este es un objeto Window. De forma similar, si te fijas en la propiedad accRole de MSAA, probablemente deberías heredar de NVDAObjects.IAccessible.IAccessible. También deberías considerar qué propiedades vas a sobreescribir en el objeto NVDA personalizado. Por ejemplo, si vas a sobreescribir una propiedad específica de IAccessible, como shouldAllowIAccessibleFocusEvent, entonces debes heredar de NVDAObjects.IAccessible.IAccessible.

source: the chooseNVDAObjectOverlayClasses method can be implemented on app modules or global plugin classes. It takes 3 arguments:
es: el método chooseNVDAObjectOverlayClasses puede implementarse en en clases de módulos de aplicación o extensiones globales. Recibe 3 argumentos:

source: 1. self: the app module or global plugin instance.
es: 1. self: la instancia del módulo de aplicación o extensión global.

source: 2. obj: the NVDAObject for which classes are being chosen.
es: 2. obj: el objeto de NVDA para el que se van a elegir clases.

source: 3. clsList: a Python list of NVDAObject classes that will be used for obj.
es: 3. clsList: una lista Python de clases de objetos NVDA que se usarán con obj.

source: Inside this method, you should decide which custom NVDA Object class\(es\) \(if any\) this NVDA Object should use by checking its properties, etc. If a custom class should be used, it must be inserted into the class list, usually at the beginning. You can also remove classes chosen by NVDA from the class list, although this is rarely required.
es: Dentro de este método, deberías decidir qué clase o clases de objeto NVDA personalizado (si las hay) debería usar este objeto NVDA comprobando sus propiedades, etc. Si debiera usarse una clase personalizada, debe insertarse en la lista de clases, normalmente al principio. También puedes eliminar clases elegidas por NVDA de la lista de clases, aunque esto rara vez hace falta.

source: ### 3.16. Example 6: Command to Retrieve the Length of Text in an Edit Field Using a Custom NVDA Object
es: ### 3.16. Ejemplo 6: orden para recuperar la longitud del texto en un cuadro de edición usando un objeto de NVDA personalizado

source: This app module for notepad provides a command to report the number of characters in edit fields. You can activate it using NVDA+l. Notice that the command is specific to edit fields; i.e. it only works while you are focused in an edit field, rather than anywhere in the application.
es: Este módulo de aplicación para el bloc de notas proporciona una orden para informar sobre el número de caracteres en los cuadros de edición. Puedes activarlo usando NVDA+l. Ten en cuenta que la orden es específica para cuadros de edición; sólo funciona si el foco está en uno, en vez de funcionar en cualquier lugar de la aplicación.

source: The following code can be copied and pasted in to a text file, then saved in the appModules directory with the name of notepad.py.
es: El siguiente código puede copiarse y pegarse en un archivo de texto, y guardarse en el directorio appModules con el nombre notepad.py.

source: ### 3.17. Making Small Changes to an NVDA Object in App Modules
es: ### 3.17. Hacer pequeños cambios a un objeto de NVDA en módulos de aplicación

source: Sometimes, you may wish to make only small changes to an NVDA Object in an application, such as overriding its name or role. In these cases, you don't need the full power of a custom NVDA Object class. To do this, you can use the NVDAObject\_init event available only on App Modules.
es: En ocasiones, puedes querer hacer solamente pequeños cambios a un objeto de NVDA en una aplicación, tales como sobreescribir su nombre o su rol. En estos casos, no necesitas el poder completo de una clase de objeto NVDA personalizada. Para hacerlo, puedes usar el evento NVDAObject\_init, disponible únicamente en módulos de aplicación.

source: The event\_NVDAObject\_init method takes two arguments:
es: El método event\_NVDAObject\_init recibe dos argumentos:

source: 1. self: the AppModule instance.
es: 1. self: la instancia del módulo de aplicación.

source: 2. obj: the NVDAObject being initialized.
es: 2. obj: el objeto de NVDA que se inicializa.

source: Inside this method, you can check whether this object is relevant and then override properties accordingly.
es: Dentro de este método, puedes comprobar si este objeto es relevante y sobreescribir propiedades en consecuencia.

source: ### 3.18. Example 7: Labelling the Notepad Edit Field Using event\_NVDAObject\_init
es: ### 3.18. Ejemplo 7: etiquetando el cuadro de edición del bloc de notas usando event\_NVDAObject\_init

source: This app module for notepad makes NVDA report Notepad's main edit field as having a name of "content". That is, when it receives focus, NVDA will say "Content edit".
es: Este módulo de aplicación para el bloc de notas hace que NVDA indique el cuadro de edición principal del bloc de notas como si tuviera el nombre "contenido". Es decir, cuando recibe el foco, NVDA dirá "contenido edición".

source: obj.name = "Content"
es: obj.name = "Contenido"

source: ## 4\. Packaging Code as NVDA Add-ons
es: ## 4\. Empaquetado de código como complementos de NVDA

source: To make it easy for users to share and install plugins and drivers, they can be packaged in to a single NVDA add-on package which the user can then install into a copy of NVDA via the Add-ons Manager found under Tools in the NVDA menu. Add-on packages are only supported in NVDA 2012.2 and later. An add-on package is simply a standard zip archive with the file extension of nvda-addon which contains a manifest file, optional install/uninstall code and one or more directories containing plugins and/or drivers.
es: Para ponerle fácil a los usuarios la tarea de instalar extensiones y controladores, estos pueden empaquetarse en un único paquete de complemento de NVDA que el usuario puede instalar en una copia de NVDA a través del administrador de complementos que se encuentra en herramientas en el menú de NVDA. Los paquetes de complementos se soportan sólo en NVDA 2012.2 y posterior. Un complemento de NVDA es simplemente un archivo Zip estándar con la extensión de archivo nvda-addon, que contiene un archivo de manifiesto, código opcional de instalación y desinstalación, y uno o más directorios con extensiones y / o controladores.

source: ### 4.1. Non-ASCII File Names in Zip Archives
es: ### 4.1. Nombres de fichero no ASCII en archivos Zip

source: If your add-on includes files which contain non-ASCII \(non-English\) characters, you should create the zip archive such that it uses UTF-8 file names. This means that these files can be extracted properly on all systems, regardless of the system's configured language. Unfortunately, many zip archivers do not support this, including Windows Explorer. Generally, it has to be explicitly enabled even in archivers that do support it. [7-Zip](http://www.7-zip.org/) supports this, though it must be enabled by specifying the "cu=on" method parameter.
es: Si tu complemento incluye archivos que contienen caracteres no ASCII \(no ingleses\), deberías crear el archivo Zip de tal manera que use nombres de archivo UTF-8. Esto significa que estos archivos pueden extraerse adecuadamente en todos los sistemas, independientemente del idioma configurado en el sistema. Por desgracia, muchos compresores zip no soportan esta característica, incluido el explorador de Windows. Generalmente, tiene que habilitarse de forma explícita incluso en compresores que sí lo soportan. [7-zip](http://www.7-zip.org) lo soporta, aunque hay que activarlo especificando el parámetro de método "cu=on".

source: ### 4.2. Manifest Files
es: ### 4.2. Archivos de manifiesto

source: Each add-on package must contain a manifest file named manifest.ini. This must be a UTF-8 encoded text file. This manifest file contains key = value pairs declaring info such as the add-on's name, version and description.
es: Cada paquete de complementos debe contener un archivo de manifiesto llamado manifest.ini. Debe ser un archivo de texto codificado en UTF-8. Este archivo de manifiesto contiene pares clave=valor que declaran información como el nombre del complemento, versión y descripción.

source: #### 4.2.1. Available Fields
es: #### 4.2.1. Campos disponibles

source: Although it is highly suggested that manifests contain all fields, the fields marked as mandatory must be included. Otherwise, the add-on will not install.
es: Aunque se sugiere encarecidamente que los manifiestos tengan todos los campos, basta con incluir sólo aquellos marcados como obligatorios. De cualquier otro modo, el complemento no se instalará.

source: * name \(string\): A short unique name for the add-on. This is used to differentiate add-ons internally and is not shown to the user. \(Mandatory\)
es: * name \(cadena\): un nombre corto y único para el complemento. Se usa para diferenciar a los complementos internamente y no se muestra al usuario. \(Obligatorio\)

source: * summary \(string\): The name of the add-on as shown to the user. \(Mandatory\)
es: * summary \(cadena\): el nombre del complemento tal como se muestra al usuario. \(Obligatorio\)

source: * version \(string\): The version of this add-on; e.g. 2.0. \(Mandatory\)
es: * version \(cadena\): la versión del complemento, por ejemplo 2.0. \(Obligatorio\)

source: * author \(string\): The author of this add-on, preferably in the form Full Name <email address>; e.g. Michael Curran <[mick@kulgan.net](mailto:mick@kulgan.net)>. \(Mandatory\)
es: * author \(cadena\): el autor del complemento, preferiblemente en la forma nombre completo &lt;dirección de correo&gt;; por ejemplo Michael Curran <[mick@kulgan.net](mailto:mick@kulgan.net)>. \(Obligatorio\)

source: * description \(string\): A sentence or two describing what the add-on does.
es: * description \(cadena\): una o dos frases que describan qué hace el complemento.

source: * url \(string\): A URL where this add-on, further info and upgrades can be found.
es: * url \(cadena\): una URL donde pueda encontrarse este complemento, sus actualizaciones y más información sobre él.

source: * docFileName \(string\): The name of the main documentation file for this add-on; e.g. readme.html. See the Add-on Documentation section for more details.
es: * docFileName \(cadena\): el nombre del archivo de documentación principal para el complemento; por ejemplo readme.html. Mira la sección de documentación de complementos para más detalles.

source: * minimumNVDAVersion \(string\): The minimum required version of NVDA for this add-on to be installed or enabled.
es: * minimumNVDAVersion \(cadena\): la mínima versión requerida de NVDA para que este complemento pueda instalarse o habilitarse.

source: * e.g "2019.1.1"
es: * por ejemplo "2019.1.1"

source: * Must be a three part version string I.E. Year.Major.Minor, or a two part version string of Year.Major. In the second case, Minor defaults to 0.
es: * debe ser una cadena de versión en tres partes, es decir año.mayor.menor, o una cadena de versión en dos partes siguiendo el esquema año.mayor. En el segundo caso, menor se pone por defecto a 0.

source: * Defaults to "0.0.0"
es: * Por defecto es "0.0.0"

source: * Must be less than or equal to `lastTestedNVDAVersion`
es: * Debe ser inferior o igual a `lastTestedNVDAVersion`

source: * lastTestedNVDAVersion \(string\): The last version of NVDA this add-on has been tested with.
es: * lastTestedNVDAVersion \(cadena\): la última versión de NVDA con la que se ha probado el complemento.

source: * e.g "2019.1.0"
es: * por ejemplo "2019.1.0"

source: * Must be greater than or equal to `minimumNVDAVersion`
es: * Debe ser mayor o igual a `minimumNVDAVersion`

source: All string values must be enclosed in quotes as shown in the example below.
es: Todos los valores de cadena deben encerrarse entre comillas, como se muestra en el ejemplo de más abajo.

source: The lastTestedNVDAVersion field in particular is used to ensure that users can be confident about installing an add-on. It allows the add-on author to make an assurance that the add-on will not cause instability, or break the users system. When this is not provided, or is less than the current version of NVDA \(ignoring minor point updates EG 2018.3.1\) then the user will be warned not to install the add-on.
es: El campo lastTestedNVDAVersion en particular se usa para asegurar que los usuarios pueden confiar a la hora de instalar un complemento. Permite que el autor asegure que el complemento no causará inestabilidad o dañará el sistema del usuario. Cuando no se proporcione o sea menor que la versión actual de NVDA \(ignorando actualizaciones menores como 2018.3.1\), el usuario recibirá una advertencia indicando que no instale el complemento.

source: #### 4.2.2. An Example Manifest File
es: #### 4.2.2. Ejemplo de archivo de manifiesto

source: ### 4.3. Plugins and Drivers
es: ### 4.3. Extensiones y controladores

source: The following plugins and drivers can be included in an add-on:
es: Se pueden incluir las siguientes extensiones y controladores en un complemento:

source: * App modules: Place them in an appModules directory in the archive.
es: * Módulos de aplicación: sitúalos en una carpeta appModules en tu archivo.

source: * Braille display drivers: Place them in a brailleDisplayDrivers directory in the archive.
es: * Controladores de pantallas braille: sitúalos en una carpeta brailleDisplayDrivers en tu archivo.

source: * Global plugins: Place them in a globalPlugins directory in the archive.
es: * Extensiones globales: sitúalas en una carpeta globalPlugins en tu archivo.

source: * Synthesizer drivers: Place them in a synthDrivers directory in the archive.
es: * Controladores de sintetizador: sitúalos en una carpeta synthDrivers en tu archivo.

source: ### 4.4. Optional install / Uninstall code
es: ### 4.4. Código opcional de instalación y desinstalación

source: If you need to execute code as your add-on is being installed or uninstalled from NVDA \(e.g. to validate license information or to copy files to a custom location\), you can provide a Python file called installTasks.py in the archive which contains special functions that NVDA will call while installing or uninstalling your add-on. This file should avoid loading any modules that are not absolutely necessary, especially Python C extensions or dlls from your own add-on, as this could cause later removal of the add-on to fail. However, if this does happen, the add-on directory will be renamed and then deleted after the next restart of NVDA. Finally, it should not depend on the existence or state of other add-ons, as they may not be installed, have already been removed or not yet be initialized.
es: Si necesitas ejecutar código según se instala o desinstala el complemento de NVDA \(por ejemplo para validar información de la licencia o copiar archivos a una ubicación personalizada\), puedes proporcionar un fichero Python llamado installTasks.py en el archivo que contiene funciones especiales a las que NVDA llamará mientras instala o desinstala el complemento. Este fichero debería evitar cargar cualquier módulo que no sea absolutamente necesario, especialmente extensiones Python para C o DLLS del complemento, ya que esto podría causar que la posterior desinstalación del complemento falle. Sin embargo, si esto pasa, se renombrará el directorio del complemento y se eliminará tras el siguiente reinicio de NVDA. Finalmente, no debería depender de la existencia o estado de otros complementos, ya que podrían no estar instalados, haber sido eliminados o estar todavía sin inicializar.

source: #### 4.4.1. the onInstall function
es: #### 4.4.1. La función onInstall

source: NVDA will look for and execute an onInstall function in installTasks.py after it has finished extracting the add-on into NVDA. Note that although the add-on will have been extracted at this time, its directory will have a .pendingInstall suffix until NVDA is restarted, the directory is renamed and the add-on is really loaded for the first time. If this function raises an exception, the installation of the add-on will fail and its directory will be cleaned up.
es: NVDA buscará y ejecutará una función onInstall en installTasks.py después de que termine de extraer el complemento en NVDA. Ten en cuenta que aunque el complemento haya sido extraído en ese momento, su directorio tendrá el sufijo .pendingInstall hasta que NVDA se reinicie, el directorio sea renombrado y el complemento realmente cargado por primera vez. Si esta función eleva una excepción, la instalación del complemento fallará y su directorio será eliminado.

source: #### 4.4.2. The onUninstall Function
es: #### 4.4.2. La función onUninstall

source: NVDA will look for and execute an onUninstall function in installTasks.py when NVDA is restarted after the user has chosen to remove the add-on. After this function completes, the add-on's directory will automatically be removed. As this happens on NVDA startup before other components are initialized, this function cannot request input from the user.
es: NVDA buscará y ejecutará una función onUninstall en installTasks.py cuando se reinicie después de que el usuario haya elegido eliminar el complemento. Después de que esta función complete su ejecución, se eliminará automáticamente el directorio del complemento. Como esto pasa en la inicialización de NVDA antes de que se carguen otros componentes, esta función no puede solicitar entrada del usuario.

source: ### 4.5. Localizing Add-ons
es: ### 4.5. Traducción de complementos
