Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/GithubPullRequestTemplateExplanationAndExamples.po
Languages: es

source: # Creating PR's on the NVDA project
es: # Creación de solicitudes de cambio en el proyecto NVDA

source: This page is meant to serve as an explanation for how to fill out [our Github pull request template](https://github.com/nvaccess/nvda/blob/master/.github/PULL_REQUEST_TEMPLATE.md)
es: Esta página está creada con la intención de servir como explicación para rellenar [la plantilla de solicitud de cambios de NVDA en GitHub (en inglés)](https://github.com/nvaccess/nvda/blob/master/.github/PULL_REQUEST_TEMPLATE.md)

source: ## The template
es: ## La plantilla

source: At the start of the template there is a HTML comment block (starting with `<!--`), which points to this wiki page, it can be left in place and will not appear once the issue is saved. Feel free to delete it, i.e. all text up to and including `-->`.
es: Al principio de la plantilla hay un bloque de comentarios en HTML (que comienza con `<!--`), que apunta a la versión inglesa de esta página en la wiki, se puede dejar donde está y no aparecerá cuando se guarde la incidencia. Puedes eliminarlo sin problema, borrando todo el texto desde el principio hasta `-->` incluido.

source: ### Link to issue number:
es: ### Enlace al número de incidencia:

source: Please include the issue number here, including information on how this pull request is related to it. This helps us to keep the information linked together. If this is a minor/trivial change an issue does not need to be created. If in doubt, please create one. Note that Github [allows you to automatically close issues using keywords](https://help.github.com/en/articles/closing-issues-using-keywords). For example, when writing `closes #7777` or `fixes #4242` in the body of the description, the mentioned issue will automatically be closed when the pull request is merged into the master branch. If your pull request is filed against another branch, such as beta, the particular issue will have to be close manually after merging the pull request.
es: Por favor, incluye aquí el número de incidencia, junto con información de la relación entre tu solicitud de cambio y esta. Esto nos permite mantener la información enlazada. Si es un cambio menor o trivial, no es necesario crear una incidencia. Ante la duda, crea una. Ten en cuenta que GitHub [permite cerrar automáticamente incidencias usando palabras clave](https://help.github.com/en/articles/closing-issues-using-keywords). Por ejemplo, si escribes `closes #7777` o `fixes #4242` en el cuerpo de la descripción, la incidencia mencionada se cerrará automáticamente al mezclar la solicitud de cambio en la rama master. Si tu solicitud de cambio se archiva en otra rama, como por ejemplo beta, habrá que cerrar la incidencia manualmente tras mezclar dicha solicitud.

source: ### Summary of the issue:
es: ### Resumen de la incidencia:

source: A quick summary of the problem you are trying to solve.
es: Un breve resumen del problema que intentas resolver.

source: ### Description of how this pull request fixes the issue:
es: ### Descripción de cómo resuelve la incidencia esta solicitud de cambios:

source: Please include a quick discussion of how this change addresses the issue. Please also include any links or external information you may have used in order to address the issue. This helps others to have the same background as you and learn from this work.
es: Incluye una breve exposición indicando cómo resuelve la incidencia este cambio. Incluye también cualquier enlace o información externa que hayas usado para solucionar el problema. Esto ayuda a que otros tengan la misma base que tú y aprendan de este trabajo.

source: ### Testing strategy:
es: ### Estrategia de pruebas:

source: Outline the steps you took to test the change. This should allow someone else to reproduce your testing.
es: Describe los pasos que seguiste para probar tus cambios. Esto debería permitir que alguien más pueda reproducir tus pruebas.

source: More broadly, try to answer the following questions:
es: Vayamos más allá, intenta responder las siguientes preguntas:

source: - How have you tested to ensure that your change works as intended?
es: - ¿Cómo has hecho las pruebas para asegurarte de que tus cambios funcionan como se esperan?

source: - Have you ensured testing coverage across all supported operating systems?
es: - ¿Te has asegurado de que hay una extensa cobertura de pruebas a través de varios sistemas operativos?

source: - Have you considered possible regressions (related features or behaviours that may break)?
es: - ¿Te has planteado que pueda haber posibles regresiones (funciones o comportamientos relacionados que puedan romperse)?

source: Please use this section as an opportunity to try to convince us (and yourself) that your proposed change should be merged.
es: Emplea esta sección como una oportunidad para intentar convencer a los desarrolladores (y a ti mismo) de que debería mezclarse el cambio que has propuesto.

source: Often in face to face development it's useful to demonstrate a change, quite often bugs are noticed at this point when the new person asks for some variation in testing approach. Since we unlikely to be able to demonstrate a feature in an interactive way, an easy-to-follow list of steps for a "demo" allows others check themselves without having to work out all the details. It also serves as a starting point for members of the community who are testing the changes that go into NVDA.
es: A menudo es útil en el desarrollo cara a cara demostrar un cambio, bastantes fallos se descubren en ese momento cuando la otra persona pide una variación en el enfoque de las pruebas. Ya que es bastante improbable que se pueda demostrar una función de manera interactiva, una lista de pasos fácil de seguir para una "demo" permite que otros puedan hacer comprobaciones por sí mismos sin tener que entrar en demasiados detalles. También sirve como punto de partida para los miembros de la comunidad que prueban los cambios que van dentro de NVDA.

source: Example:
es: Ejemplo:

source: > In NVDA settings ensure that:
es: > En las opciones de NVDA comprueba que:

source: > - Keyboard category
es: > - En la categoría teclado

source: > - "speak typed characters" is unchecked
es: > - "Verbalizar caracteres al escribir" está desmarcada

source: > - "speak typed words" is checked
es: > - "Verbalizar palabras al escribir" está marcada

source: > 1. Open notepad
es: > 1. Abre el bloc de notas

source: > 2. Type "hello"
es: > 2. Escribe "hola"

source: > 3. Press space
es: > 3. Pulsa espacio

source: > Expect "hello" to be announced.
es: > Se espera que se verbalice "hola".

source: - If many NVDA settings are required, consider attaching a sample `nvda.ini` file to the PR.
es: - Si es necesario modificar muchos ajustes de NVDA, plantéate adjuntar un archivo `nvda.ini` de muestra a la solicitud de cambio.

source: - If a complicated document is required to test with a 3rd party application, consider attaching it to the PR for others to test with.
es: - Si se necesita un documento complicado para hacer pruebas con una aplicación de terceros, plantéate adjuntarlo a la solicitud de cambios para que otros hagan pruebas también.

source: ### Known issues with pull request:
es: ### Problemas conocidos con la solicitud de cambio:

source: Are there any known issues or downsides of this approach. For instance: _Will not work with python 3_
es: ¿Hay problemas o desventajas con este enfoque? Por ejemplo: _No funcionará en Python 3_

source: ### Change log entry:
es: ### Entrada en el registro de cambios:

source: An entry intended to explain changes in NVDA to end users. Your proposed entry will be added to the `changes.t2t` file which is converted to html and used as a what's changed / change log document. See [`user_docs/en/changes.t2t`](https://github.com/nvaccess/nvda/blob/master/user_docs/en/changes.t2t)
es: Una entrada destinada a explicar los cambios en NVDA a los usuarios finales. La entrada que propongas se añadirá al archivo `changes.t2t`, que se convierte a HTML y se utiliza como documento de novedades / registro de cambios. Consulta [`user_docs/en/changes.t2t`](https://github.com/nvaccess/nvda/blob/master/user_docs/en/changes.t2t)

source: Because the `changes.t2t` file is prone to conflicts, we ask contributors not to edit the file directly, but instead add the entry to the bottom of the PR description. A lead developer will update file when merging the pull request.
es: Ya que el archivo `changes.t2t` tiende a provocar conflictos, se pide a los colaboradores que no lo editen directamente, y que en su lugar añadan la entrada en la parte inferior de la descripción de la solicitud de cambios. Un desarrollador principal actualizará el archivo cuando fusione la solicitud de cambios.

source: For instance:
es: Por ejemplo:

source: *New features*
es: *Nuevas características*

source: *Changes*
es: *Cambios*

source: These descriptions should be in the format: `"{Description of change}. (#{issue number})"`
es: Estas descripciones deberían seguir el formato: `"{Descripción del cambio}. (#{número de incidencia})"`

source: You may suggest descriptions for multiple sections. The usual sections are:
es: Puedes sugerir descripciones para varias secciones. Las secciones más comunes son:

source: * New features
es: * Nuevas características

source: * Changes
es: * Cambios

source: * Bug fixes
es: * Fallos solucionados

source: Multiple issue numbers can be included, separated by comma. If there is no issue number, you can use the PR number.
es: Se pueden incluir varios números de incidencia separados por comas. Si no hay número de incidencia, puedes usar el número de la solicitud de cambio.

source: For examples see the [changes.t2t file](https://github.com/nvaccess/nvda/blob/master/user_docs/en/changes.t2t)
es: Por ejemplo, consulta el [archivo changes.t2t](https://github.com/nvaccess/nvda/blob/master/user_docs/en/changes.t2t)

source: ## Code Review Checklist
es: ## Lista de comprobación de revisión del código

source: Code must be reviewed (via a Pull Request on GitHub) before it can be accepted into the project. The Pull Request template (``.github/PULL_REQUEST_TEMPLATE.md``) asks authors (and reviewers) to consider several aspects of the change.
es: Se debe revisar el código (mediante una solicitud de cambios en GitHub) antes de que pueda aceptarse en el proyecto. La plantilla de solicitud de cambios (``.github/PULL_REQUEST_TEMPLATE.md``) solicita a los autores (y revisores) que consideren diversos aspectos del cambio.

source: The aim of this checklist is to ensure each item has been considered by both the author and the reviewer. Hopefully it helps to prevent items being forgotten. After reviewing the checklist the reviewer and author need to use their best judgement on whether they think further changes need to be made. Reviewers are invited to start a conversation about items in the list, to provide guidance on how to improve the PR. Not all items will be applicable for all situations, in this case checking the item lets reviewers know it's been considered. If the reviewer reaches the same conclusion as the author, no further work is necessary. Most items in the checklist have a section in the PR template where you can add your thoughts, doing so may preempt questions from the reviewer ensuring you are on the same page, and speed up the review process.
es: El propósito de esta lista de comprobación es garantizar que tanto el autor como el revisor han considerado cada elemento. Con un poco de suerte, prevendrá que se olviden elementos. Tras revisar la lista de comprobación, tanto el revisor como el autor deben recurrir a su mejor juicio para determinar si se deben hacer cambios adicionales. Se invita a los revisores a iniciar una conversación sobre los elementos de la lista, para proporcionar guía sobre cómo mejorar la solicitud de cambios. No todos los elementos se aplicarán en todas las situaciones. En estos casos, marcar el elemento hará saber a los revisores que se ha tenido en cuenta. Si el revisor llega a la misma conclusión que el autor, no es necesario más trabajo. La mayoría de elementos de la lista de comprobación tienen una sección en la plantilla de solicitud de cambios donde puedes añadir tus impresiones, y al hacerlo se evitan preguntas de los revisores que aseguren que ambos os entendéis, agilizando el proceso de revisión.

source: ### Pull Request description is up to date.
es: ### La descripción de la solicitud de cambios está al día.

source: Authors must keep the PR description up to date.
es: Los autores deben mantener la descripción de la solicitud de cambios actualizada.

source: - Even if changes to the approach are described in the comments for the PR.
es: - Incluso si en los comentarios de la solicitud se describen cambios del enfoque.

source: - Future developers need a concise explanation of a change.
es: - Los desarrolladores futuros necesitan una explicación concisa del cambio.

source: After each modification, check that the PR description is still accurate.
es: Después de cada modificación, comprueba bien que la descripción de la solicitud de cambios es precisa.

source: ### Unit tests
es: ### Pruebas unitarias

source: - Discuss under "testing strategy" heading.
es: - Debate bajo el encabezado "testing strategy".

source: - Describe the coverage of automated unit tests?
es: - ¿Se describe la cobertura de las pruebas unitarias automatizadas?

source: - Is the changed code already, or can it be covered by automated unit tests?
es: - ¿Se puede cubrir el código modificado (o ya está cubierto) con pruebas unitarias automatizadas?

source: ### System tests
es: ### Pruebas del sistema

source: - Describe the coverage of automated system tests?
es: - ¿Se describe la cobertura de las pruebas automatizadas de sistema?

source: ### Manual tests
es: ### Pruebas manuales

source: - Discuss under "testing strategy" heading.
es: - Debate bajo el encabezado "testing strategy".

source: - How did you manually test the change?
es: - ¿Cómo probaste manualmente el cambio?

source: - Be clear on steps another user can take to replicate your testing.
es: - Sé claro en los pasos que otro usuario puede seguir para replicar tus pruebas.

source: - Is the described manual testing appropriate for the change?
es: - ¿Es apropiada para el cambio la prueba manual descrita?

source: - Clearly describing this helps alpha testers, and future developers.
es: - Al describirlos claramente se ayuda a los evaluadores alfa y a futuros desarrolladores.

source: - As a reviewer, please use this description to replicate the testing (if possible).
es: - Como revisor, usa esta descripción para replicar las pruebas (si es posible).

source: ### User Documentation
es: ### Documentación de usuario

source: - Does the user documentation need updating?
es: - ¿Es necesario actualizar la documentación de usuario?

source: ### Change log entry
es: ### Entrada en el registro de cambios

source: Has an appropriate change log entry been supplied. As a reviewer, please review it.
es: Se ha proporcionado una entrada adecuada en el registro de cambios. Como revisor, revísala.

source: ### Context sensitive help for GUI changes.
es: ### Ayuda sensible al contexto en cambios de interfaz gráfica.

source: - New GUI options require context sensitive help assignment.
es: - Las nuevas opciones de interfaz gráfica requieren una asignación de ayuda sensible al contexto.

source: ### UX of all users considered
es: ### Experiencia de usuario planteada para todos los usuarios

source: - Users of NVDA are diverse, and rely on different parts of NVDA. Ensure the change caters to users of the following:
es: - Los usuarios de NVDA son diversos, y se apoyan en distintas partes de NVDA. Asegúrate de que los cambios se adaptan a usuarios de lo siguiente:

source: - Speech
es: - Voz

source: - Low Vision
es: - Baja visión

source: - Different web browsers (Firefox, Chrome, Edge)
es: - Diferentes exploradores web (Firefox, Chrome, Edge)

source: - When one of these can not be supported with this change, highlight it under the "Known issues" heading
es: - Cuando no se soporte algo de esto con el cambio, destácalo bajo el encabezado "Known issues"
