Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/MakingAnOfficialRelease.po
Languages: es

source: # Making an Official Release
es: # Creación de una liberación oficial

source: The following instructions are for the release manager and detail how to make an official release.
es: Las siguientes instrucciones son para el administrador de liberaciones, y detallan cómo liberar una nueva versión oficial.

source: See [the release process](https://github.com/nvaccess/nvda/wiki/ReleaseProcess) for details on timing.
es: Consulta la documentación del proceso de liberación para más detalles sobre tiempos.

source: ## Starting a new dev cycle
es: ## Iniciar un nuevo ciclo de desarrollo

source: * Create PR to set the branch off point **(merge commit - not squash merge)**
es: * Crea una solicitud de cambio para establecer el punto que da fin a la rama **(merge commit, no squash merge)**

source: - First create a new branch (eg `branchFor2020.3`) based on the master commit that should be used for the beta.
es: - Primero, crea una nueva rama (por ejemplo, `branchFor2020.3`) basada en el commit de master que debería usarse para la beta.

source: - Using a separate branch is so that master can continue to move on without affecting the PR.
es: - Usar una rama separada garantiza que master puede seguir avanzando sin afectar a la solicitud de cambios.

source: - The PR allows for others to review the selected commit, and what will be included in the release
es: - La solicitud de cambios permite que otros puedan revisar el commit seleccionado, y lo que se incluirá en la liberación

source: - The PR makes reviewing the changes file easier.
es: - La solicitud de cambios facilita la revisión de los cambios.

source: - Do a review of the `user_docs/en/changes.t2t` file, but don't add highlights, see next step.
es: - Haz una revisión del archivo `user_docs/en/changes.t2t`, pero no añadas lo más destacado, mira el paso siguiente.

source: - Ask for a second review, use the PR and add a link to the diff for the changes file since the diff will be quite large.
es: - Solicita una segunda revisión, usa la solicitud de cambios y añade un enlace al diff del archivo de cambios, ya que el diff será bastante grande.

source: - Deciding which commit to start the beta from:
es: - Decide desde qué commit quieres que empiece la beta:

source: - This will be the branch off point for the new release.
es: - Este será el punto de finalización de rama para la próxima liberación.

source: - Before the branch off happens (but after the previous "final" release), master can be merged into beta at any point.
es: - Antes de que se descontinúe la rama (pero después de la versión "final" anterior), se puede mezclar master en beta en cualquier momento.

source: - After the branch of point master will move on and PR's required in this release should target the beta branch.
es: - Después de que el punto de master del que nace la rama avance las solicitudes de cambios necesarias deberían tener como destino la rama beta.

source: - Generally master should be healthy (all checks passing and no known regressions).
es: - Generalmente master debería estar sana (se superan todas las pruebas y no hay regresiones conocidas).

source: - In the past, the commit chosen should ensure that the most recent (significant) change should have had at least one week of alpha testing. This restriction has been relaxed somewhat to speed up the beta process. Lead developers should use their discretion to choose an appropriate branching point. If necessary, changes can be reverted or new changes added to the beta to address issues.
es: - Antes el commit seleccionado debía garantizar que el cambio más reciente (y significativo) debía haber tenido al menos una semana de pruebas alpha. Esta restricción se ha relajado un poco para acelerar el proceso beta. Los desarrolladores principales deberían usar su criterio para elegir un punto de ramificación adecuado. Si es necesario, se pueden revertir los cambios o añadir cambios nuevos para corregir fallos en la beta.

source: * Create a PR adding highlights for the release **(squash merge)**.
es: * Crea una solicitud de cambios añadiendo lo más destacado de esta versión **(squash merge)**.

source: - Based on `branchForX`
es: - Basada en `ramaParaX`

source: - Targeting either `branchForX` or beta dependent on whether the branching PR has been merged yet.
es: - Con destino `ramaParaX` o beta dependiendo de si ya se ha mezclado la solicitud de cambios de rama.

source: * Create a PR to move master on to the next release dev cycle **(squash merge)**.
es: * Crea una solicitud de cambios para mover master al siguiente ciclo de desarrollo de versión **(squash merge)**.

source: * [Add a new section to the change log](#new-section-in-changes-file).
es: * [Añade una nueva sección al registro de cambios](#nueva-seccion-en-el-archivo-de-cambios).

source: * [Update NVDA version in `master`](#update-nvda-version-in-master)
es: * [Actualiza la versión de NVDA en `master`](#update-nvda-version-in-master)

source: * When merging [update auto milestone ID](#update-auto-milestone-id)
es: * Al mezclar, [actualiza el identificador automático del hito](#update-auto-milestone-id)

source: * Create a PR to update espeak, and create and issue on the [espeak-ng repo asking for a new release](https://github.com/espeak-ng/espeak-ng/issues/new). [See discussion](https://github.com/espeak-ng/espeak-ng/issues/792).
es: * Crea una solicitud de cambios para actualizar Espeak, y crea una nueva incidencia en el [repositorio de Espeak-NG solicitando una nueva versión](https://github.com/espeak-ng/espeak-ng/issues/new). [Consulta la discusión](https://github.com/espeak-ng/espeak-ng/issues/792).

source: * If this is a 20XY.1 release, create a PR to update the Addon API `BACK_COMPAT_TO` version to match this version number for this release cycle.
es: * Si se trata de una versión 20XY.1, crea una solicitud de cambios para actualizar la versión `BACK_COMPAT_TO` de la API de complementos para que coincida con el número de versión de este ciclo de liberaciones.

source: - This PR does not need be merged until branching for the beta of the 20XY.1 release.
es: - No es necesario mezclar esta solicitud de cambios hasta que se ramifique en la beta de la versión 20XY.1.

source: - The existence of the PR is intended to act as an early warning for add-on developers of the coming change.
es: - La intención de la existencia de esta solicitud de cambios es actuar como un aviso temprano de lo que está por venir para los desarrolladores de complementos.

source: ## Beta release (pre-release)
es: ## Liberación beta (liberación previa)

source: * Create a [new annotated tag](#create-the-release--annotated-tag)
es: * Crea una nueva etiqueta anotada.

source: * Wait for the [`appVeyor` build](https://ci.appveyor.com/project/nvaccess/nvda/history) to complete.
es: * Espera a que `AppVeyor` complete la [construcción](https://ci.appveyor.com/project/nvaccess/nvda/history).

source: - Consider writing a draft of the release post.
es: - Plantéate redactar un borrador de la publicación de la versión.

source: * [Scan the launcher executable](#scan-the-build)
es: * Analiza el archivo del instalador

source: * A beta doesn't need a pre-release entry on GitHub. Save that for RC and releases
es: * Una beta no necesita una entrada de liberación previa en GitHub. Guárdatelas para las rc y las liberaciones

source: * [Publish the staged release](#publish-the-staged-release)
es: * Publica la liberación efectuada.

source: * [Publicize the release.](#publicize-the-release)
es: * Difunde la liberación.

source: ### During the Beta period
es: ### Durante el periodo beta

source: * Periodically look at recent issues filed, specifically looking for those with `p1`, `bug/crash` or `bug/app-crash` labels.
es: * Mira periódicamente las incidencias recientes archivadas, específicamente las etiquetadas como `p1`, `bug/crash` o `bug/app-crash`.

source: * Periodically look for PRs based on beta and ensure they are reviewed then merged or rejected.
es: * Mira periódicamente las solicitudes de cambio basadas en beta y asegúrate de que son revisadas y luego aprobadas / mezcladas o rechazadas.

source: - As PRs based on the beta branch are merged, periodically tag further betas.
es: - Según se vayan mezclando solicitudes de cambio basadas en la rama beta, crea nuevas etiquetas periódicamente.

source: ## Translation Freeze
es: ## Congelación de traducciones

source: * End of Beta period, after the final beta.
es: * Se considera el final del periodo beta después de la liberación de la última beta.

source: * [Call a translation freeze](https://github.com/nvaccess/nvda/wiki/StartingTranslationFreeze) for 2 weeks.
es: * [Congela las traducciones](https://github.com/nvaccess/nvda/wiki/StartingTranslationFreeze) durante 2 semanas.

source: - No more commits should be made to the beta branch at this time.
es: - Llegados a este punto, no se deberían enviar más commits a la rama beta.

source: ### Second translation freeze
es: ### Segunda congelación de traducciones

source: Normally not required, however, occasionally to fix a critical issue requires changes to the translation strings after the translation freeze has started/completed then:
es: Normalmente no hace falta. Sin embargo, a veces es necesario modificar las cadenas de traducción para resolver una incidencia crítica tras iniciar o completar la congelación de traducciones. Para hacerlo:

source: * Ensure `beta` has the changes requiring re-translation.
es: * Comprueba que `beta` tiene los cambios que requieren volver a traducir.

source: * Re complete the steps in calling a translation freeze.
es: * Vuelve a hacer los pasos descritos en el documento Iniciar una congelación de traducciones.

source: * Send an email to the translation mailing list describing the need for new changes and deadline.
es: * Envía un correo electrónico a la lista de correo de traducciones describiendo la necesidad de nuevos cambios y plazos.

source: ## Release candidates (pre-release)
es: ## Candidatas a liberación (liberaciones previas)

source: * Ensure it is safe to release an RC.
es: * Comprueba que es seguro publicar una rc.

source: - Looking at recent issues filed, specifically looking for those with `p1`, `bug/crash` or `bug/app-crash` labels.
es: - Mirando las incidencias archivadas recientemente, buscando específicamente las etiquetadas como `p1`, `bug/crash` o `bug/app-crash`.

source: * Check for PRs against `beta`.
es: * Comprueba las solicitudes de cambio para `beta`.

source: - Use [search on PR page `is:pr is:open base:beta`](https://github.com/nvaccess/nvda/pulls?utf8=%E2%9C%93&q=is%3Apr+is%3Aopen+base%3Abeta)
es: - Usa [búsqueda en la página de pull requests `is:pr is:open base:beta`](https://github.com/nvaccess/nvda/pulls?utf8=%E2%9C%93&q=is%3Apr+is%3Aopen+base%3Abeta)

source: - Look for any PRs based on `beta`, and review and approve/merge or reject them.
es: - Busca cualquier solicitud de cambio basada en `beta`, revísala y aprueba/mezcla o recházala.

source: * Check for PRs against `rc`, this is more likely after the first RC release.
es: * Revisa si hay solicitudes de cambio hacia `rc`, ya que es probable que ocurran después de liberar la primera rc.

source: - Use [search on PR page `is:pr is:open base:rc`](https://github.com/nvaccess/nvda/pulls?utf8=%E2%9C%93&q=is%3Apr+is%3Aopen+base%3Arc)
es: - Usa [búsqueda en la página de pull requests `is:pr is:open base:rc`](https://github.com/nvaccess/nvda/pulls?utf8=%E2%9C%93&q=is%3Apr+is%3Aopen+base%3Arc)

source: - Look for any PRs based on `rc`, and review and approve/merge or reject them.
es: - Busca cualquier solicitud de cambio basada en `rc`, revísala y aprueba/mezcla o recházala.

source: * If this is `RC1`, update translations:
es: * Si se trata de la `rc1`, actualiza las traducciones:

source: 1. Log into `exbi`
es: 1. Inicia sesión en `exbi`

source: 1. Switch user to nvdal10n: `sudo su nvdal10n`
es: 1. Cambia al usuario nvdal10n: `sudo su nvdal10n`

source: 1. `mr svn2nvda` **Note:**
es: 1. `mr svn2nvda`

source: - This may take a few minutes
es: - Esto podría durar unos minutos

source: - Watch for errors such as `unable to push`.
es: - Busca errores del tipo `Unable to push`.

source: 1. `exit` To return to your own user.
es: 1. Teclea `exit` para volver a tu propio usuario.

source: - **Note:** This updates `beta` with the new translations.
es: - **Nota:** esto actualiza `beta` con las nuevas traducciones.

source: * Locally, update the `rc` branch and push to GitHub
es: * Actualiza la rama `rc` localmente y envía los cambios a GitHub

source: - For RC1, reset the `rc` branch to `beta`
es: - Para la rc1, restablece la rama `rc` a `beta`

source: - For RC1+, merge `beta` to `rc`
es: - Para la rc1 y posteriores, mezcla `beta` en `rc`

source: * Create a [annotated tag](#create-the-release--annotated-tag)
es: * Crea una etiqueta anotada.

source: * Create a [new pre-release on GitHub](#convert-annotated-tag-into-a-gitHub-release)
es: * Crea una [nueva liberación previa en GitHub](#conversion-de-una-etiqueta-anotada-en-una-liberacion-de-github)

source: ## Final release
es: ## Liberación final

source: * Create a [new release on GitHub](#convert-annotated-tag-into-a-gitHub-release)
es: * Crea una [nueva liberación en GitHub](#conversion-de-una-etiqueta-anotada-en-una-liberacion-de-github)

source: * Close the release [milestone](https://github.com/nvaccess/nvda/milestones).
es: * Cierra el [hito de la liberación](https://github.com/nvaccess/nvda/milestones).

source: ## Create the release / annotated tag
es: ## Crear la liberación / etiqueta anotada

source: * Checkout the version to release.
es: * Haz checkout de la versión a liberar.

source: - `git checkout origin/<branch>`
es: - `git checkout origin/<rama>`

source: - Where `<branch>` is:
es: - Donde `<rama>` es:

source: - For a beta: `beta`
es: - Para una beta: `beta`

source: - For an RC: `rc`
es: - Para una RC: `rc`

source: - For a release: `rc`
es: - Para una liberación: `rc`

source: * Create a new annotated tag in git, and push to GitHub.
es: * Crea una nueva etiqueta anotada en Git, y envíala a GitHub.

source: - Create tag: `git tag -a <tag name> -m "<message>"`
es: - Crear etiqueta: `git tag -a <nombre de etiqueta> -m "<mensaje>"`

source: - The tag must have a `release-` prefix. EG:
es: - La etiqueta debe tener un prefijo `release-`. Por ejemplo:

source: - Release: `release-2019.2`
es: - Liberación: `Release-2019.2`

source: - The first line of the message should contain the name of the release. EG:
es: - La primera línea del mensaje debería contener el título de la liberación. Por ejemplo:

source: - Release: `Release 2019.2`
es: - Liberación: `Release 2019.2`

source: - The message may contain extra information (after a blank line) relevant to this specific release.
es: - El mensaje puede contener información extra (dejando una línea en blanco) relevante para esta liberación en concreto.

source: - Push to GitHub: `git push origin <tag name>`
es: - Envía a GitHub: `git push origin <nombre de etiqueta>`

source: - Tagging the release triggers a build on `appveyor` automatically, as part of this the release will be staged.
es: - Al etiquetar la liberación se dispara automáticamente la compilación en `appveyor`, como parte de esto se efectuará la liberación.

source: - The release will now show up on the snapshots page (under `beta` or `RC`)
es: - Ahora la liberación se mostrará en la página de versiones de desarrollo (bajo `beta` o `rc`)

source: - Auto update system will start offering it to those checking for betas
es: - El sistema de actualizaciones automáticas comenzará a ofrecerla a aquellos que busquen betas

source: ## Convert annotated tag into a GitHub release
es: ## Conversión de una etiqueta anotada en una liberación de GitHub

source: - A beta doesn't need a pre-release entry on GitHub. Save that for RC and releases
es: - Una beta no necesita una entrada de liberación previa en GitHub. Guárdatelas para las rc y las liberaciones

source: - We have been inconsistent about this in the past.
es: - No hemos sido consistentes con esto en el pasado.

source: - Visit the [GitHub new release page](https://github.com/nvaccess/nvda/tags)
es: - Visita la [página de nueva liberación de GitHub](https://github.com/nvaccess/nvda/tags)

source: - Click on the tag menu button, shown as "..." and choose "Create Release"
es: - Haz clic en el botón de menú tag, mostrado como "...", y elige "Create release"

source: - Release Title example: `Release 2019.2rc1`,
es: - Ejemplo de título de liberación: `Release 2019.2rc1`,

source: - Add a description pointing to the release post on nvaccess.org:
es: - Añade una descripción que apunte a la publicación de la liberación en nvaccess.org:

source: - For subsequent RC / Release can describe important additions & removals.
es: - Las siguientes rcs / Liberaciones pueden describir adiciones o eliminaciones importantes.

source: - For `RC`, ensure option "This is a pre-release" is checked.
es: - Si es una versión `rc`, asegúrate de que la opción "This is a pre-release" está marcada.

source: ### Reasoning
es: ### Razonamiento

source: GitHub "releases" are formatted differently, can include metadata such as 'pre-release' and can have binaries attached. In the future, we would like to move to a more automated system that creates this release from the appveyor script and attaches the binaries. Unfortunately GitHub releases don't create an "annotated tag" in git, as such the tag for the release does not have a date or message.
es: Las "releases" de GitHub tienen un formato diferente, pueden incluir metadatos como 'pre-release' y pueden tener binarios adjuntos. En el futuro, a NV Access le gustaría migrar a un sistema más automatizado que cree las liberaciones desde el script de Appveyor y adjunte los binarios. Por desgracia, las liberaciones de GitHub no crean una "etiqueta anotada" en Git, por lo que la etiqueta para la liberación no dispone de fecha o mensaje.

source: ## Scan the build
es: ## Analiza la compilación

source: - Use [VirusTotal](http://www.virustotal.com/).
es: - Utiliza [VirusTotal](http://www.virustotal.com/).

source: - Submit the download URL from the NV Access site.
es: - Envía la URL de descarga del sitio de NV Access.

source: - Recently, using the appveyor URL has resulted in 1 ("CRDF) of the 72 scanners reporting an issue.
es: - Recientemente, usar la URL de Appveyor ha dado como resultado una incidencia ("CRDF") en uno de los 72 analizadores.

source: - Follow up by scanning with the NV Access URL, which the "CRDF" scanner does not flag as an issue.
es: - Continúa analizando con la URL de NV Access, ya que el analizador "CRDF" no la identifica como problemática.

source: ## Publish the staged release
es: ## Publica la liberación efectuada

source: - Connect to `exbi`
es: - Conéctate a `exbi`

source: - Switch user to nvaccess: `sudo su nvaccess`
es: - Cambia al usuario nvaccess: `sudo su nvaccess`

source: - Run `nvdaRelease`
es: - Ejecuta `nvdaRelease`

source: - This will confirm the file currently staged.
es: - Esto confirmará el fichero actualmente almacenado.

source: ## Publicize the release
es: ## Difunde la liberación

source: - Add a blog post on www.nvaccess.org
es: - Crea una entrada de blog en www.nvaccess.org

source: - Use a previous blog post as a base.
es: - Usa como base una publicación anterior.

source: - Use a link to the file on NVAccess.org, appveyor build artifacts expire after 6 months.
es: - Usa un enlace al archivo en NVAccess.org, los artefactos de compilación de Appveyor caducan tras seis meses.

source: - **For RC and Beta:** Put post in the `Development` category.
es: - **Para rc y beta:** pon la entrada en la categoría `development`.

source: - Excluding the first pre-release, include a list of changes since the last pre-release.
es: - Excluyendo la primera liberación de prueba, incluye los cambios desde la liberación de prueba anterior.

source: - **For Final release:** Put post in the `Releases` category.
es: - **Para la versión final:** pon la entrada en la categoría `releases`.

source: - It should never be placed in the `News` category.
es: - Nunca debería situarse en la categoría `News`.

source: - Post to [nvda-devel list](https://groups.io/g/nvda-devel/post)
es: - Publica en [la lista nvda-devel](https://groups.io/g/nvda-devel/post)

source: - Post to [nvda-translations list](https://groups.io/g/nvda-translations/post)
es: - Publica en [la lista nvda-translations](https://groups.io/g/nvda-translations/post)

source: - Post to Twitter
es: - Publícala en Twitter

source: - Post on Facebook.
es: - Publica la noticia en Facebook.

source: - Post to the NV Access News email list.
es: - Publica la noticia en la lista de correo de noticias de NV Access.

source: ## Update auto milestone ID
es: ## Actualización del identificador automático del hito

source: This ensures correct milestone is set on issues and pull requests now closed by GitHub automatically.
es: Esto se asegura de que el hito correcto se ha establecido en incidencias y solicitudes de cambio cerradas ahora automáticamente por GitHub.

source: 1. Get the milestone id for the new release.
es: 1. Obtén el id del hito para la nueva liberación.

source: - Go to https://github.com/nvaccess/nvda/milestones
es: - Ve a https://github.com/nvaccess/nvda/milestones

source: - Look at the link URL for the relevant milestone.
es: - Mira la URL del enlace del hito relevante.

source: - The number at the end is the `id`.
es: - El número al final es el `id`.

source: 1. Log into exbi
es: 1. Inicia sesión en exbi

source: 1. Swap to nvaccess user: `sudo su nvaccess`
es: 2. Cambia al usuario nvaccess: `sudo su nvaccess`

source: 1. Edit `~nvaccess/data/nvaServer.conf`
es: 3. Edita `~nvaccess/data/nvaServer.conf`

source: 1. In the `[nvdaGithub]` section, change the value of `autoCloseMilestone` to the milestone `id` obtained in step 1.
es: 4. En la sección `[nvdaGithub]`, cambia el valor de `autoCloseMilestone` al identificador `id` del hito que has obtenido en el paso 1.

source: 1. Save the file and `exit` to return to your user.
es: 5. Guarda el archivo y teclea `exit` para volver a tu propio usuario.

source: 1. Reload `uwsgi` so the change takes effect: `sudo systemctl reload uwsgi`
es: 6. Recarga `uwsgi` para que los cambios tengan efecto: `sudo systemctl reload uwsgi`

source: ## Update NVDA version in `master`
es: ## Actualización de la versión de NVDA en `master`

source: In NVDA source, ensure the `master` branch version number and changes file are correct
es: En el código de NVDA, asegúrate de que el número de versión de la rama `master` y el archivo de cambios estén correctos

source: 1. In `source/buildVersion.py`, update the `version_year` and/or `version_major` variables for the next version.
es: 1. En `source/buildVersion.py`, actualiza las variables `version_year` y/o `version_major` para la próxima versión.

source: - If the next version is the first version for that year (e.g. 2018.1), also update `copyrightYears`.
es: - Si la próxima versión es la primera del año en curso, (por ejemplo, 2018.1), actualiza `copyrightYears` también.

source: 2. Add a heading for the next version in `user_docs/en/changes.t2t` if it is not there already.
es: 2. Añade un encabezado para la siguiente versión en `user_docs/en/changes.t2t` si todavía no existe.

source: ## New section in changes file
es: ## Nueva sección en el archivo de cambios

source: Add to the top of the changes file:
es: Añade al principio del archivo de cambios:

source: * If this is a 20XY.1 release add to the "Changes for Developers" section:
es: * Si se trata de una versión 20XY.1 añade esto a la sección "Changes for developers":
