Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/NVDA_Add-on_Development_Guide.po
Languages: es

source: * is64BitProcess: if true, the app is a 64-bit process (only true if you're using a 64-bit app under 64-bit Windows versions).
es: * is64BitProcess: si es true, la aplicación es un proceso de 64 bits (sólo true si se está usando una aplicación de 64 bits en versiones Windows de 64 bits).

source: * dumpOnCrash: if you are debugging apps that crashes often, you can call this function to let NVDA save a crash dump of this app in the temp files directory so you can retrieve it later.
es: * dumpOnCrash: si estás depurando aplicaciones que se bloquean con frecuencia, puedes llamar a esta función para permitir que NVDA guarde un volcado de esta aplicación en el directorio de archivos temporales para que puedas recuperarlo más tarde.

source: And other properties. Type dir(obj.appModule) from Python Console for the complete list.
es: Y otras propiedades. Escribe dir(obj.appModule) desde la consola Python para obtener la lista completa.

source: ### Other remarks on app modules
es: ### Otros comentarios sobre los módulos de aplicación

source: Here are other remarks regarding app modules:
es: Aquí hay otras observaciones sobre los módulos de aplicación:

source: * If you find that different versions of the program are laid out differently e.g. locations for controls are different, then you can write code which can handle these cases. There are a number of options you can choose from: adding some constants in your app module to handle different object locations, writing code for these controls (one per version) in custom objects which will be chosen in overlay class method and so on.
es: * Si encuentras que las diferentes versiones del programa están dispuestas de forma diferente, por ejemplo, las ubicaciones para los controles son diferentes, entonces puedes escribir código que pueda manejar estos casos. Hay una serie de opciones entre las que puedes elegir: añadir algunas constantes en tu módulo de aplicación para manejar diferentes ubicaciones de objetos, escribir código para estos controles (uno por versión) en objetos personalizados que se seleccionarán en el método de clases de superposición, etc.

source: * If possible, try working with services that the app provides, such as COM (Component Object Model) methods (for example, Outlook app module), API's the app provides (such as Winamp) and so on.
es: * Si es posible, intenta trabajar con los servicios que proporciona la aplicación, como los métodos COM (Component Object Model) (por ejemplo, el módulo de aplicación de Outlook), API's que proporciona la aplicación (como Winamp) y así sucesivamente.

source: * To support an application that works the same as another program (especially if you're writing app module for a 64-bit version of a 32-bit program for which you wrote an app module for), use the following code fragment (called aliasing):
es: * Para soportar una aplicación que funcione igual que otro programa (especialmente si estás escribiendo un módulo de aplicación para una versión de 64 bits de un programa de 32 bits para el que has escrito un módulo de aplicación), utiliza el siguiente fragmento de código (llamado aliasing):

source: where appName is the name of the app module and * (asterisk or star) means import everything. For an example of this, look at NVDA's app modules for Miranda32 and Miranda64.
es: donde appName es el nombre del app module y * (asterisco o estrella) significa importarlo todo. Para un ejemplo de esto, mira los módulos de aplicación de NVDA para Miranda32 y Miranda64.

source: * If you wish to extend an app module that comes with NVDA, use the following code fragment (this is called overriding the built-in module):
es: * Si deseas ampliar un app module que venga con NVDA, utiliza el siguiente fragmento de código (llamado sobreescritura del módulo incorporado):

source: Where appName is the app module you wish to extend. For example, if you wish to support different controls in Windows calculator (calc.py), use:
es: Donde appName es el módulo de aplicación que deseas ampliar. Por ejemplo, si deseas admitir diferentes controles en la calculadora de Windows (calc.py), utiliza:

source: * Many app modules (both built-in and third-party ones) uses app names as part of the name for a constant (a value that doesn't change). For example, in NVDA's Powerpoint module (powerpnt.py), many constants starts with "PP". Similarly, in Station Playlist Studio app module, many constants in the app module file (splstudio.py) starts with "SPL". This is used to remind you where this constants are used.
es: * Muchos módulos de aplicación (tanto integrados como de terceros) utilizan nombres de applicación como parte del nombre de una constante (un valor que no cambia). Por ejemplo, en el módulo Powerpoint de NVDA (powerpnt.py), muchas constantes comienzan con "PP". Del mismo modo, en el app module de Station Playlist Studio, muchas constantes en el archivo del módulo de aplicación (splstudio.py) comienzan con "SPL". Esto se usa para recordarte dónde se utilizan estas constantes.

source: ## Drivers
es: ## Controladores

source: A driver allows a software such as NvDA to communicate with hardware or use functionality provided by another software. Typically, when people speak of drivers, they usually refer to a program installed on a computer that allows software to communicate with a specific hardware, such as video cards, keyboards and so on.
es: Un controlador permite que un software como NVDA se comunique con el hardware o utilice la funcionalidad proporcionada por otro software. Normalmente, cuando la gente habla de controladores, usualmente se refiere a un programa instalado en una computadora que permite que el software se comunique con un hardware específico, como tarjetas de vídeo, teclados y demás.

source: In NVDA, drivers refer to modules that NVDA can use to communicate with a speech synthesizer or a braille display. For instance, you can write a braille display driver that sends braille output to your braille display, or ask your synthesizer to switch languages and provide configurable settings.
es: En NVDA, los controladores se refieren a módulos que NVDA puede utilizar para comunicarse con un sintetizador de voz o una pantalla braille. Por ejemplo, puedes escribir un controlador de pantalla braille que envíe una salida braille a la pantalla braille, o pedirle a tu sintetizador que cambie de idioma y proporcione opciones configurables.

source: ### Driver components
es: ### Componentes del controlador

source: All drivers (regardless of target device or software to be supported) imports appropriate modules such as `synthDriverHandler`. For most drivers, majority of the driver code deals with communicating with the target device or software, and all drivers must define the driver class (synthDriverHandler.SynthDriver or braille.BrailleDisplayDriver).
es: Todos los controladores (independientemente del dispositivo de destino o software que se admita) importan los módulos apropiados, como "synthDriverHandler". Para la mayoría de los controladores, la mayoría del código del controlador trata sobre la comunicación con el dispositivo o software de destino, y todos los controladores deben definir la clase de controlador (synthDriverHandler.SynthDriver o braille.BrailleDisplayDriver).

source: All driver classes, at a minimum, must contain:
es: Todas las clases de controladores, como mínimo, deben contener:

source: * Driver identifier: a camel-case string such as "oneCore" that uniquely identifies a given driver.
es: * Identificador del controlador: una cadena de caracteres como "oneCore" que identifique de forma unívoca a un controlador determinado.

source: * Friendly name: the name that'll appear under synthesizer or braille settings dialogs.
es: * Nombre amigable: el nombre que aparecerá en los cuadros de diálogo de sintetizador o de configuración braille.

source: * Availability flag: a class method named `check` that tells NVDA that the driver is ready for use.
es: * Indicador de disponibilidad: un método de clase llamado `check` que indica a NVDA que el controlador está listo para su uso.

source: * Connection manager: a set of routines that instructs NVDA as to how to locate a given synthesizer or a braille display.
es: * Gestor de conexiones: conjunto de rutinas que indican a NVDA cómo localizar un determinado sintetizador o una pantalla braille.

source: * Output handler: a function that'll perform the actual output processing. For synthesizers, `speak` method must be present; for braille displays, `display` method is needed.
es: * Manejador de salida: una función que realiza el procesamiento de salida real. Para los sintetizadores, el método `speak` debe estar presente; para las pantallas braille, se necesita el método `display`.

source: For speech synthesizers, they need to have:
es: Para los sintetizadores de voz, es necesario tener:

source: * Synth settings ring options: a list of synthesizer settings users can adjust via synth settings ring.
es: * Opciones de timbre de configuración del sintetizador: una lista de ajustes de los sintetizadores que los usuarios pueden ajustar mediante el timbre de configuración del sintetizador.

source: For braille displays:
es: Para las pantallas braille:

source: * Input handlers: if input from the braille display is desirable, the driver author must implement responders for commands such as braille keys, routing buttons and additional hardware.
es: * Manejadores de entrada: si se desea la entrada de la pantalla braille, el autor del controlador debe implementar detectores para órdenes tales como teclas braille, botones de enrutamiento y hardware adicional.

source: * Command set: a map that identifies NVDA command assignments for various display hardware buttons.
es: * conjunto de órdenes: un mapa que identifique las asignaciones de órdenes de NVDA para varios botones de hardware de la pantalla.

source: ### Few important things to remember before, during and after driver development
es: ### Unas pocas cosas importantes que recordar antes, durante y después del desarrollo de controladores

source: * Before writing a driver, make sure you have the needed software and/or hardware.
es: * Antes de escribir un controlador, asegúrate de tener el software y/o hardware necesarios.

source: * Be sure to study protocols and API's used by a speech synthesizer or a braille display (this is more so for braille displays which may implement different protocols).
es: * Asegúrate de estudiar los protocolos y las API's utilizadas por un sintetizador de voz o una pantalla braille (esto es más importante para las pantallas braille que pueden implementar diferentes protocolos).

source: * Make sure you know how to communicate with your equipment or software - ports, USB ID's, Bluetooth addresses, serial port settings, DLL's and so on.
es: * Asegúrate de saber cómo comunicarte con el equipo o software: puertos, IDs USB, direcciones Bluetooth, configuración del puerto serie, dlls, etc.

source: * Work with another person who happens to use the equipment or software you are writing driver(s) for.
es: * Trabaja con otra persona que utilice el equipo o el software para el que estás escribiendo el (los) controlador (es).

source: ### Typical driver development steps
es: ### Pasos típicos de desarrollo de un controlador

source: When writing drivers, you may wish to follow the recommended steps for app module development (planning, talking to vendors, user test, etc.). However, since drivers require intimate knowledge of hardware and/or software, you should spend more time on testing your driver. This is more so if you are writing a driver for a braille display which can send arbitrary commands (braille commands, routing buttons, etc.).
es: Cuando escribas controladores, es posible que desees seguir los pasos recomendados para el desarrollo de módulos de aplicación (planificación, comunicación con los proveedores, pruebas de usuario, etc.). Sin embargo, dado que los controladores requieren un conocimiento íntimo del hardware y/o del software, deberías dedicar más tiempo a probar tu controlador. Esto es más importante si estás escribiendo un controlador para una pantalla braille que puede enviar órdenes arbitrarias (órdenes braille, botones de enrutamiento, etc.).

source: ## Sharing your add-on and experience with others
es: ## Compartiendo tu complemento y experiencia con otros

source: Once you've finished developing your add-ons, you might want to share your code with others. Along the way, you might contribute your know-how so others may benefit from your experiences.
es: Una vez que hayas terminado de desarrollar tus complementos, es posible que desees compartir tu código con otros. A lo largo del camino, podrías aportar tu conocimiento para que otros puedan beneficiarse de tus experiencias.

source: This chapter is designed to give some guidance on add-on release and maintenance, as well as connecting with your add-on users and other NVDA core and add-on developers around the world.
es: Este capítulo está diseñado para proporcionar orientación sobre la liberación y el mantenimiento de complementos, así como para conectarte con los usuarios de complementos y otros desarrolladores del núcleo y de complementos de NVDA de todo el mundo.

source: ### The NVDA Add-ons list
es: ### La lista de complementos de NVDA

source: If you want to keep in touch with your add-on users or want to learn from or contribute your add-on to others, please subscribe to [NVDA add-ons list][4]. This is a low traffic list devoted to discussing current and future add-ons, as well as to review other add-ons created by members of the community or have your add-on reviewed by other add-on developers around the world.
es: Si deseas mantenerte en contacto con los usuarios de tu complemento o deseas aprender o contribuir con tu complemento a otros, suscríbete a[la lista de complementos de NVDA][4]. Esta es una lista de poco tráfico dedicada a discutir los complementos actuales y futuros, así como a revisar otros complementos creados por miembros de la comunidad o hacer que otros desarrolladores de complementos revisen sus complementos en todo el mundo.

source: ### The NVDA Community Add-ons web site and code repository
es: ### El sitio web y el repositorio de código de los complementos de la comunidad de NVDA

source: To download or learn more about various add-ons created by NVDA users, visit [NVDA Community Add-ons web site][5]. You can browse currently available add-ons, view add-ons under development and read add-on development guidelines.
es: Para descargar u obtener más información sobre los diversos complementos creados por los usuarios de NVDA, visita el [sitio web de los complementos de la comunidad de NVDA][5]. Puedes examinar los complementos actualmente disponibles, ver los complementos en desarrollo y leer las directrices de desarrollo de complementos.

source: For developers wishing to read the code that powers various add-ons, you can search for add-on repositories stored on GitHub. The NVDA community add-on developers use [Git][6] for version control.
es: Para los desarrolladores que deseen leer el código que impulsa a varios complementos, puedes buscar repositorios de complementos almacenados en GitHub. Los desarrolladores de complementos de la comunidad de NVDA utilizan [Git][6] para el control de versiones.

source: Some of the useful and educational add-on repositories are:
es: Algunos de los repositorios útiles y educativos son:

source: * [Add-on template](https://github.com/nvdaaddons/addonTemplate): this is the source code repository for the community add-on template.
es: * [add-on template](https://github.com/nvdaaddons/addonTemplate): este es el repositorio de código fuente para la plantilla de complementos de la comunidad.

source: * [Place markers by Noelia Martinez](https://github.com/nvdaes/placeMarkers): adds place marker functionality and provides a good example on using text infos.
es: * [Place markers de Noelia Martínez](https://github.com/nvdaes/placeMarkers): agrega funcionalidad de marcadores de posición y proporciona un buen ejemplo sobre el uso de text infos.

source: * [Windows 10 App Essentials by Joseph Lee](https://github.com/josephsl/wintenApps): provides improved support for Windows 10 and various universal apps, considered a classic in how global plugins and app modules work together and includes examples of overlay classes and control behaviors that derives from UI Automation objects.
es: * [Windows 10 App Essentials de Joseph Lee](https://github.com/josephsl/wintenApps): proporciona soporte mejorado para Windows 10 y varias aplicaciones universales, considerado un clásico en la forma en que las extensiones globales y módulos de aplicaciones trabajan juntos e incluye ejemplos de clases de superposición y comportamientos de control que se derivan de los objetos UI Automation.

source: * [Read Feeds by Noelia Martinez](https://github.com/nvdaes/readFeeds): eases discovery of feeds on various websites and includes a simple example of storing and validating add-on settings.
es: * [Read Feeds de Noelia Martínez](https://github.com/nvdaes/readFeeds): facilita el descubrimiento de feeds en varios sitios web e incluye un ejemplo sencillo de almacenar y validar configuraciones adicionales.

source: * [NVDA Remote Support by Christopher Toth and Tyler Spivey](https://github.com/nvdaremote/nvdaremote): a popular add-on used for remote troubleshooting and technical support, provides examples of how various external Python libraries are used.
es: * [NVDA Remote Support de Christopher Toth y Tyler Spivey](https://github.com/nvdaremote/nvdaremote): un popular complemento utilizado para la solución remota de problemas y soporte técnico, proporciona ejemplos de cómo se utilizan varias bibliotecas externas de Python.

source: * [StationPlaylist Studio by Joseph Lee](https://github.com/josephsl/stationPlaylist): improves usage of StationPlaylist Studio, provides interesting examples on overlay classes and app API, use of threads, and add-on dialogs and other user interfaces.
es: * [StationPlaylist Studio de Joseph Lee](https://github.com/josephsl/stationPlaylist): mejora el uso de StationPlaylist Studio, proporciona ejemplos interesantes sobre las clases de superposición y la API de aplicaciones, el uso de hilos y diálogos adicionales y otras interfaces de usuario.

source: ## Miscellaneous information
es: ## Información miscelánea

source: Please add additional material to this guide. We at NVDA Add-on Team welcome contributions from other add-on developers and users around the world.
es: Por favor, añade material adicional a esta guía. En el Equipo de Complementos de NVDA agradecemos las contribuciones de otros desarrolladores y usuarios de complementos por todo el mundo.

source: ## Appendicies
es: ## Apéndices

source: ### Appendix A: add-on terms dictionary
es: ### Apéndice A: Diccionario de términos de complemento

source: The below terms are used throughout this development guide as well as in the add-ons community to refer to add-ons, development processes and so on.
es: Los siguientes términos se utilizan a lo largo de esta guía de desarrollo, así como en la comunidad de complementos para referirse a complementos, procesos de desarrollo, etcétera.

source: * Add-on: an extension for a program. In NVDA world, an add-on refers to additional packages users can install to extend NVDA's functionality, improve support for an app, or add new speech synthesizers or braille displays.
es: * Complemento: una extensión para un programa. En el mundo de NVDA, un complemento se refiere a paquetes adicionales que los usuarios pueden instalar para ampliar la funcionalidad de NVDA, mejorar la compatibilidad con una aplicación o añadir nuevos sintetizadores de voz o pantallas braille.

source: * Application: synonymous with program.
es: * Aplicación: sinónimo de programa.

source: * App module: a module that adds or improves support for a program.
es: * Módulo de aplicación: un módulo que añade o mejora el soporte para un programa.

source: * API: Application Programming Interface.
es: * API: interfaz de programación de aplicaciones. En inglés, Application Programming Interface.

source: * Base class: parent class of an object.
es: * Clase base: clase padre de un objeto.

source: * Braille display: a hardware or software that outputs text via tactile braille output and/or allows users to enter text via a braille keyboard or other input mechanisms.
es: * Pantalla Braille: un hardware o software que emite texto a través de una salida braille táctil y/o permite a los usuarios ingresar texto a través de un teclado braille u otros mecanismos de entrada.

source: * Built-in module: a module that comes with NVDA that add-ons can optionally override or extend.
es: * Módulo integrado: un módulo que viene con NVDA y que puede ser sobreescrito o ampliado por los complementos opcionalmente.

source: * Caret: cursor shown on screen, usually seen when editing text or navigating documents.
es: * Caret: cursor que se muestra en pantalla, generalmente visto al editar texto o al navegar por documentos.

source: * Class: definition of an object.
es: * clase: definición de un objeto.

source: * Event: a routine called when certain things happen such as character input, changes to text on screen, a checkbox being checked and so on.
es: * Evento: una rutina llamada cuando suceden ciertas cosas, como la introducción de caracteres, cambios en el texto de la pantalla, una casilla de verificación marcada y así sucesivamente.

source: * Function: a piece of code that performs something given one or more input parameters and optionally returns something.
es: * Función: un pedazo de código que realiza algo con uno o más parámetros de entrada y opcionalmente devuelve algo.

source: * Gesture: a piece of input such as key presses, touchscreen flicks, braille keys and so on.
es: * Gesto: una entrada como pulsaciones de teclas, gestos en la pantalla táctil, teclas braille, etcétera.

source: * Global plugin: a module that adds features everywhere.
es: * Extensión global: un módulo que añade características en todas partes.

source: * Module: collection of variables, functions, classes and others inside a file.
es: * Módulo: conjunto de variables, funciones, clases y otros dentro de un fichero.

source: * Object: a class definition coming to life.
es: * Objeto: una definición de clase con vida propia.

source: * Script: a function that is attached (assigned) to a gesture.
es: * Script: una función que se adjunta (asigna) a un gesto.

source: * Speech synthesizer: a software or hardware that converts text and various speech commands sent to it into voice output.
es: * Sintetizador de voz: un software o hardware que convierte texto y varias órdenes de voz enviados a la salida de voz.

source: * Variable: a temporary placeholder for some data.
es: * Variable: un marcador de posición temporal para algunos datos.

source: ### Appendix B: Programming and Python concepts every add-on developer needs to know
es: ### Apéndice B: Programación y conceptos de Python que todo desarrollador de complementos necesita saber

source: The below list summarizes concepts all add-on developers will need to know when writing add-ons.
es: La siguiente lista resume los conceptos que todos los desarrolladores de complementos necesitarán conocer cuando escriban complementos.

source: * API: a set of documentation and code samples used to let a program or hardware interface with other software or hardware.
es: * API: un conjunto de documentación y muestras de código utilizado para permitir que un programa o hardware interactúe con otro software o hardware.
