Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/NVDA_Add-on_Development_Guide.po
Languages: es

source: # NVDA Add-on Development Guide
es: # Guía de Desarrollo de Complementos de NVDA

source: Latest version: April 2019 for NVDA 2019.1
es: Última versión: abril de 2019 para NVDA 2019.1

source: ## Authors, Contributions, and Copyright
es: ## Autores, Colaboraciones y Copyright

source: This guide was originally written by Joseph Lee, and is shaped by the NVDA user and developer community. We welcome your feedback and contributions.
es: Esta guía fue escrita originalmente por Joseph Lee, y está diseñada por la comunidad de usuarios y de desarrolladores de NVDA. Agradecemos vuestros comentarios y contribuciones.

source: NVDA is copyright 2006-2019 NV Access Limited. Microsoft Windows, Microsoft Office, Win32 API, and other Microsoft products are copyright Microsoft Corporation. the IAccessible package is copyright by IBM and the Linux Foundation. Python is copyright by Python Software Foundation. Other products mentioned are copyrighted by their respective copyright holders.
es: NVDA es copyright 2006-2019 NV Access Limited. Microsoft Windows, Microsoft Office, Win32 API y otros productos de Microsoft son propiedad de Microsoft Corporation. el paquete IAccessible es propiedad intelectual de IBM y la Fundación Linux. Python es propiedad intelectual de la Python Software Foundation. Otros productos mencionados son propiedad intelectual de sus respectivos propietarios.

source: ## Introduction
es: ## Introducción

source: Welcome to the NVDA Add-on Development Guide. This is the one-stop guide on how to develop NVDA add-ons. This guide also explains some useful code segments from the NVDA core source code, which highlight concepts for you, as you learn to write add-ons.
es: Bienvenido a la Guía de desarrollo de complementos para NVDA. Esta es la guía completa sobre cómo desarrollar complementos de NVDA. Esta guía también explica algún segmento de código útil del código fuente del núcleo de NVDA, que resalta conceptos para ti mientras aprendes a escribir complementos.

source: For more information on NVDA development, please visit the [NVDA Community Development page][1]. Be sure to go over the [NVDA Developer Guide][2] to familiarize yourself with key terms and basics on getting started with add-on development.
es: Para obtener más información sobre el desarrollo de NVDA, por favor visita [la Página de la Comunidad de Desarrollo de NVDA][1]. Asegúrate de revisar la [Guía del desarrollador de NVDA][2] para familiarizarte con los términos clave y los conceptos básicos para comenzar con el desarrollo de complementos.

source: ## Audience
es: ## Audiencia

source: This guide is designed for:
es: Esta guía se ha diseñado para:

source: * Python beginners
es: * aprendices de Python

source: * beginners to NVDA development
es: * principiantes en el desarrollo de NVDA

source: * Expert Python developers
es: * desarrolladores Expertos de Python

source: * Expert NVDA developers
es: * desarrolladores Expertos de NVDA

source: * People familiar with programming languages other than Python.
es: * Gente familiarizada con otros lenguajes de programación distintos a Python.

source: * Developers of scripts for other screen readers.
es: * Desarrolladores de scripts para otros lectores de pantalla.

source: If you are new to NVDA add-on or core development, we recommend that you get to know Python first, as it gives the necessary programming background for understanding the rest of the guide. If you are a Python programmer but new to NVDA development, please checkout the NVDA development guide and Design Overview document, both of which can be found on the [NVDA Community Development page][1].
es: Si eres nuevo en el desarrollo de complementos o del núcleo de NVDA, te recomendamos que conozcas Python primero, ya que proporciona los conocimientos de programación necesarios para entender el resto de la guía. Si eres programador de Python pero eres nuevo en el desarrollo de NVDA, por favor, consulta la guía de desarrollo de NVDA y el documento Vista General de Diseño, los cuales se encuentran en [la página de la comunidad de desarrolladores de NVDA][1].

source: ### Special note on Python version
es: ### Nota especial sobre la versión de Python

source: NVDA and add-ons are written in Python 2, specifically 2.7. There is an active research project to port NVDA to python 3, with some add-on developers modifying their add-on source code to run on Python 2 and 3. Be sure to keep an eye on NVDA development and add-ons mailing lists, as well as relevant development documentation and notices regarding news on Python 3 and NVDA.
es: NVDA y los complementos están escritos en Python 2, específicamente 2.7. Existe un proyecto de investigación activo para transferir NVDA a python 3, con algunos desarrolladores de complementos modificando su código fuente para que se ejecute en Python 2 y 3. Asegúrate de estar atento al desarrollo de NVDA y a las listas de correo de complementos, así como a la documentación de desarrollo relevante y a los avisos relacionados con las noticias sobre Python 3 y NVDA.

source: ### A special note for scripters of other screen readers
es: ### Una nota especial para creadores de scripts de otros lectores de pantalla

source: Some of the concepts described in this document are same across different screen readers, such as objects, windows, events, accessibility API and so on. However, there are important things to be aware of when writing or porting scripts:
es: Algunos de los conceptos descritos en este documento son los mismos para diferentes lectores de pantalla, tales como objetos, ventanas, eventos, APIs de accesibilidad y así sucesivamente. Sin embargo, hay cosas importantes que hay que tener en cuenta al escribir o portar scripts:

source: * Unlike some screen readers, NVDA does not have a formal specification or an object model as defined by documentation in other screen readers.
es: * A diferencia de algunos lectores de pantalla, NVDA no tiene una especificación formal o un modelo de objeto definido por la documentación en otros lectores de pantalla.

source: * The code you write will run inside the same runtime environment as the screen reader itself, thus you can perform things such as obtain focused object directly, modify NVDA's functionality and even replace NVDA functions and classes with your own.
es: * El código que escribas se ejecutará dentro del mismo entorno de ejecución que el propio lector de pantalla, por lo que puedes realizar cosas como obtener directamente objetos enfocados, modificar la funcionalidad de NVDA e incluso reemplazar las funciones y clases de NVDA con las tuyas propias.

source: * Python, and consequently, NVDA is an object-oriented system. In other words, most of your code will consist of defining classes and objects which are than picked up by NVDA at runtime.
es: * Python, y consecuentemente NVDA, es un sistema orientado a objetos. En otras palabras, la mayor parte de su código consistirá en definir clases y objetos que NVDA recogerá en tiempo de ejecución.

source: * Unlike scripting engines for some screen readers, there is no special hack involved when you wish to provide a feature that'll work in all applications.
es: * A diferencia de los motores de scripting para algunos lectores de pantalla, no hay ningún hack especial involucrado cuando se desee proporcionar una característica que funcione en todas las aplicaciones.

source: * Unlike scripting engines for some screen readers, you are not limited to libraries that come with screen readers; as a Python-based program, you can use any python module(s) that fits your needs. For example, a popular module used to interface with web applications is JSON (JavaScript Object Notation) module, which isn't bundled with older NVDA versions prior to 2017.3. You need to bundle external Python libraries yourself.
es: * A diferencia de los motores de scripting para algunos lectores de pantalla, no estás limitado a bibliotecas que vengan con los lectores de pantalla; como un programa basado en Python, puedes usar cualquier módulo (s) de python que se adapte a tus necesidades. Por ejemplo, un módulo popular utilizado para interactuar con aplicaciones web es el módulo JSON (JavaScript Object Notation), que no está incluido en las versiones de NVDA anteriores a 2017.3. Necesitas incorporar las bibliotecas externas de Python tú mismo.

source: ### A special note about Windows Store version of NvDA
es: ### Nota especial sobre la versión de NVDA para la tienda de Windows

source: As of NVDA 2018.1, foundation has been laid to let NVDA run as a Windows Store application. Once the Windows Store version of NVDA is published to Microsoft Store, users running Windows 10 can go to Store and obtain NVDA. However, there are restrictions that comes with this version of NVDA, notably add-ons cannot run in this environment. Thus, if you need to run or write NVDA add-ons, you need to use the classic desktop version of NVDA, available from nvaccess.org website.
es: A partir de NVDA 2018.1, se han establecido cambios para permitir a NVDA ejecutarse como una aplicación de la tienda Windows. Una vez se publique en la tienda la versión de NVDA para la tienda de Windows, los usuarios de Windows 10 podrán ir a la tienda y obtener NVDA. Sin embargo, hay restricciones que vienen con esta versión de NVDA, la más notable es que los complementos no pueden ejecutarse en este entorno. Por lo tanto, si necesitas ejecutar o escribir complementos de NVDA, deberás utilizar la versión clásica de escritorio de este lector, disponible en la sección de descargas de nuestro sitio web.

source: ### A very important note about migrating custom extension code to development scratchpad
es: ### Nota muy importante sobre la migración de código personalizado de extensión a development scratchpad

source: If you are coming from NVDA 2018.4 or earlier, you may recall that you are able to run extension modules inside folders stored in user configuration directory (e.g. appModules). This functionality has been revised in NVDA 2019.1 as follows:
es: Si vienes de NVDA 2018.4 o versiones anteriores, recordarás que se podían ejecutar módulos de extensión desde el interior de carpetas situadas en el directorio de configuración de usuario (por ejemplo, appModules). Esta funcionalidad se ha rediseñado en NVDA 2019.1 de la siguiente manera:

source: 1. NVDA will no longer load extension code stored in the following subdirectories of user configuration folder: appModules, brailleDisplayDrivers, globalPlugins, synthDrivers.
es: 1. NVDA ya no cargará código de extensiones alojado en los siguientes subdirectorios de la carpeta de configuración de usuario: appModules, brailleDisplayDrivers, globalPlugins y synthDrivers.

source: * If you find that code inside these folders are no longer working as of NVDA 2019.1, the above reason is why.
es: * Si descubres que el código de estas carpetas no está funcionando desde que tienes NVDA 2019.1, la razón anterior explica por qué.

source: 2. You must enable development scratchpad functionality (reserved for developers) if you wish to load custom extension code. To do so:
es: 2. Debes activar la funcionalidad development scratchpad (reservada para desarrolladores) si quieres habilitar la carga de código de extensión personalizado. Para hacerlo:

source: 1. With NVDA 2019.1 running, go to NVDA menu/Preferences/settings/Advanced.
es: 1. Teniendo NVDA 2019.1 en ejecución, ve al menú NVDA / Preferencias / Opciones / Avanzado.

source: 2. You must check "I understand that changing these settings may cause NVDA to function incorrectly" checkbox.
es: 2. Debes marcar la casilla "Comprendo que cambiar estas opciones puede hacer que NVDA funcione incorrectamente".

source: 3. You must check "Enable loading custom code from Developer Scratchpad directory".
es: 3. Debes marcar la casilla "Habilitar la carga de código personalizado desde el directorio Developer Scratchpad".

source: 4. Select OK.
es: 4. Pulsa Aceptar.

source: 3. You must store code that were formerly housed in the above list of subdirectories inside corresponding subdirectories of scratchpad folder.
es: 3. Debes almacenar el código que estaba previamente alojado en la lista anterior de subcarpetas dentro de los directorios correspondientes de la carpeta scratchpad.

source: 4. If you need to use NVDA 2018.4 and would like to use custom code, you must not remove subdirectories from user configuration directory, otherwise go ahead and remove the folders listed in item 1.
es: 4. Si necesitas usar NVDA 2018.4 y quisieras utilizar código personalizado, no elimines las subcarpetas del directorio de configuración de usuario. En cualquier otro caso, elimina las carpetas que se mencionan en el elemento 1 de esta lista.

source: ## What are Add-ons?
es: ## ¿Qué son los Complementos?

source: Add-ons are additional packages that extend NVDA's functionality or support for programs. This may include adding global features, enhancing support for an application, or adding support for newer braille displays or speech synthesizers. Add-ons may contain more than one module. The following is a general description of add-on module types.
es: Los complementos son paquetes adicionales que amplían la funcionalidad de NVDA o el soporte para programas. Esto puede incluir la adición de características globales, la mejora de la compatibilidad con una aplicación o la adición de soporte para nuevas pantallas braille o sintetizadores de voz. Los complementos pueden contener más de un módulo. A continuación se incluye una descripción general de los tipos de módulos adicionales.

source: ### Add-on Module Types
es: ### Tipos de módulos de Complementos

source: Currently, NVDA supports these add-on module types:
es: Actualmente, NVDA soporta estos tipos de módulos adicionales:

source: * Global plugin: A global plugin adds features for NVDA which can be used anywhere, such as OCR capability.
es: * Extensión global: una extensión global añade características para NVDA que se pueden utilizar en cualquier lugar, como la función de OCR.

source: * App module: An app module allows enhanced support for a specific program. App modules only run as long as the program runs. They change how NVDA reacts to the windows and controls in the running application.
es: * Módulo de aplicación: Un módulo de aplicación permite un soporte mejorado para un programa específico. Los módulos de aplicación sólo se ejecutan mientras el programa se ejecute. Cambian la forma en que NVDA reacciona a las ventanas y controles de la aplicación en ejecución.

source: * Driver: A driver allows a program to talk to hardware. Currently you can write drivers for new braille displays or speech synthesizers.
es: * Controlador: Un controlador permite a un programa comunicarse con el hardware. Actualmente puedes escribir controladores para nuevas pantallas braille o sintetizadores de voz.

source: ### Installing NVDA Add-ons
es: ### Instalación de Complementos de NVDA

source: Each NVDA add-on package is a zip file with the file extension of .nvda-addon. You can install add-on modules via the Add-ons Manager in NVDA 2012.2 or later. Alternatively, you can install them from File Manager if you use NVDA 2012.3 or later.
es: Cada paquete de complementos de NVDA es un archivo zip con la extensión de archivo .nvda-addon. Puedes instalar módulos adicionales a través del Administrador de complementos en NVDA 2012.2 o posterior. Alternativamente, puedes instalarlos desde el Explorador de Archivos si utilizas NVDA 2012.3 o posterior.

source: ## Setting up the add-on development environment
es: ## Configuración del entorno de desarrollo de complementos

source: Follow these steps to prepare your computer for writing NVDA add-ons.
es: Sigue estos pasos para preparar tu ordenador para escribir complementos de NVDA.

source: ### Meet System requirements
es: ### Cumplir con los requisitos del Sistema

source: To create an add-on for NVDA, please make sure your system meets the following requirements:
es: Para crear un complemento para NVDA, asegúrate de que tu sistema cumple los siguientes requisitos:

source: * A version of NVDA is available on your computer (either a portable or installed version will work, but we strongly recommend that you install a copy of NVDA on your development computer). Download NVDA from the NV Access page at https://www.nvaccess.org.
es: * Una versión de NVDA está disponible en tu ordenador (funcionará ya sea una versión portable o instalada, pero te recomendamos encarecidamente que instales una copia de NVDA en tu ordenador de desarrollo). Descarga NVDA desde la página de NV Access en https://www.nvaccess.org.

source: * We recommend installing the latest master development version to keep up to date with core API changes. You can download the latest snapshots at https://community.nvda-project.org/wiki/Snapshots.
es: * Recomendamos instalar la última versión master de desarrollo para mantenerse al día con los cambios en el API del núcleo. Puedes descargar las últimas snapshots en https://community.nvda-project.org/wiki/Snapshots.

source: * Python 2.7 series, version 2.7.14 32-bit for Windows: <https://www.python.org/download/releases/2.7.14/>.
es: * Series de Python 2.7, versión 2.7.14 32-bit para Windows: <https://www.python.org/download/releases/2.7.14/>.

source: * SCons 2 or 3, version 2.3.0 or later for generating add-on packages (if using a 3.x release, use 3.0.1 or later): <http://www.scons.org/>.
es: * SCons 2 o 3, versión 2.3.0 o posterior para la generación de paquetes de complementos (si se usa la versión 3.x, se recomienda la 3.0.1 o posterior): <http://www.scons.org/>.

source: * Markdown 2.0.1 or later for generating add-on documentation: <https://pypi.python.org/pypi/Markdown/2.0.1>.
es: * Markdown 2.0.1 o posterior para generar la documentación del complemento: <https://pypi.python.org/pypi/Markdown/2.0.1>.

source: * The GNU Gettext package for Windows for message localization support. The build can be found at: <http://gnuwin32.sourceforge.net/downlinks/gettext.php>.
es: * El paquete Gettext de GNU para Windows para soporte de localización de mensajes. La compilación se puede encontrar en: <http://gnuwin32.sourceforge.net/downlinks/gettext.php>.

source: * Once downloaded, copy both exe files to your add-on development folder. See the next section for a description of the add-on folder structure.
es: * Una vez descargados, copia ambos archivos exe en la carpeta de desarrollo del complemento. Consulta la siguiente sección para obtener una descripción de la estructura de carpetas del complemento.

source: * Git 1.7.9 or later if you wish to upload the add-on to a repository such as Bitbucket (optional. See below). You can use various Git clients, such as Git Bash, Cygwin's Git, and Tortoise Git.
es: * Git 1.7.9 o posterior si deseas subir el complemento a un repositorio como Bitbucket (opcional). Puedes utilizar varios clientes de Git, como Git Bash, Git de Cygwin, y Tortoise Git.

source: * The NVDA Community Add-on Template for ease of add-on file and folder packaging and management (optional. [Download the add-on template)][3] .
es: * La plantilla de complemento de NVDA de la comunidad para facilitar el empaquetado y la gestión de carpetas y archivos del complemento (opcional) [Descarga la plantilla del complemento)][3].

source: * If you are developing support for a program, speech synthesizer, or braille display, install the needed software and hardware.
es: * Si estás desarrollando soporte para un programa, sintetizador de voz o pantalla braille, instala el software y el hardware necesario.

source: Note: if using Windows 10 Anniversary Update or later and wish to use Ubuntu on Windows (aka Windows Subsystem for Linux), you can use Advanced Packaging Tool (APT) to obtain SCons and Gettext. You can then use pip to download and install Markdown.
es: Nota: si utilizas Windows 10 Anniversary Update o posterior y deseas usar Ubuntu en Windows (también conocido como Windows Subsystem for Linux), puedes utilizar Advanced Packaging Tool (APT) para obtener SCons y Gettext. A continuación, puedes utilizar pip para descargar e instalar Markdown.

source: ### Add-on Development Folder Structure
es: ### Estructura de Carpetas de Desarrollo del Complemento

source: When writing add-ons, it is recommended that you store your add-on code in separate folders, one per add-on. If you chose to download the add-on template, the folder structure will be automatically created.
es: Cuando escribas complementos, se recomienda que guardes el código del complemento en carpetas separadas, una por complemento. Si decides descargar la plantilla del complemento, la estructura de carpetas se creará automáticamente.

source: Once you install the needed dependencies (see above), paste the Gettext package executables into this add-on folder.
es: Una vez que instales las dependencias necesarias (mira arriba), pega los ejecutables del paquete Gettext en la carpeta del complemento.

source: ### Add-on folder structure
es: ### Estructura de carpetas del complemento

source: Each add-on folder, at a minimum, must contain the following files and folders:
es: Cada carpeta de complementos, como mínimo, debe contener los siguientes archivos y carpetas:

source: * manifest.ini to store manifest information such as add-on name, author, and compatibility range (minimum version, last tested version).
es: * manifest.ini para almacenar la información de manifiesto del complemento tal como el nombre, el autor y el rango de compatibilidad (versión mínima, última versión probada).

source: * An "addon" subfolder with the add-on module directory underneath this subfolder (appModules, globalPlugins, synthDrivers, brailleDisplays). One or more module folders can be specified.
es: * Una subcarpeta "addon" con el directorio de módulos del complemento bajo esta subcarpeta (appModules, globalPlugins, synthDrivers, brailleDisplays). Se pueden especificar una o más carpetas de módulos.

source: If you are using the add-on template, the folder structure will automatically be created, so you need to create only the addon subfolder and the add-on module folder(s) and code inside this folder. See the readme file in the template folder for more information on customizing your add-on manifest using the template files.
es: Si estás utilizando la plantilla de complementos, la estructura de carpetas se creará automáticamente, por lo que sólo necesitas crear la subcarpeta addon y las carpetas de módulos adicionales y el código dentro de estas carpetas. Consulta el archivo readme en la carpeta de la plantilla para obtener más información sobre cómo personalizar tu manifiesto de complemento mediante los archivos de la plantilla.

source: ### Packaging add-ons
es: ### Enpaquetado de complementos

source: There are two ways of packaging add-ons:
es: Hay dos modos de empaquetar complementos:

source: 1. To package your add-on manually, zip up (compress) your add-on folder as a .zip file, then rename the file extension to .nvda-addon.
es: 1. Para empaquetar el complemento manualmente, comprime (en zip) la carpeta del complemento como un archivo .zip, y luego cambia el nombre de la extensión del archivo a .nvda-addon.

source: 2. To use the add-on template with SCons, open Command Prompt with administrator mode (Windows Vista or later) or Bash on Ubuntu on Windows (Windows 10 Anniversary Update with WSL enabled), change to your add-on folder and type `scons~.
es: 2. Para utilizar la plantilla de complemento con SCons, abre el símbolo del sistema en el modo Administrador (Windows Vista o posterior) o Bash en Ubuntu en Windows (Windows 10 Anniversary Update con el WSL habilitado), cambie a la carpeta de complemento y escribe `scons~.
