Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/NVDA_Add-on_Development_Guide.po
Languages: es

source: * Base class: a class that provides base methods, attributes and properties for other objects to inherit and extend. Synonymous with superclass and parent class.
es: * Clase base: una clase que proporciona métodos base, atributos y propiedades para que otros objetos hereden y amplíen. Sinónimo de superclase y clase padre.

source: * Child class: a class that derives its power from one or more base classes.
es: * Clase hija: una clase que deriva su poder de una o más clases básicas.

source: * Class: definition of objects, including methods, attributes and expected behaviors. All Python classes and attributes are public; they can "ecome private" through use of naming conventions such as prefixing a variable name with underscores (_).
es: * Clase: definición de objetos, incluyendo métodos, atributos y comportamientos esperados. Todas las clases y atributos de Python son públicos; pueden "llegar a ser privados" mediante el uso de convenciones de nomenclatura como prefijar un nombre de variable con subrayados (_).

source: * Code block: collection of code.
es: * Bloque de código: colección de código.

source: * Compiling: translating a high-level programming language into a low-level language suitable for machine execution.
es: * Compilación: traducción de un lenguaje de programación de alto nivel a un lenguaje de programación de bajo nivel apto para la ejecución en máquina.

source: * Event-driven programming: a programming paradigm based on following, reacting to and handling events.
es: * Programación dirigida por eventos: un paradigma de programación basado en el seguimiento, la reacción y el manejo de eventos.

source: * Exception: one or more runtime circumstances that prevents normal operation of a program such as being denied access to a resource, name usage problem in code and other cases.
es: * Excepción: una o más circunstancias en tiempo de ejecución que impiden el funcionamiento normal de un programa, como negarle el acceso a un recurso, problemas de uso del nombre en el código y otros casos.

source: * GUI: Graphical User Interface.
es: * GUI: Interfaz gráfica de usuario.

source: * Handle: an opaque reference to a resource such as a file, TCP socket, window and so on.
es: * Manejador: una referencia opaca a un recurso tal como un archivo, socket TCP, ventana, etcétera.

source: * Has versus is relationship: former refering to attributes of a single class, the latter refering to inherited classes.
es: * Relación tiene vs. es: el primero se refiere a atributos de una sola clase, y el segundo a clases heredadas.

source: * Indentation-based syntax: use of indentations such as tabs to denote code blocks.
es: * Sintaxis basada en la indentación: uso de indentaciones tales como tabulaciones para denotar bloques de código.

source: * Inheritance: ability for one or more parent classes to provide base methods and attributes for child classes to override or extend as the need arises.
es: * Herencia: habilidad para que una o más clases padres provean métodos y atributos básicos para que las clases hijas sobreescriban o amplíen según surja la necesidad.

source: * Interpreting: running a program written in a high-level language without compiling it first.
es: * Interpretar: ejecutar un programa escrito en un lenguaje de alto nivel sin compilarlo primero.

source: * Object: runtime instance of one or more classes.
es: * Objeto: instancia de ejecución de una o más clases.

source: * Object hierarchy: how screen elements are organized via parent-child (container-contained) relationship.
es: * Jerarquía de objetos: cómo se organizan los elementos de pantalla mediante la relación padre-hijo (contenedor - contenido).

source: * Object-oriented programming: a programming paradigm that defines solutions to problems or represent real-life things via classes and objects.
es: * Programación orientada a objetos: un paradigma de programación que define soluciones a problemas o representa cosas reales a través de clases y objetos.

source: * Scope: where variables, functions, classes and objects are defined in code.
es: * Alcance: dónde las variables, funciones, clases y objetos se definen en código.

source: ### Appendix C: Add-on type comparison
es: ### Apéndice C: Comparación de tipos de complementos

source: The following table compares various add-on types and when to use them.
es: La siguiente tabla compara varios tipos de complementos y cuándo utilizarlos.

source: | Task or feature | Global plugin | App module | Driver |
es: | Tarea o característica | Extensión global | Módulo de aplicación | Controlador |

source: | Can be used everywhere | Yes | No | Yes |
es: | Puede usarse en todas partes | Sí | No | Sí |

source: | Naming restrictions | No (limited by Windows file naming conventions) | Must be name of the executable | No (limited by Windows file naming conventions) |
es: | Restricciones de nombrado | No (limitado por las convenciones de nombrado de ficheros de Windows) | Debe llamarse como el ejecutable | No (limitado por las convenciones de nombrado de ficheros de Windows) |

source: | Retrieve various controls, including focused control | Yes | Yes | No |
es: | Recupera varios controles, incluyendo el control enfocado | Sí | Sí | No |

source: | Commands can be used everywhere | Yes | No | Braille display drivers only if defined |
es: | Las órdenes pueden utilizarse en cualquier lugar | Sí | No | Sólo los controladores de pantalla braille si se definió |

source: | Handle events such as focus changes | Yes | Yes | No |
es: | Manejar eventos tales como cambios del foco | Sí | Sí | No |

source: | Define custom objects to represent controls | Yes | Yes | No |
es: | Definir objetos personalizados para representar controles | Sí | Sí | No |

source: | Define custom actions to be performed when the module loads and unloads | Yes | Yes | Yes |
es: | Definir acciones personalizadas al realizarse cuando el módulo se cargue y se descargue | Sí | Sí | Sí |

source: | Perform actions when profile switching occurs and other actions | Yes | Yes | Yes |
es: | Definir acciones personalizadas a realizarse cuando ocurran cambios de perfil y otros eventos | Sí | Sí | Sí |

source: | Can modify object attributes at runtime | No | Yes | No |
es: | Puede modificar atributos de objeto en tiempo de ejecución | No | Sí | No |

source: | Modify speech and other output routines and presentation experience (i.e. speech.cancelSpeech, braille.handler.update, etc.) | Yes | yes | No |
es: | Modifica rutinas de salida de voz y otras y la experiencia de presentación (Por ejemplo speech.cancelSpeech, braille.handler.update, etc.) | Sí | Sí | No |

source: | Include custom settings | Yes | Yes | Speech synthesizers only |
es: | Incluir opciones personalizadas | Sí | Sí | Sólo sintetizadores de voz |

source: | Can patch NVDA functions, classes and modules at will | Yes | Not advised | No |
es: | Puede parchear funciones de NVDA, classes y módulos a voluntad | Sí | No se aconseja | No |

source: | Subject to configuration profile switches | No | Yes | Yes |
es: | Sujeto a cambios de perfil de configuración | No | Sí | Sí |

source: | Can call external libraries written in C and other languages and bundled as DLL's | Yes | Yes | Yes |
es: | Puede llamar a bibliotecas externas escritas en C y otros lenguajes y empaquetadas como DLLs | Sí | Sí | Sí |

source: ### Appendix D: notes and references for scripters of other screen readers
es: ### Apéndice D: notas y referencias para creadores de scripts de otros lectores de pantalla

source: If you write scripts for screen readers such as JAWS for Windows or Window-Eyes, be sure to go over this section as it introduces you to common tasks you can do with NVDA and other notes.
es: Si escribes scripts para lectores de pantalla como JAWS para Windows o Window-Eyes, asegúrate de repasar esta sección ya que te presenta las tareas comunes que puedes realizar con NVDA y otras notas.

source: | Task | NVDA or Python function/class/module | Notes |
es: | Tarea | función /clase/módulo de NVDA o de Python | Notas |

source: | Cancel speech | speech.cancelSpeech() | Stops speech. |
es: | Cancelar voz | speech.cancelSpeech() | Detiene la voz. |

source: | Speak something | speech.speakMessage(message) or as part of ui.message(message) | the ui.message function also performs braille output. |
es: | Verbalizar algo | speech.speakMessage(mensaje) o como parte de ui.message(mensaje) | la función ui.message también realiza la salida braille. |

source: | Braille something | braille.handler.message(message) or ui.message(message) | Same as above. |
es: | Braillificar algo | braille.handler.message(mensaje) o ui.message(mensaje) | Igual que arriba. |

source: | Show an HTML window | ui.browseableMessage(message, title, isHTML = True) | Mimics virtual viewer except it'll be shown on screen. |
es: | Mostrar una ventana HTML | ui.browseableMessage(mensaje, título, isHTML = True) | Imita el visor virtual excepto a la hora de mostrarse en pantalla. |

source: | Retrieve focused object | something = api.getFocusObject() | |
es: | Recuperar objeto con el foco | algo = api.getFocusObject() | |

source: | Retrieve foreground window | foreground = api.getForegroundObject() | |
es: | Recuperar ventana en primer plano | primerplano = api.getForegroundObject() | |

source: | Title of the active window (if present) | foreground.name | |
es: | Título de la ventana activa (si está presente) | foreground.name | |

source: | Find out what object is navigator object | obj = api.getNavigatorObject() | This may or may not be the focused control. |
es: | Averiguar qué objeto es el navegador de objetos | obj = api.getNavigatorObject() | Este podrá ser o no ser el control enfocado. |

source: | Retrieve window handle for a given object | hwnd = obj.windowHandle | Obtain object via api.get*Object() functions. |
es: | Recuperar el manejador de ventana para un objeto dado | hwnd = obj.windowHandle | Obtiene el objeto a través de las funciones api.get*Object(). |

source: | Check the name of the window class | obj.windowClassName == somename | |
es: | Comprobar el nombre de la clase de ventana | obj.windowClassName == algo | |

source: | Making sure the parent object has the correct window control ID | if obj.parent.windowControlID == something: statement | |
es: | Asegurarse de que el objeto padre tiene el ID de control de ventana correcto | if obj.parent.windowControlID == algo: instrucciones | |

source: | The parent object does not provide what I want, but the grandparent does | something = obj.parent.parent.attribute | |
es: | El objeto padre no proporciona lo que yo quiero, pero el abuelo lo hace | algo = obj.parent.parent.atributo | |

source: | The label of a list item is the name of its first child object | obj.name = obj.firstChild.name | |
es: | La etiqueta de un elemento de lista es el nombre de su primer objeto hijo. | obj.name = obj.firstChild.name | |

source: | I want the control label of the focused object and description of the previous object to be announced when I press NVDA+Tab | In reportFocus(self): obj.name += " " + obj.previous.description | |
es: | Deseo que la etiqueta de control del objeto enfocado y la descripción del objeto anterior se anuncien cuando pulso NVDA+Tab | En reportFocus(self): obj.name += " " + obj.previous.description | |

source: | Announce state changes if and only if the next object is the toolbar I'm looking for | In event_stateChange(self): toolbar = obj.next; if toolbar.role == controlTypes.ROLE_TOOLBAR and toolbar.attribute = whatYouAreLookingFor and additional conditions ...: statement | For better readability, place each statement on separate lines with correct indents applied. |
es: | Anunciar si el estado cambia si y sólo si el siguiente objeto es la barra de herramientas que estoy buscando. | In event_stateChange(self): toolbar = obj.next; if toolbar.role == controlTypes.ROLE_TOOLBAR and toolbar.attribute = loqueestoybuscando y condiciones adicionales ...: instrucciones | Para una mejor legibilidad, coloca cada declaración en líneas separadas con indentaciones correctas. |

source: | Announcing the name of an object on screen (provided that object navigation can be used) | obj = api.getForegroundObject().route...; ui.message(obj.name) | Try placing each statement on its own line with correct indents applied. Route refers to obj.next/previous/parent/firstChild/lastChild/children[index]/getChild(index) and so on. |
es: | Anunciar el nombre de un objeto en pantalla (siempre que se pueda utilizar la navegación por objeto) | obj = api.getForegroundObject().ruta...; ui.message(obj.name) | Trata de colocar cada sentencia en su propia línea con las indentaciones correctas aplicadas. La ruta se refiere a obj.next/previous/parent/firstChild/lastChild/children[index]/getChild(index) y así sucesivamente. |

source: | Check if the object's role is what you want | obj.role == controlTypes.ROLE_* | ROLE_* can be any role you are looking for. |
es: | Comprueba si el rol del objeto es el que deseas | obj.role == controlTypes.ROLE_* | ROLE_* puede ser cualquier rol que estés buscando. |

source: | Looking for a specific text in the object's name | sometext in obj.name | This is a typical string membership task. |
es: | Búsqueda de un texto específico en el nombre del objeto | textobuscado in obj.name | Esta es una tarea típica de los miembros de una cadena de texto. |

source: | Does the control's label start with a specific text | obj.name.startswith(sometext) | |
es: | ¿Empieza la etiqueta del control con un texto específico? | obj.name.startswith(textobuscado) | |

source: | Length of a text field with easily retrievable value | len(obj.value) | This works if the value of the field can be found. |
es: | Longitud de un campo de texto con valor fácilmente recuperable | len(obj.value) | Esto funciona si se puede encontrar el valor del campo. |

source: | Is a checkbox checked | controlTypes.STATE_CHECKED in obj.states | obj.states is a set. First, verify that the role is a checkbox. |
es: | Es una casilla marcada | controlTypes.STATE_CHECKED in obj.states | obj.states es un conjunto. En primer lugar, verifica que el rol es de una casilla de verificación. |

source: | How many items are in a list | someList.childCount | Provided that the list provides correct underlying implementation to obtain item count. |
es: | Cuántos elementos hay en una lista | algunaLista.childCount | Siempre que la lista proporcione una correcta implementación subyacente para obtener el recuento de elementos. |

source: | Where the object is located on screen | obj.location | This returns a tuple of four elements, namely x and y coordinates of the top-left corner of the object, as well as length and width. For example, on the Shelel (desktop) object with screne resolution of 1920 by 1080 pixels, the return value will be (0, 0, 1920, 1080. |
es: | Dónde se encuentra el objeto en la pantalla | obj.location | Esto devuelve una tupla de cuatro elementos, es decir, coordenadas x e y de la esquina superior izquierda del objeto, así como longitud y anchura. Por ejemplo, en el objeto Shell (escritorio) con una resolución de pantalla de 1920 por 1080 píxeles, el valor de retorno será (0,0,1920,1080). |

source: | Is this an MSAA control | isinstance(obj, NVDAObjects.IAccessible.IAccessible) | A typical implementation is to import IAccessible from NVDAObjects.IAccessible and doing isinstance(obj, IAccessible). |
es: | ¿Es este un control MSAA? | isinstance(obj, NVDAObjects.IAccessible.IAccessible) | Una implementación típica es importar IAccessible desde NVDAObjects.IAccessible y hacer isinstance(obj, IAccessible). |

source: | Position of a MSAA list item | item.IAccessibleChildID | Provided that this is properly implemented. The default for controls other than list items, treeview items and what not is 0. |
es: | Posición de un elemento de lista MSAA | item.IAccessibleChildID | Siempre y cuando esto se implemente correctamente. El valor predeterminado para los controles que no sean elementos de lista o elementos de vista de árbol es 0. |

source: | I need to work with IAccessible object methods directly | obj.IAccessibleObject.method | First, find out how to use the given MSAA method for a control, then retrieve the IAccessible object itself and call the needed method. |
es: | Necesito trabajar con métodos de un objeto IAccessible directamente | obj.IAccessibleObject.method | primero, descubre cómo usar el método MSAA dado para un control, y después recupera el propio objeto IAccessible y llama al método. |

source: | Give me the UIA element that powers a certain UIA control | obj.UIAElement | Useful if you wish to perform UIA client operations on this element. |
es: | Dame el elemento UIA que proporciona un control UIA | obj.UIAElement | útil si quieres realizar operaciones de cliente UIA en este elemento. |

source: | Automation ID for a UIA element | obj.UIAElement.cachedAutomationID | First, check if the object is a UIA control . |
es: | ID de automatización para un elemento UIA | obj.UIAElement.cachedAutomationID | Primero, comprueba si el objeto es un control UIA. |

source: | Framework used to generate this UIA object | obj.UIAElement.cachedFrameworkID | The GUI framework used to program this object. Commonly encountered frameworks are Direct UI, Windows Presentation Foundation (WPF) controls with UIA enabled, XAML (eXtensible Application Programming Language) and Microsoft Edge. |
es: | Framework utilizado para generar este objeto UIA | obj.UIAElement.cachedFrameworkID | El framework GUI utilizado para programar este objeto. Los frameworks más comunes son Direct UI, Windows Presentation Foundation (WPF) con UIA habilitado, XAML (lenguaje extensible de programación de aplicaciones) y Microsoft Edge. |

source: | I want to ask UIA about values of a specific property | obj._getUIACacheablePropertyValue(propertyID) | Provided that the object is a UIA control, pass in the property ID you wish to know as an argument to this function. If the property is supported, a valid value will be returned, otherwise a COM error exception will be thrown. |
es: | Quiero pedirle a UIA los valores de una propiedad específica | obj._getUIACacheablePropertyValue(propertyID) | asumiendo que el objeto es un control UIA, pásale el identificador de la propiedad que quieres conocer como argumento de esta función. Si la propiedad está soportada, se devolverá un valor válido. Si no, se lanzará un error COM. |

source: | Executable name of any object | obj.appModule.appName | appModule is the attribute of any object that can be represented within an app such as focused control. |
es: | Nombre ejecutable de cualquier objeto | obj.appModule.appName | appModule es el atributo de cualquier objeto que se pueda representar dentro de una aplicación como el control enfocado. |

source: | Send keystrokes | gesture.send() | This is to be called from a script with the desired keystroke bound to it. |
es: | Enviar combinaciones de teclas | gesture.send() | Se debe llamar desde un script asociado a la combinación de teclas deseada. |

source: | Handling multiple presses of a keystroke | scriptHandler.getLastScriptRepeatCount() | 0 means the command was pressed once. |
es: | Manejo de múltiples pulsaciones de teclas | scriptHandler.getLastScriptRepeatCount() | 0 significa que la orden se ha pulsado una vez. |

source: | I want to assign Control+Alt+number row to a script | In initOverlayClass(self): for key in range(10): self.bindGesture("control+alt+%s"%(key), "somescript") | For Python 2, use xrange instead. For ease of readability, indent each statement on separate lines. |
es: | Quiero asignar la fila Control+Alt+número a un script | En initOverlayClass(self): for key in range(10): self.bindGesture("control+alt+%s"%(key), "elscript") | Para Python 2, utiliza xrange en su lugar. Para facilidad de lectura, indenta cada sentencia en líneas separadas. |

source: | providing input help message | script_somescript.__doc__ | Effectivley, a script's docstring is treated as its input help message. |
es: | proporcionar mensajes de ayuda para entradas | script_somescript.__doc__ | Efectivamente, la cadena de documentación del script se trata como su mensaje de ayuda para entradas. |

source: | Handle name changes | event_nameChange(self, obj, nextHandler) | The body should consist of what should be done, ending with a call -to nextHandler() function. |
es: | Manejar los cambios de nombre | event_nameChange(self, obj, nextHandler) | El cuerpo debe consistir en lo que se debe hacer, terminando con una llamada a la función nextHandler (). |

source: | Live region change announcements | event_liveRegionChange(self, obj, nextHandler) | By default, new text will be spoken and/or brailled. |
es: | Anuncios de cambio de región viva | event_liveRegionChange(self, obj, nextHandler) | De forma predeterminada, el nuevo texto será hablado y/o braillificado. |

source: | Instantly transform a window into a dialog | In chooseNVDAObjectOverlayClasses(self, obj, clsList): if you found the window you want: clsList.insert(0, NVDAObjects.Behaviors.Dialog) | Be sure to identify this window that is really a dialog. If done correctly, contents of this "dialog" will be announced automatically. |
es: | Transformar instantáneamente una ventana en un diálogo | En chooseNVDAObjectOverlayClasses(self, obj, clsList): si encuentras la ventana que quieres: clsList.insert(0, NVDAObjects.Behaviors.Dialog) | Asegúrate de identificar que esta ventana es realmente un diálogo. Si se hace correctamente, los contenidos de este"diálogo" se anunciarán automáticamente. |

source: | I'm working with a terminal window | Inherit from NVDAObjects.behaviors.Terminal | |
es: | Estoy trabajando con una ventana de terminal | Hereda de NVDAObjects.behaviors.Terminal | |

source: | I want to add table navigation commands for an object that is not shown as a table yet | Inherit from NVDAObjects.behaviors.RowWithFakeNavigation | This class defines input help mode message and a base implementation for table navigation commands (Control+Alt+arrows). \
es: | Deseo añadir órdenes de navegación de tabla para un objeto que todavía no se muestra como tabla | Hereda de NVDAObjects.behaviors.RowWithFakeNavigation | Esta clase define el mensaje del modo de ayuda de entrada y una implementación básica para las órdenes de navegación de tabla (Control+Alt+flechas). |

source: | I need pointers for providing improved support for a Java application | NVDAObjects.JAB and JABHandler module | Java Access Bridge (32-bit and 64-bit) should be installed. |
es: | Necesito indicadores para proporcionar soporte mejorado para una aplicación Java | NVDAObjects.JAB y módulo JABHandler | Java Access Bridge (de 32 y 64 bits) debería instalarse. |

source: | Adding support for an app that has similar functionality as another app | Import contents of the source app module via from appModuleName import * | Commonly called "aliasing". |
es: | Añadir soporte para una aplicación con funcionalidad similar a la de otra aplicación | Importar contenidos del módulo de aplicación fuente a través de from nombremódulo import * | Se conoce con el nombre de "Aliasing". |

source: | Play a tone | tones.beep(hertz, duration) | Duration in milliseconds. |
es: | Reproducir un tono | tones.beep(hertz, duration) | Duración en milésimas de segundo. |

source: | Play a tone on the left speaker | tones.beep(hertz, duration, leftVolume=100, rightVolume=0) | |
es: | Reproducir un tono en el altavoz izquierdo | tones.beep(hertz, duration, leftVolume=100, rightVolume=0) | |
