Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/NVDAReadme.po
Languages: es

source: NVDA (NonVisual Desktop Access) is a free, open source screen reader for Microsoft Windows.
es: NVDA (Non Visual Desktop Access) es un lector de pantalla gratuito y de código abierto para Microsoft Windows.

source: It is developed by NV Access in collaboration with a global community of contributors.
es: Es desarrollado por NV Access en colaboración con una comunidad global de usuarios.

source: To learn more about NVDA or download a copy, visit the main [NV Access](http://www.nvaccess.org/) website.
es: Para aprender más sobre NVDA o descargar una copia, visita el sitio web principal de [NV Access](https://www.nvaccess.org/).

source: Please note: the NVDA project has a [Citizen and Contributor Code of Conduct](CODE_OF_CONDUCT.md). NV Access expects that all contributors and other community members will read and abide by the rules set out in this document while participating or contributing to this project.
es: Nota importante: el proyecto NVDA tiene un [código de conducta del ciudadano y el colaborador](https://nvda.es/documentacion/codigo-de-conducta-del-ciudadano-y-el-colaborador-elaborado-por-nv-access/). NV Access espera que todos los colaboradores y otros miembros de la comunidad lean y cumplan las reglas escritas en este documento al participar y colaborar en este proyecto.

source: ## Get support
es: ## Obtención de soporte

source: Whether you are a beginner, an advanced user, a new or a long time developer; or if you represent an organization wishing to know more or to contribute to NVDA: you can get support through the included documentation as well as several communication channels dedicated to the NVDA screen reader. Here is an overview of the most important support sources.
es: Ya seas un principiante, un usuario avanzado, un desarrollador novato o con experiencia, o representas a una organización dispuesta a saber más o colaborar con NVDA: puedes obtener soporte de la documentación incluida, así como de canales de comunicación dedicados al lector de pantalla NVDA. Aquí hay una descripción general de las fuentes de soporte más importantes.

source: ### Documentation
es: ### Documentación

source: * [NVDA User Guide](https://www.nvaccess.org/files/nvda/documentation/userGuide.html)
es: * [Guía de usuario de NVDA](https://www.nvaccess.org/files/nvda/documentation/userGuide.html)

source: * [NVDA Developer Guide](https://www.nvaccess.org/files/nvda/documentation/developerGuide.html)
es: * [Guía del desarrollador de NVDA](https://www.nvaccess.org/files/nvda/documentation/developerGuide.html)

source: * [NVDA Add-ons Development Internals](https://github.com/nvdaaddons/DevGuide/wiki)
es: * [Desarrollo de complementos de NVDA en profundidad](https://github.com/nvdaaddons/DevGuide/wiki)

source: * [NVDA ControllerClient manual](https://github.com/nvaccess/nvda/tree/master/extras/controllerClient)
es: * [Manual de NVDA ControllerClient](https://github.com/nvaccess/nvda/tree/master/extras/controllerClient)

source: * Further documentation is available in the NVDA repository's [Wiki](https://github.com/nvaccess/nvda/wiki), and in the [Community Wiki](https://github.com/nvaccess/nvda-community/wiki)
es: * Hay más documentación en la [Wiki](https://github.com/nvaccess/nvda/wiki) del repositorio de NVDA, y en la [Wiki de la comunidad](https://github.com/nvaccess/nvda-community/wiki)

source: ### Communication channels
es: ### Canales de comunicación

source: * [NVDA Users Mailing List](https://nvda.groups.io/g/nvda)
es: * [Lista de correo de usuarios de NVDA](https://nvda.groups.io/g/nvda)

source: * [NVDA Developers Mailing List](https://groups.io/g/nvda-devel)
es: * [Lista de correo de desarrollo de NVDA](https://groups.io/g/nvda-devel)

source: * [NVDA Add-ons Mailing List](https://groups.io/g/nvda-addons)
es: * [Lista de correo de complementos de NVDA](https://groups.io/g/nvda-addons)

source: * [Instant Messaging channel for NVDA Support](https://gitter.im/nvaccess/NVDA)
es: * [Canal de mensajería instantánea de soporte de NVDA](https://gitter.im/nvaccess/NVDA)

source: * [Other sources including groups and profiles on social media channels, language specific websites and mailing lists etc.](https://github.com/nvaccess/nvda-community/wiki/Connect)
es: * [Otras fuentes, incluyendo grupos, canales y perfiles en redes sociales, sitios en idiomas específicos y listas de correo, etc.](https://github.com/nvaccess/nvda-community/wiki/Connect)

source: You can also get direct support from NV Access. See the [NV Access](http://www.nvaccess.org/) website for more details.
es: También puedes obtener soporte directo de NV Access. Consulta el sitio web de [NV Access](https://nvaccess.org) para más detalles.

source: ## Other Key Project Links
es: ## Otros enlaces clave del proyecto

source: * [NVDA on GitHub](https://github.com/nvaccess/nvda)
es: * [NVDA en GitHub](https://github.com/nvaccess/nvda)

source: * [NVDA issues on GitHub](https://github.com/nvaccess/nvda/issues): Bug reports, feature requests, etc.
es: * [Incidencias de NVDA en GitHub](https://github.com/nvaccess/nvda/issues): Informe de fallos, solicitud de características, etc.

source: * [NVDA development snapshots](https://www.nvaccess.org/files/nvda/snapshots/): Automatically generated builds of the project in its current state of development
es: * [Versiones de desarrollo de NVDA](https://www.nvaccess.org/files/nvda/snapshots/): Compilaciones automáticas del proyecto en su estado actual de desarrollo

source: * [NVDA add-ons](https://addons.nvda-project.org/): Get add-ons to enhance NVDA
es: * [Complementos de NVDA](https://addons.nvda-project.org/): Obtén complementos para mejorar NVDA

source: * [NVDA Add-ons coordination and support center](https://github.com/nvdaaddons): all about NVDA's addons environment
es: * [Centro de soporte y coordinación de complementos de NVDA](https://github.com/nvdaaddons): todo sobre el entorno de complementos de NVDA

source: * [NVDA Add-ons Template](https://github.com/nvdaaddons/AddonTemplate): A repository for generating the Add-ons template
es: * [Plantilla de complementos de NVDA](https://github.com/nvdaaddons/AddonTemplate): un repositorio para generar la plantilla de complementos de NVDA

source: * [Translating NVDA](https://github.com/nvaccess/nvda/wiki/Translating): Information about how to translate NVDA into another language
es: * [Traducir NVDA](https://github.com/nvaccess/nvda/wiki/Translating): Información sobre cómo traducir NVDA a otro idioma

source: * [NVDA Controller Client](http://www.nvda-project.org/nvdaControllerClient/nvdaControllerClient_20100219.7z) (2010-02-19): NVDA API for external applications to directly speak or braille messages, etc.
es: * [Cliente del controlador de NVDA](http://www.nvda-project.org/nvdaControllerClient/nvdaControllerClient_20100219.7z) (19-02-2010): API de NVDA para que las aplicaciones externas hablen directamente o envíen mensajes Braille, etc.

source: * [Contributing to NVDA](https://github.com/nvaccess/nvda/wiki/Contributing): Guidelines for contributing to the NVDA source code
es: * [Cómo contribuir con NVDA](https://github.com/nvaccess/nvda/wiki/Contributing): Guías para contribuir con código fuente a NVDA

source: * [NVDA commits email list](https://lists.sourceforge.net/lists/listinfo/nvda-commits): Notifications for all commits to the Git repository
es: * [Lista de correo de commits de NVDA](https://lists.sourceforge.net/lists/listinfo/nvda-commits): Notificaciones de todos los commits que se hacen al repositorio Git

source: * [Old email archives](http://nabble.nvda-project.org/Development-f1.html): contain discussions about NVDA development
es: * [Archivos antiguos de correo](http://nabble.nvda-project.org/Development-f1.html): Contienen debates sobre el desarrollo de NVDA

source: ## Getting the Source Code
es: ## Obtención del código fuente

source: The NVDA project uses the [Git](https://www.git-scm.com/) version control system for its source code and documentation.
es: El proyecto NVDA usa el sistema de control de versiones [Git](https://www.git-scm.com/) para su código fuente y documentación.

source: The NVDA Git repository is located at https://github.com/nvaccess/nvda.git. You can clone it with the following command, which will place files in a directory named `nvda`:
es: El repositorio git de NVDA está ubicado en https://github.com/nvaccess/nvda.git. Puedes clonarlo con el siguiente comando, que situará los archivos en un directorio llamado nvda:

source: The `--recursive` option is needed to retrieve various Git submodules we use.
es: La opción `--recursive` se usa para recuperar varios submódulos Git necesarios.

source: ## Dependencies
es: ## Dependencias

source: The NVDA source depends on several other packages to run correctly.
es: El código fuente de NVDA depende de varios paquetes para ejecutarse correctamente.

source: ### Installed Dependencies
es: ### Dependencias instaladas

source: The following dependencies need to be installed on your system:
es: Necesitas instalar las siguientes dependencias en tu sistema:

source: * [Python](https://www.python.org/), version 3.7, 32 bit
es: * [Python](https://www.python.org/), versión 3.7 de 32 bits

source: * Use latest minor version if possible.
es: * Utiliza la última revisión menor si es posible.

source: * To replicate the production build environment, use the [version of Visual Studio that AppVeyor is using](https://www.appveyor.com/docs/windows-images-software/#visual-studio-2019).
es: * Para replicar el entorno de compilación en producción, usa la [versión de Visual Studio utilizada por AppVeyor](https://www.appveyor.com/docs/windows-images-software/#visual-studio-2019).

source: * Download from https://visualstudio.microsoft.com/downloads/
es: * Descarga desde https://visualstudio.microsoft.com/downloads/

source: * When you do not use the Visual Studio IDE itself, you can download the build tools under the Tools for Visual Studio 2019 expandable heading
es: * Si no usas el propio entorno de desarrollo de Visual Studio, puedes descargar las herramientas de compilación bajo el encabezado expandible Herramientas de Visual Studio 2019

source: * When you are intending to use the Visual Studio IDE (not required for NVDA development), you can download the community version under the Visual Studio 2019 expandable heading
es: * Si te propones usar el entorno de desarrollo Visual Studio (no es necesario para el desarrollo de NVDA), puedes descargar la versión Community bajo el encabezado expandible Visual Studio 2019

source: * When installing Visual Studio, you need to enable the following:
es: * Al instalar Visual Studio, necesitas activar lo siguiente:

source: * In the list on the Workloads tab
es: * En la lista de la pestaña cargas de trabajo

source: * in the Windows grouping:
es: * En la agrupación Windows:

source: * Desktop development with C++
es: * Desarrollo para escritorio con C++

source: * Then in the Installation details tree view, under Desktop for C++, Optional, ensure the following are selected:
es: * A continuación, en el árbol detalles de la instalación, bajo C++ para escritorio, en el grupo opcional, asegúrate de que se ha seleccionado lo siguiente:

source: * MSVC v142 - VS 2019 C++ x64/x86 build tools
es: * Herramientas de compilación MSVC v142 - VS 2019 C++ x64/x86

source: * C++ ATL for v142 build tools (x86 & x64)
es: * ATL de C++ para las herramientas de compilación V142 (X86 y X64)

source: * C++ Clang tools for Windows
es: * Herramientas Clang de C++ para Windows

source: * On the Individual components tab, ensure the following items are selected:
es: * En la pestaña componentes individuales, asegúrate de que los siguientes están seleccionados:

source: * MSVC v142 - VS 2019 C++ ARM64 build tools
es: * Herramientas de compilación MSVC v142 - VS 2019 C++ ARM64

source: * C++ ATL for v142 build tools (ARM64)
es: * ATL de C++ para las herramientas de compilación V142 (ARM64)

source: ### Git Submodules
es: ### Submódulos Git

source: Some of the dependencies are contained in Git submodules.
es: Algunas de las dependencias van dentro de submódulos Git.

source: If you didn't pass the `--recursive` option to git clone, you will need to run `git submodule update --init`.
es: Si no pasaste la opción `–recursive` a git clone, tendrás que ejecutar `git submodule update –init`.

source: Whenever a required submodule commit changes (e.g. after git pull), you will need to run `git submodule update`.
es: Cada vez que cambie el commit relacionado con un submódulo necesario (por ejemplo después de git pull), deberás ejecutar `git submodule update`.

source: If you aren't sure, run `git submodule update` after every git pull, merge or checkout.
es: Si no estás seguro, ejecuta `git submodule update` después de hacer pull, merge o checkout.

source: For reference, the following run time dependencies are included in Git submodules:
es: Para referencia, las siguientes dependencias de tiempo de ejecución se incluyen como submódulos Git:

source: * [eSpeak NG](https://github.com/espeak-ng/espeak-ng), version 1.51-dev commit 74068b91bcd578b
es: * [eSpeak NG](https://github.com/espeak-ng/espeak-ng), versión 1.51-dev, commit 74068b91bcd578b

source: * [liblouis](http://www.liblouis.org/), version 3.18.0
es: * [liblouis](http://www.liblouis.org/), versión 3.18.0

source: * [Unicode Common Locale Data Repository (CLDR)](http://cldr.unicode.org/), version 39.0
es: * [Unicode Common Locale Data Repository (CLDR)](http://cldr.unicode.org/), versión 39.0

source: * NVDA images and sounds
es: * Imágenes y sonidos de NVDA

source: * [Adobe Acrobat accessibility interface, version XI](https://download.macromedia.com/pub/developer/acrobat/AcrobatAccess.zip)
es: * [Interfaz de accesibilidad de Adobe Acrobat, versión XI](https://download.macromedia.com/pub/developer/acrobat/AcrobatAccess.zip)

source: * [MinHook](https://github.com/RaMMicHaeL/minhook), tagged version 1.2.2
es: * [MinHook](https://github.com/RaMMicHaeL/minhook), versión etiquetada 1.2.2

source: * brlapi Python bindings, version 0.8 or later, distributed with [BRLTTY for Windows](https://brltty.app/download.html), version 6.1
es: * Bindings de Python para brlapi versión 0.8.0 o posterior, distribuidos en [BRLTTY para Windows](https://brltty.app/download.html) versión 6.1

source: * lilli.dll, version 2.1.0.0
es: * lilli.dll, versión 2.1.0.0

source: * [Python interface to FTDI driver/chip](http://fluidmotion.dyndns.org/zenphoto/index.php?p=news&title=Python-interface-to-FTDI-driver-chip)
es: * [Interfaz Python para el controlador y el chip FTDI](http://fluidmotion.dyndns.org/zenphoto/index.php?p=news&title=Python-interface-to-FTDI-driver-chip)

source: * Java Access Bridge 32 bit, from Zulu Community OpenJDK build 13.0.1+10Zulu (13.28.11)
es: * Java Access Bridge de 32 bits, procedente del OpenJDK de la Comunidad Zulu, compilación 13.0.1+10Zulu (13.28.11)

source: Additionally, the following build time dependencies are included in the miscDeps git submodule:
es: Además, las siguientes dependencias de tiempo de compilación también se incluyen en el submódulo Git miscDeps:

source: * [txt2tags](https://txt2tags.org/), version 2.5
es: * [txt2tags](https://txt2tags.org/), versión 2.5

source: * [Nulsoft Install System](https://nsis.sourceforge.io/Main_Page/), version 2.51
es: * [Nulsoft Install System](https://nsis.sourceforge.io/Main_Page/), versión 2.51

source: * [NSIS UAC plug-in](https://nsis.sourceforge.io/UAC_plug-in), version 0.2.4, ansi
es: * [Complemento de NSIS para Uac](https://nsis.sourceforge.io/UAC_plug-in), versión 0.2.4, ansi

source: * xgettext and msgfmt from [GNU gettext](https://sourceforge.net/projects/cppcms/files/boost_locale/gettext_for_windows/)
es: * xgettext y msgfmt de [GNU gettext](https://sourceforge.net/projects/cppcms/files/boost_locale/gettext_for_windows/)

source: The following dependencies aren't needed by most people, and are not included in Git submodules:
es: Estas dependencias no vienen incluidas en submódulos Git, y casi nadie las necesita:

source: * To generate developer documentation for nvdaHelper: [Doxygen Windows installer](http://www.doxygen.nl/download.html), version 1.8.15:
es: * Para generar la documentación para nvdaHelper: [Doxygen Windows installer](http://www.doxygen.nl/download.html), versión 1.8.15:

source: * When you are using Visual Studio Code as your integrated development environment of preference, you can make use of our [prepopulated workspace configuration](https://github.com/nvaccess/vscode-nvda/) for [Visual Studio Code](https://code.visualstudio.com/).
es: * Si utilizas Visual Studio Code como tu entorno de desarrollo preferido, puedes emplear la [configuración de espacio de trabajo preconcebida](https://github.com/nvaccess/vscode-nvda/) para [Visual Studio Code](https://code.visualstudio.com/).

source: While this VSCode project is not included as a submodule in the NVDA repository, you can easily check out the workspace configuration in your repository by executing the following from the root of the repository.
es: Aunque este proyecto de VS Code no se incluye como un submódulo en el repositorio de NVDA, se puede situar fácilmente la configuración de espacio de trabajo en el repositorio ejecutando lo siguiente desde la raíz del repositorio.

source: ### Python dependencies
es: ### Dependencias Python

source: NVDA and its build system also depend on an extensive list of Python packages. They are all listed with their specific versions in the requirements.txt file in the root of this repository. However, the build system takes care of fetching these itself when needed. These packages will be installed into an isolated Python virtual environment within this repository, and will not affect your system-wide set of packages.
es: NVDA y su sistema de compilación también dependen de una extensa lista de paquetes Python. Se enumeran todos ellos con sus versiones específicas en el archivo requirements.txt en la raíz de este repositorio. No obstante, el sistema de compilación se encarga de obtenerlos por sí mismo cuando los necesita. Estos paquetes se instalarán en un entorno virtual aislado de Python dentro de este repositorio, y no afectarán al conjunto de paquetes del sistema.

source: ## Preparing the Source Tree
es: ## Preparación del código fuente

source: Before you can run the NVDA source code, you must prepare the source tree.
es: Antes de que puedas ejecutar NVDA desde el código fuente, debes prepararlo.

source: You do this by opening a command prompt, changing to the root of the NVDA source distribution and typing:
es: Esto se hace abriendo un símbolo del sistema, cambiando a la raíz del repositorio con el código fuente y escribiendo:

source: You should do this again whenever the version of comtypes changes or language files are added or changed.
es: Esto debes hacerlo cada vez que cambie la versión de comtypes o se añadan o modifiquen archivos de idioma.

source: Note that if you want to access user documentation from the help menu while running the source version, you will also need to add `user_docs` to the command line like so:
es: Si quieres acceder a la documentación del usuario desde el menú ayuda de NVDA mientras lo ejecutas desde el código fuente, tendrás que añadir en la consola `user_docs`. Por ejemplo:

source: While simply testing or committing changes, it may be faster usually just doing `scons source` as user documentation will change each time the revision number changes.
es: Mientras hagas pruebas simples o envíes cambios, será más rápido ejecutar `scons source`, ya que la documentación de usuario cambiará cada vez que se modifique el número de revisión.

source: ### Compiling NVDAHelper with Debugging Options
es: ### Compilación de NVDAHelper con opciones de depuración

source: Among other things, preparing the source tree builds the NVDAHelper libraries.
es: Entre otras cosas, la preparación del código fuente construye las bibliotecas de NVDAHelper.

source: If trying to debug nvdaHelper, you can control various debugging options by building with the `nvdaHelperDebugFlags` and `nvdaHelperLogLevel` command line variables.
es: Si tu intención es depurar nvdaHelper, puedes controlar diversas opciones de depuración compilando con las variables `nvdaHelperDebugFlags` y `nvdaHelperLogLevel` en la consola.

source: The `nvdaHelperLogLevel` variable specifies the level of logging (0-59) you wish to see, lower is more verbose. The default is 15.
es: La variable `nvdaHelperLogLevel` especifica el nivel de registro (0-59) que desees ver, cuanto más bajo más expresivo. Por defecto, su valor es 15.

source: The `nvdaHelperDebugFlags` variable takes one or more of the following flags:
es: La variable `nvdaHelperDebugFlags` acepta uno o varios de los siguientes valores:

source: * debugCRT: the libraries will be linked against the debug C runtime and assertions will be enabled. (By default, the normal CRT is used and assertions are disabled.)
es: * debugCRT: las bibliotecas se enlazarán con el tiempo de ejecución de C para depuración y se habilitarán las aserciones. (por defecto se deshabilitan las aserciones y se usa el crt normal).

source: * RTC: runtime checks (stack corruption, uninitialized variables, etc.) will be enabled. (The default is no runtime checks.)
es: * RTC: se activarán las comprobaciones en tiempo de ejecución (corrupción de pila, variables sin inicializar, etc.). (por defecto no se hacen pruebas en tiempo de ejecución).

source: * analyze: runs MSVC code analysis on all nvdaHelper code, holting on any warning. (default is no analysis).
es: * analyze: ejecuta el análisis de código de MSVC en todo el código de NVDAHelper, mostrando cada advertencia. (por defecto no hay análisis)

source: The special keywords none and all can also be used in place of the individual flags.
es: Las palabras clave none y all pueden usarse en lugar de cada valor por separado.

source: An example follows that enables debug CRT and runtype checks
es: A continuación se muestra un ejemplo que activa las comprobaciones en tiempo de ejecución y la depuración con crt

source: Symbol pdb files are always produced when building, regardless of the debug flags.
es: Independientemente de las variables de depuración, siempre se generan archivos de símbolos pdb al construir.

source: However, they are not included in the NVDA distribution.
es: Sin embargo, no se incluyen en la distribución de NVDA.

source: Instead, `scons symbolsArchive` will package them as a separate archive.
es: En vez de eso, `scons symbolsArchive` los empaqueta en un archivo separado.

source: By default, builds also do not use any compiler optimizations.
es: Por defecto, la compilación se hace sin argumentos de optimización.

source: Please see the `release` keyword argument for what compiler optimizations it will enable.
es: Mira el argumento `release` más abajo para saber qué optimizaciones se activan al usarlo.

source: ## Running the Source Code
es: ## Ejecución del código fuente

source: It is possible to run NVDA directly from source without having to build the full binary package and launcher.
es: Es posible ejecutar NVDA desde el código fuente directamente sin tener que construir el paquete binario completo ni el instalador.

source: To launch NVDA from source, using `cmd.exe`, execute `runnvda.bat` in the root of the repository.
es: Para iniciar NVDA desde el código fuente, utilizando `cmd.exe`, ejecuta `runnvda.bat` en la raíz del repositorio.

source: To view help on the arguments that NVDA will accept, use the `-h` or `--help` option.
es: Para ver una ayuda sobre los argumentos que acepta NVDA, usa las opciones `--help` o `-h`.

source: These arguments are also documented in the user guide.
es: Estos argumentos también están documentados en la guía de usuario.
