Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/NVDAReadme.po
Languages: es

source: ## Building NVDA
es: ## Construcción de NVDA

source: A binary build of NVDA can be run on a system without Python and all of NVDA's other dependencies installed (as we do for snapshots and releases).
es: Una versión binaria de NVDA puede ejecutarse en un sistema sin Python y todas las demás dependencias instaladas (tal y como hace NV Access con las liberaciones oficiales y las versiones de desarrollo).

source: Binary archives and bundles can be created using scons from the root of the NVDA source distribution. To build any of the following, open a command prompt and change to that directory.
es: Se pueden construir archivos binarios y paquetes usando scons desde la raíz de la distribución del código fuente de NVDA. Para construir cualquiera de ellos, abre un símbolo del sistema y navega a este directorio.

source: To make a non-archived binary build (equivalent to an extracted portable archive), type:
es: Para hacer una versión binaria no archivada (equivalente a un portable extraído) escribe:

source: The build will be created in the dist directory.
es: La versión compilada se creará en el directorio dist.

source: ### Building the installer
es: ### Construcción del instalador

source: To create a launcher archive (one executable allowing for installation or portable dist generation), type:
es: Para crear un archivo de lanzador (un ejecutable que permite instalar NVDA o generar un portable) escribe:

source: The archive will be placed in the output directory.
es: El archivo se ubicará en el directorio output.

source: ### Building the developer documentation
es: ### Construcción de la documentación para desarrolladores

source: To generate the NVDA developer guide, type:
es: Para generar la guía del desarrollador de NVDA, escribe:

source: The developer guide will be placed in the `devDocs` folder in the output directory.
es: La guía del desarrollador aparecerá en la carpeta `devDocs` dentro del directorio output.

source: To generate the HTML-based source code documentation, type:
es: Para generar la documentación del código fuente basada en HTML, escribe:

source: The documentation will be placed in the `NVDA` folder in the output directory.
es: La documentación aparecerá en la carpeta `NVDA` dentro del directorio output.

source: To generate developer documentation for nvdaHelper (not included in the devDocs target):
es: Para generar documentación para desarrolladores de nvdaHelper (no incluida en devDocs):

source: The documentation will be placed in the `devDocs\nvdaHelper` folder in the output directory.
es: La documentación aparecerá en la carpeta `devDocs\nvdaHelper` dentro del directorio output.

source: ### Generate debug symbols archive
es: ### Generación del archivo de símbolos de depuración

source: To generate an archive of debug symbols for the various dll/exe binaries, type:
es: Para generar un archivo con símbolos de depuración de los diversos exes y dlls, escribe:

source: ### Generate translation template
es: ### Generación de la plantilla de traducción

source: To generate a gettext translation template (for translators), type:
es: Para generar una plantilla de traducción gettext (para traductores), escribe:

source: ### Customising the build
es: ### Personalización de la compilación

source: Optionally, the build can be customised by providing variables on the command line:
es: Opcionalmente, la compilación puede personalizarse proporcionando variables en la línea de órdenes:

source: * version: The version of this build.
es: * version: la versión de esta compilación.

source: * release: Whether this is a release version.
es: * release: indica si esta es una liberación oficial.

source: * This enables various C++ compiler optimizations such as /O2 and whole-program optimization.
es: * Esto activa algunas optimizaciones del compilador de C++ como el argumento /O2 o la optimización del programa completo.

source: * It also instructs Python to generate optimized byte code.
es: * También indica a Python que genere bytecode optimizado.

source: * publisher: The publisher of this build.
es: * publisher: el autor de esta compilación.

source: * certFile: The certificate file with which to sign executables. The certificate must be in pfx format and contain the private key.
es: * certFile: el archivo con el certificado usado para firmar ejecutables. Debe estar en formato pfx y contener la clave privada dentro.

source: * certPassword: The password for the private key in the signing certificate. If omitted, no password will be assumed.
es: * certPassword: la contraseña de la clave privada del certificado. Si se omite, se asume que no hay contraseña.

source: * certTimestampServer: The URL of the timestamping server to use to timestamp authenticode signatures. If omitted, signatures will not be timestamped.
es: * certTimestampServer: la URL del servidor de sellado de tiempo a utilizar para la marca de tiempo authenticode en las firmas. Si se omite, la firma no se sellará.

source: * outputDir: The directory where the final built archives and such will be placed.
es: * outputDir: el directorio donde se ubicarán los archivos construidos.

source: * targetArchitectures: The target architectures that NVDA should support. Possible values are all, x86 and x86_64. This should generally be left as the default.
es: * targetArchitectures: las arquitecturas que debería soportar NVDA. Sus posibles valores son all, x86 y x86_64. Generalmente debería dejarse como está.

source: For example, to build a launcher with a specific version, you might type:
es: Por ejemplo, para construir un lanzador con una versión específica, podrías escribir:

source: For more see the `sconstruct` file.
es: Para ver más variables, consulta el archivo `sconstruct`.

source: ## Running Automated Tests
es: ## Ejecución de pruebas automatizadas

source: If you make a change to the NVDA code, you should run NVDA's automated tests.
es: Si haces cambios al código de NVDA, deberías ejecutar sus pruebas automatizadas.

source: These tests help to ensure that code changes do not unintentionally break functionality that was previously working.
es: Estas pruebas ayudan a asegurar que los cambios en el código no rompen de forma involuntaria alguna funcionalidad que previamente estaba operativa.

source: To run the tests (unit tests, translatable string checks), first change directory to the root of the NVDA source distribution as above.
es: Para realizar las pruebas (pruebas unitarias, comprobación de cadenas traducibles), navega al directorio raíz del repositorio como se ha indicado más arriba.

source: Then, run:
es: A continuación, ejecuta:

source: ### Unit tests
es: ### Pruebas unitarias

source: To run only specific unit tests, specify them using the `unitTests` variable on the command line.
es: Para ejecutar solamente pruebas unitarias específicas, indícalas en la variable `unitTests` en la línea de órdenes.

source: The tests should be provided as a comma separated list.
es: Las pruebas deberían proporcionarse en una lista separadas por comas.

source: Each test should be specified as a Python module, class or method relative to the `tests\unit` directory.
es: Cada prueba debería especificarse como un módulo, clase o método relativo al directorio `tests\unit`.

source: For example, to run only methods in the `TestMove` and `TestSelection` classes in the file `tests\unit\test_cursorManager.py` file, run this command:
es: Por ejemplo, para ejecutar sólo los métodos en las clases `TestMove` y `TestSelection` del archivo `tests\unit\test_cursorManager.py`, escribe esta orden:

source: ### Translatable string checks
es: ### Comprobación de cadenas traducibles

source: To run only the translatable string checks (which check that all translatable strings have translator comments), run:
es: Para ejecutar solamente las comprobaciones de cadenas traducibles (que comprueban que todas las cadenas tienen comentarios para traductores), escribe:

source: ### Linting your changes
es: ### Comprobación del estilo de tus cambios

source: In order to ensure your changes comply with NVDA's coding style you can run the Flake8 linter locally.
es: Para garantizar que tus cambios cumplen con el estilo de codificación de NVDA, puedes ejecutar el comprobador Flake8 localmente.

source: Some developers have found certain linting error messages misleading, these are clarified in `tests/lint/readme.md`.
es: Algunos desarrolladores han encontrado ciertos mensajes de error de comprobación de estilo sin sentido, estos se aclaran en `tests/lint/readme.md`.

source: runlint.bat will use Flake8 to inspect only the differences between your working directory and the specified `base` branch.
es: runlint.bat usará Flake8 para inspeccionar únicamente las diferencias entre tu directorio de trabajo y la rama `base` especificada.

source: If you create a Pull Request, the `base` branch you use here should be the same as the target you would use for a Pull Request. In most cases it will be `origin/master`.
es: Si creas una solicitud de cambios, la rama `base` para ese caso debería ser la misma que el destino que usarías para la solicitud de cambios. En la mayoría de los casos será `origin/master`.

source: To be warned about linting errors faster, you may wish to integrate Flake8 with other development tools you are using.
es: Para recibir avisos más deprisa sobre errores de estilo, podrías querer integrar Flake8 con otras herramientas de desarrollo que utilices.

source: For more details, see `tests/lint/readme.md`
es: Para más detalles, consulta `tests/lint/readme.md`

source: ### Unit Tests
es: ### Pruebas unitarias

source: Unit tests can be run with the `rununittests.bat` script.
es: Se pueden ejecutar las pruebas unitarias con el script `rununittests.bat`.

source: Internally this script uses the Nose Python test framework to execute the tests.
es: Internamente, este script usa el framework de pruebas Python Nose para ejecutar las pruebas.

source: Any arguments given to rununittests.bat are forwarded onto Nose.
es: Cualquier argumento dado a rununittests.bat se reenvía a Nose.

source: Please refer to Nose's own documentation on how to filter tests etc.
es: Consulta la propia documentación de Nose para saber cómo filtrar pruebas, etc.

source: ### System Tests
es: ### Pruebas del sistema

source: System tests can be run with the `runsystemtests.bat` script.
es: Las pruebas de sistema se pueden ejecutar con el script `runsystemtests.bat`.

source: Internally this script uses the Robot test framework to execute the tests.
es: Internamente, este script usa el framework de pruebas Robot para ejecutar las pruebas.

source: Any arguments given to runsystemtests.bat are forwarded onto Robot.
es: Cualquier argumento dado a runsystemtests.bat se reenvía a Robot.

source: For more details (including filtering and exclusion of tests) see `tests/system/readme.md`.
es: Para más detalles (incluyendo filtrado y exclusión de pruebas), consulta `tests/system/readme.md`.

source: ## Contributing to NVDA
es: ## Colaboración con NVDA

source: If you would like to contribute code or documentation to NVDA, you can read more information in our [contributing guide](https://github.com/nvaccess/nvda/wiki/Contributing).
es: Si deseas colaborar con NVDA aportando código o documentación, puedes leer más sobre ello en la [guía de colaboración](https://github.com/nvaccess/nvda/wiki/Contributing).
