Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/NVDA_Add-on_Development_Guide.po
Languages: es

source: | Play a wave file | nvwave.playWaveFile(path) | For example, nvwave.playWaveFile(r"test.wav") |
es: | Reproducir un fichero de sonido wav | nvwave.playWaveFile(path) | Por ejemplo, nvwave.playWaveFile(r"test.wav") |

source: | Obtain text info for a given object | obj.TextInfo | Note the uppercase "T". |
es: | Obtener información de texto para un objeto determinado | obj.TextInfo | Observa la "T" mayúscula. |

source: | Check if keyboard echo (typed characters) is on | config.conf["keyboard"]["speakTypedCharacters"] | |
es: | Comprobar si el eco de teclado (caracteres tecleados) está activado | config.conf["keyboard"]["speakTypedCharacters"] | |

source: | turn speak command keys on without opening a settings dialog | config.conf["keyboard"]["speakCommandKeys"] = True | The user should toggle this on via keyboard settings dialog. |
es: | activar la verbalización de las teclas de órdenes sin abrir el cuadro de diálogo de configuración | config.conf["keyboard"]["speakCommandKeys"] = True | El usuario debe activar esto a través del diálogo de opciones de teclado. |

source: | Is focus mode/forms mode active | obj.treeInterceptor.passThrough | If True, focus/forms mode is on while using browse mode documents. |
es: | El Modo foco/modo formularios está activo | obj.treeInterceptor.passThrough | Si es true, el modo foco/modo formularios está activado mientras se utilizan los documentos del modo exploración. |

source: | Is touchscreen support available | touchHandler.handler is not None | If it is not None, touch support is active and available. |
es: | Dispone de soporte para pantalla táctil | touchHandler.handler is not None | Si no es None, el soporte táctil está activo y disponible. |

source: | Get NVDA version | versionInfo.version | |
es: | Obtener la versión de NVDA | versionInfo.version | |

source: | I wish to do something whenever configuration profiles are changed | config.post_configProfileSwitch | You need to register a function to listen to this action, then let this function do something when profiles are changed. |
es: | Quiero hacer algo cada vez que cambien los perfiles de configuración | config.post_configProfileSwitch | debes registrar una función que escuche esta acción, y hacer que haga algo cada vez que los perfiles cambien. |

source: | Let me know if this is a snapshot build | __debug__ | If yes (True), this is a snapshot build, otherwise this is a release version. |
es: | Hazme saber si esta es una versión de desarrollo | __debug__ | Si esta variable es True, la versión actual es de desarrollo. En cualquier otro caso, es una liberación oficial. |

source: | I need certain features in order for my code to work better | hasattr(module, something) | This allows you to check for existence of a feature/attribute you need, as it then allows you to support old and new code paths. |
es: | Necesito ciertas características para que mi código funcione mejor | hasattr(módulo, algo) | esto te permite comprobar la existencia de una característica o atributo que puedas necesitar, de tal forma que puedas dar soporte a versiones antiguas y nuevas del código. |

source: | Windows version | sys.getwindowsversion | This returns a tuple of five elements: major version, minor version, build number, platform, and service pack version. |
es: | Versión de Windows | sys.getwindowsversion | Esto devuelve una tupla de cinco elementos: versión principal, versión menor, número de compilación, plataforma y versión del Service Pack. |

source: | Is 64-bit Windows | os.environ["PROCESSOR_ARCHITEW6432"] in ("AMD64", "ARM64") or os.path.exists(r"C:\Program Files (X86) | The environment variable method is more reliable. Starting from 2017.4, both AMD64 or ARM64 must be checked, especially when supporting Windows 10 on ARM. |
es: | ¿Es Windows de 64 bits? | os.environ("PROCESSOR_ARCHITEW6432") in ["AMD64", "ARM64"] o también os.path.exists(r"C:\Program Files (X86)") | El método variable de entorno es más fiable. A partir de 2017.4, se debe comprobar tanto AMD64 como ARM64, especialmente cuando se admite Windows 10 en ARM. |

source: | Registry access | _winreg module | Changed to "winreg" in Python 3. |
es: | Acceso al registro | Módulo _winreg | Cambiado a "winreg" en Python 3. |

source: | Open a website with the default web browser | os.startfile(URL) | |
es: | Abrir un sitio web con el navegador web predeterminado | os.startfile(URL) | |

source: | Download headers for a file on the web | resource = urllib.urlopen(URL) | |
es: | Descargar cabeceras para un archivo en la web | resource = urllib.urlopen(URL) | |

source: | Work with JSON data | json module | |
es: | Trabajar con datos JSON | Módulo json | |

source: | Allocate some memory somewhere | ctypes.windll.kernel32.VirtualAllocEx() | The faster way to do this is winKernel.virtualAllocEx function. |
es: | Reservar algo de memoria en algún lugar | ctypes.windll.kernel32.VirtualAllocEx() | La forma más rápida de hacerlo es la función winKernel.virtualAllocEx. |

source: | Send a message to another process | ctypes.windll.user32.SendMessageW() | The shorter way is winUser.sendMessage() function.
es: | Enviar un mensaje a otro proceso | ctypes.windll.user32.SendMessageW() | El camino más corto es la función winUser.sendMessage().

source: | Current time in seconds | time.time() | This returns seconds elapsed from January 1, 1970 at midnight. |
es: | Hora actual en segundos | time.time() | Devuelve segundos transcurridos desde el 1 de enero de 1970 a medianoche. |

source: | Create a message box | gui.messageBox | A thin wrapper around wx.MessageBox class. |
es: | Crear un cuadro de mensaje | gui.messageBox | Una fina envoltura alrededor de la clase wx.MessageBox. |

source: | Create a custom dialog | wx.Dialog | |
es: | Crear un diálogo personalizado | wx.Dialog | |

source: | Run multiple background tasks at once | threading.Thread | In reality, due to internal issues, Python will run one thread after another. This approach is useful if you want to run a background task while making NVDA remain responsive. |
es: | Ejecutar varias tareas en segundo plano a la vez | threading.Thread | En realidad, debido a problemas internos, Python ejecutará un hilo tras otro. Este enfoque es útil si deseas ejecutar una tarea en segundo plano mientras haces que NVDA siga respondiendo. |

source: | Run something periodically | wx.PyTimer or threading.Timer | |
es: | Ejecutar algo periódicamente | wx.PyTimer o threading.Timer | |

source: | Tally occurrence of text in a document | collections.Counter | Be sure to have a list of words from a text file before running a tally on it. |
es: | Ocurrencia del recuento de texto en un documento | collections.Counter | Asegúrate de tener una lista de palabras de un archivo de texto antes de ejecutar una cuenta en él. |

source: | Create a dynamic array | list object | Python's list object ([]) is a dynamic array. \
es: | Crear una matriz dinámica | Objeto list | El objeto de lista de Python ([]) es una matriz dinámica. |

source: | Work with associative arrays | dict object | Python's dictionary ({}) object is another name for associative array, sometimes called a map. |
es: | Trabajar con matrices asociativas | Objeto dict | El objeto diccionario de Python ({}) es otro nombre para la matriz asociativa, a veces llamada mapa. |

source: | Open, parse, and save config files | config module or configobj module | |
es: | Abrir, analizar y guardar archivos de configuración | módulo config o módulo configobj | |

source: | I wish to make my code run faster and error-free | DO NOT DO IT UNLESS YOU REALLY NEED TO! | To paraphrase a quote from a famous programmer, "don't optimize unless you want to go through headaches". |
es: | Quiero que mi código se ejecute más rápido y sin errores | ¡No lo hagas a menos que sea necesario! | Citando a un conocido programador, "No optimices si no quieres tener dolores de cabeza". |

source: | I want to release version 1.0 of my code with everything included | NEVER DO THAT UNLESS YOU KNOW WHY, know WHAT YOU ARE DOING, OR SPECIFIED BY A CONTRACT YOU SIGNED! | |
es: | Quiero liberar la versión 1.0 de mi código con todo incluido | ¡Nunca lo hagas a menos que sepas por qué, sepas qué estás haciendo o lo especifique un contrato que hayas firmado! | |

source: | I wish to bring a feature from another screen reader to NVDA | Justify why and plan accordingly | |
es: | Me gustaría traer una función de otro lector de pantalla a NVDA | Justifica por qué y planéalo adecuadamente | |

source: | I want to contribute features of my add-on to NVDA screen reader | Send in a pull request and prepare to answer questions from reviewers | Sometimes, a feature or two from an add-on do land in NVDA screen reader but after going through pull request review process. For more information, see NV Access's contributing guidelines. |
es: | Quiero integrar funciones de mi complemento en el lector de pantalla NVDA | Envía una solicitud de cambios y prepárate para responder a las preguntas de los revisores | A veces, una o dos características de un complemento aterrizan en el lector de pantalla NVDA, pero después de pasar por un proceso de revisión en una solicitud de cambios. Para más información, mira las pautas de contribución de NV Access. |
