Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/NVDA_Add-on_Development_Guide.po
Languages: es

source: * Last tested NVDA version (lastTestedNVDAVersion): tells NVDA the highest supported release for the add-on. Without this flag being set, NVDA will treat your add-ons as incompatible with the latest release.
es: * Última versión de NVDA donde se ha probado (lastTestedNVDAVersion): le dice a NVDA la versión más alta soportada por el complemento. Si no se establece este indicador, NVDA tratará tus complementos como incompatibles con la versión más reciente.

source: Words in parentheses are manifest keys. Starting in NVDA 2019.1, these compatibility flags are mandatory for all add-ons.
es: Las palabras entre paréntesis son claves de manifest. Con la llegada de NVDA 2019.1, estos indicadores de compatibilidad son obligatorios en todos los complementos.

source: Q. My app module that was stored under appModules folder in user configuration folder isn't working in NVDA 2019.1.
es: P. Mi módulo de aplicación que estaba alojado en la carpeta appModules de la configuración de usuario no funciona en NVDA 2019.1.

source: This is because NVDA 2019.1 will not load custom extension code stored in subfolders of user configuration folder anymore. See the section on scratchpad for details.
es: Esto se debe a que NVDA 2019.1 ya no carga código de extensión personalizado situado en carpetas del directorio de configuración de usuario. Lee la sección de scratchpad para más detalles.

source: We did not include programming or Python-related FAQ's, as there are sites which answers questions about Python such as coding style. Consult these documents if you have issues with Python code.
es: No incluimos preguntas frecuentes de programación relacionadas con Python, ya que hay sitios que responden a preguntas sobre Python, tales como las relacionadas con el estilo de codificación. Consulta estos documentos si tienes problemas con el código Python.

source: Now that we have covered basic add-on components, let's learn about how to package what you know in your add-on modules themselves: global plugins, app modules and drivers.
es: Ahora que hemos cubierto los componentes básicos de un complemento, vamos a aprender acerca de cómo empaquetar lo que sabes en tus propios módulos de complemento: extensiones globales, módulos de aplicación y controladores.

source: ## Introduction to global plugins
es: ## Introducción a las extensiones globales

source: A global plugin adds features available everywhere. For example, if there is a control that will be used in many applications, then you can write a global plugin to handle them throughout NVDA. Another example is adding additional features to NVDA that can be used in all programs, such as OCR capability, place marker management and so on.
es: Una extensión global añade características disponibles en todas partes. Por ejemplo, si hay un control que se utilizará en muchas aplicaciones, puedes escribir una extensión global para manejarlas en NVDA. Otro ejemplo es la adición de funciones adicionales a NVDA que se puedan utilizar en todos los programas, como la capacidad de OCR, la gestión de marcadores de ubicación, etc.

source: A global plugin is a Python source code (.py) file with the name of your plugin. For example, if you're adding support for rich edit fields in many applications, you can name your plugin as richEditSupport.py. When naming them, try be brief so you can see what your plugin does.
es: Una extensión global es un archivo de código fuente de Python (.py) con el nombre de tu plugin. Por ejemplo, si estás añadiendo soporte para campos de edición enriquecidos en muchas aplicaciones, puedes nombrar la extensión como richEditSupport.py. Cuando los nombres, trata de ser breve para que puedas ver lo que hace tu extensión.

source: ### Typical development plan for global plugins
es: ### Plan de desarrollo típico para extensiones globales

source: Typically, a global plugin is developed thus:
es: Normalmente, una extensión global se desarrolla así:

source: 1. You or someone suggests a feature or support for a particular control across different programs.
es: 1. Tú o alguien sugiere una característica o soporte para un control en particular a través de diferentes programas.

source: 2. You plan your global plugin (see the section on when to write or not write global plugins).
es: 2. Planificas tu extensión global (consulta la sección sobre cuándo escribir o no escribir extensiones globales).

source: 3. You write your global plugin and test it. Once it is done and tested, you release the plugin.
es: 3. escribes tu extensión global y la pruebas. Una vez hecha y probada, liberas la extensión.

source: Since global plugins are Python files, you can use the full power of python in your add-on code. Also, since global plugins have access to full power of NVDA code such as events, scripts and objects, you can use the concepts you learned from previous sections.
es: Dado que las extensiones globales son archivos Python, puedes utilizar toda la potencia de python en el código de tu complemento. Además, dado que las extensiones globales tienen acceso a toda la potencia del código NVDA, como eventos, scripts y objetos, puedes utilizar los conceptos aprendidos en las secciones anteriores.

source: ### The global plugin code
es: ### El código de la extensión global

source: As shown earlier, the procedure for writing global plugins is same as writing any Python program, except that you import globalPluginHandler and put your add-on code in a class called `GlobalPlugin` which inherits from `globalPluginHandler.GlobalPlugin` (see the example in the firse intro chapter). If you need to use third-party modules, you need to place the package in the same folder as the global plugin file and import the external module(s). Then define objects (usually overlay objects), methods and so on in your code.
es: Como se ha mostrado anteriormente, el procedimiento para escribir extensiones globales es el mismo que para escribir cualquier programa Python, excepto que importas globalPluginHandler y colocas tu código de complemento en una clase llamada `GlobalPlugin` que hereda de `globalPluginHandler.GlobalPlugin` (consulta el ejemplo en el capítulo introductorio). Si necesitas utilizar módulos de terceros, debes colocar el paquete en la misma carpeta que el archivo de extensión global e importar los módulos externos. A continuación, define los objetos (normalmente objetos de superposición), métodos, etc. en tu código.

source: ### When to write or not write global plugins
es: ### Cuándo escribir o no escribir extensiones globales

source: Since global plugins are used everywhere, you might be tempted to write support for a single application using global plugin alone. However, this is not the case. There are other guidelines to keep in mind when deciding whether to write a global plugin or not:
es: Dado que las extensiones globales se utilizan en todas partes, es posible que tengas la tentación de escribir soporte para una sola aplicación utilizando solamente una extensión global. Sin embargo, este no es el caso. Existen otras pautas a tener en cuenta a la hora de decidir si escribir una extensión global o no:

source: You might consider writing a global plugin if:
es: Podrías considerar la posibilidad de escribir una extensión global si:

source: 1. You or a user wishes to use a certain feature everywhere.
es: 1. Tú o un usuario deseais utilizar una cierta característica en todas partes.

source: 2. You need to support same controls across different applications, provided that the control behaves the same in these programs.
es: 2. Necesitas soportar los mismos controles en diferentes aplicaciones, siempre que el control se comporte igual en estos programas.

source: You should not write a global plugin if:
es: No deberías escribir una extensión global si:

source: 1. If you wish to enhance support for a single application.
es: 1. Si deseas mejorar el soporte para una sola aplicación.

source: 2. You are writing support for speech synthesizers or braille displays.
es: 2. Estás escribiendo soporte para sintetizadores de voz o pantallas braille.

source: ### Few more things to remember about global plugins
es: ### Algunas cosas más que recordar sobre las extensiones globales

source: * When you write scripts in your global plugin, the commands you assign to them will take precedence (looked up first). Therefore it is important to consult the NVDA user guide and help for other add-ons to minimize command conflicts.
es: * Cuando escribes scripts en tu extensión global, las órdenes que les asignes tendrán prioridad (buscadas primero). Por lo tanto, es importante consultar la guía del usuario de NVDA y la ayuda de otros complementos para minimizar los conflictos de órdenes.

source: * Each global plugin must be placed in globalPlugins directory in your add-on folder structure.
es: * Cada extensión global debe estar ubicado en el directorio globalPlugins en la estructura de carpetas del complemento.

source: * It is possible to use more than one Python file in your global plugin. If this is the case, you need to put them in a folder (name must be the name of the plugin) inside globalPlugins folder, with the main plugin file named __init__.py.
es: * Es posible usar más de un archivo Python en tu extensión global. Si este es el caso, necesitas ponerlos en una carpeta (el nombre debe ser el nombre de la extensión) dentro de la carpeta globalPlugins, con el archivo principal de la extensión llamado __init__.py.

source: * If you need to do something when the global plugin is loaded (such as loading the user configuration), you need to write an __init__ method in your plugin class. In this method, you need to call the __init__ method in the super (globalPluginHandler.GlobalPlugin) first before doing other startup work. Also, if you need to do something when the global plugin ends, define terminate method.
es: * Si necesitas hacer algo cuando la extensión global esté cargada (como por ejemplo, cargar la configuración de usuario), debes escribir un método __init__ en tu clase de extensión. En este método, debes llamar primero al método __init__ en super (globalPluginHandler.GlobalPlugin) antes de hacer otro trabajo de inicialización. Además, si necesitas hacer algo cuando la extensión global termine, define el método terminate.

source: Let's go through some examples and exercises.
es: Repasemos algunos ejemplos y ejercicios.

source: ### Example 1: Writing computer braille using QWERTY keyboard
es: ### Ejemplo 1: Escribir braille computerizado utilizando el teclado QWERTY

source: You are meeting with a client who uses Duxbury braille translator (a popular braille document production program). This client is working with another user of NVDA who wishes to write computer braille from his computer keyboard everywhere. Based on this, you decide to write a global plugin, and found a module that allows the computer keyboard to act like a braille keyboard using a function.
es: Te vas a reunir con un cliente que utiliza el traductor braille de Duxbury (un popular programa de producción de documentos braille). Este cliente está trabajando con otro usuario de NVDA que desea escribir braille desde el teclado de su computadora en cualquier lugar. Basado en esto, decides escribir una extensión global, y encontraste un módulo que permite al teclado del ordenador actuar como un teclado braille usando una función.

source: The global plugin, named brailleWrite.py, would look like this:
es: La extensión global, llamada brailleWrite.py, se vería así:

source: # An example global plugin.
es: # Un ejemplo de extensión global.

source: import qtbrl # The braille entry module.
es: import qtbrl # El módulo de entrada braille.

source: brlentry = False # Braille entry is not active.
es: brlentry = False # La entrada braille no está activa.

source: self.brlentry = True if not self.brlentry else False # Toggle braille entry mode.
es: self.brlentry = True if not self.brlentry else False # alternar modo de entrada Braille.

source: script_toggleBrailleEntry.__doc__="Toggles braille entry on or off."
es: script_toggleBrailleEntry.__doc__="Alterna la entrada Braille entre encendida y apagada."

source: With this background in mind, try some of the short exercises below.
es: Con estos antecedentes en mente, prueba algunos de los ejercicios cortos que se presentan a continuación.

source: ### Exercises
es: ### Ejercicios

source: 1. Write a global plugin named nvdaVersion.py to say the current NVDA version when NVDA+Shift+V is pressed.
es: 1. Escribe una extensión global llamada nvdaVersion.py para decir la versión actual de NVDA cuando se pulse NVDA+Shift+V.

source: 2. A user wants to hear the time announced every minute. Using the clock on the system tray, write a global plugin to announce when the time changes (hint: you need to use an event and check the role of the clock object).
es: 2. Un usuario quiere oír la hora anunciada cada minuto. Usando el reloj en la bandeja del sistema, escribe una extensión global para anunciar cuándo cambia la hora (pista: es necesario usar un evento y comprobar la función del objeto reloj).

source: ## Introduction to app modules
es: ## Introdución a los módulos de aplicación

source: An app module enhances support for a particular program. For example, you can write an app module which adds convenience commands for reading various parts of the screen, or you can define how a particular control should behave in a program.
es: Un módulo de aplicación mejora el soporte para un programa en particular. Por ejemplo, puedes escribir un módulo de aplicación que agregue órdenes de conveniencia para leer varias partes de la pantalla, o puedes definir cómo debe comportarse un control particular en un programa.

source: An app module is a Python (.py) file with the name corresponding to the executable name of a program. For example, an app module for Winamp is named winamp.py since Winamp's executable name is winamp.exe.
es: Un módulo de aplicación es un archivo Python (.py) con el nombre correspondiente al nombre ejecutable de un programa. Por ejemplo, un módulo de aplicación para Winamp se llama winamp.py ya que el nombre ejecutable de Winamp es winamp.exe.

source: NVDA itself comes with several app modules, such as Winamp, Adobe Reader, Microsoft Office programs and so on.
es: El mismo NVDA viene con varios app modules, como Winamp, Adobe Reader, programas de Microsoft Office y así sucesivamente.

source: ### Differences between app modules and global plugins
es: ### Diferencias entre módulos de aplicación y extensiones globales

source: At first glance, app modules may look the same as any global plugin. However, app modules have additional properties that global plugins lack, including:
es: A primera vista, los módulos de aplicación pueden tener el mismo aspecto que cualquier extensión global. Sin embargo, los módulos de aplicación tienen propiedades adicionales de las que carecen las extensiones globales, incluyendo:

source: * Instead of `globalPluginHandler`, you need to import `appModuleHandler`. The class to implement is `AppModule(appModuleHandler.AppModule)`.
es: * En lugar de `globalPluginHandler`, necesitas importar `appModuleHandler`. La clase a implementar es `AppModule(appModuleHandler.AppModule)`.

source: * App modules are stored in appModules folder in your add-on directory structure and is named the same as the executable name of the program.
es: * Los módulos de aplicación se almacenan en la carpeta appModules de la estructura de directorios del complemento y reciben el mismo nombre que el nombre ejecutable del programa.

source: * You can ask NVDA to enter sleep mode in a program where NVDA will not speak or braille anything while using the program, and any keyboard commands you press will be handled by the program directly. This is done by setting `sleepMode` attribute in the AppModule class to True.
es: * Puedes pedir a NVDA que entre en el modo de suspensión en un programa donde NVDA no hable o no tenga nada en braille mientras estés utilizando el programa, y cualquier orden de teclado que pulses será manejado directamente por el programa. Esto se hace estableciendo el atributo `sleepMode` en la clase AppModule a True.

source: * The `event_NVDAObject_init` routine is only available in app modules.
es: * La rutina `event_NVDAObject_init` sólo está disponible en los módulos de aplicación.

source: * You can ask NVDA to keep an eye on an object to handle events for them even if the user is using another app.
es: * Puedes pedir a NVDA que vigile un objeto para manejar eventos aunque el usuario esté usando otra aplicación.

source: ### App module development process and strategies
es: ### Proceso y estrategias de desarrollo de módulos de aplicación

source: A typical app module is developed thus:
es: Así se desarrolla un módulo de aplicación típico:

source: 1. You or a user requests enhanced support for a program.
es: 1. Tú o un usuario solicitais soporte mejorado para un programa.

source: 2. If possible, contact the app vendor (programmer) to ask accessibility improvements for the program from their end.
es: 2. Si es posible, ponte en contacto con el proveedor de la aplicación (programador) para solicitar mejoras de accesibilidad para el programa por su parte.

source: 3. With or without cooperation from app vendor, you would examine how the program works and areas on the screen that needs to be read out.
es: 3. Con o sin la cooperación del proveedor de aplicaciones, examinarías cómo funciona el programa y las áreas de la pantalla que necesitan ser leídas.

source: 4. Write and test the app module (with users) until the app module is ready for release.
es: 4. Escribe y prueba el módulo de aplicación (con usuarios) hasta que esté listo para su lanzamiento.

source: As you write app modules, try these tips:
es: A medida que escribas app modules, prueba estos consejos:

source: 1. Use objects to represent parts of a program. This is done in two steps: define the control for parts of a program via objects (inheriting from some object such as IAccessible), then use `chooseNVDAObjectOverlayClasses` routine to tell NVDA to work with your custom object when working with that control. See overlay classes section for tips.
es: 1. Utiliza objetos para representar partes de un programa. Esto se hace en dos pasos: define el control para las partes de un programa a través de objetos (heredando de algún objeto como IAccessible), luego utiliza la rutina `chooseNVDAObjectOverlayClasses` para decirle a NVDA que trabaje con tu objeto personalizado cuando trabaje con ese control. Mira la sección de clases de superposición para consejos.

source: 2. If possible, test your app module using two or more versions of the program to make sure your app module works with those versions.
es: 2. Si es posible, prueba tu app module utilizando dos o más versiones del programa para asegurarte de que tu módulo de aplicación funciona con esas versiones.

source: 3. You should not incorporate all desired features in version 1.0 - leave some of them for a future release.
es: 3. No deberías incorporar todas las características deseadas en la versión 1.0 - deja algunas de ellas para una futura versión.

source: ### Example 2: Simple app module in Notepad
es: ### Ejemplo 2: Módulo de aplicación simple en el Bloc de notas

source: Suppose you wish to find out which line you're editing in Notepad. Assuming that Notepad will show status bar at all times, you wish to assign a key combination to read the current line number.
es: Supongamos que deseas averiguar qué línea estás editando en el Bloc de notas. Asumiendo que el Bloc de notas mostrará la barra de estado en todo momento, deseas asignar una combinación de teclas para leer el número de línea actual.

source: The app module for Notepad would look like this:
es: El módulo de aplicación para el Bloc de notas se vería así:

source: # The example app module for Notepad, notepad.py.
es: # El módulo de aplicación de ejemplo para bloc de notas, notepad.py.

source: # Suppose line number is in the form " ln 1".
es: # Supongamos que el número de línea sigue el formato " ln 1".

source: So whenever you run Notepad, when you press NVDA+S, NVDA will say line number.
es: Por lo tanto, cada vez que ejecutes el Bloc de notas, cuando pulses NVDA+S, NVDA dirá el número de línea.

source: ### Example 3: Silencing NVDA in Openbook
es: ### Ejemplo 3: Silenciar NVDA en Openbook

source: Openbook is a scanning and reading program from Freedom scientific. Since Openbook provides speech, you can tell NVDA to enter sleep mode while Openbook (openbook.exe) is running using the below app module:
es: Openbook es un programa de lectura y escaneo de Freedom scientific. Como Openbook proporciona voz, puedes decir a NVDA que entre en modo latente mientras Openbook (openbook.exe) se ejecute usando el módulo de aplicación siguiente:

source: # Silencing NVDA in openbook, openbook.py.
es: # Silenciar a NVDA en openbook, openbook.py.

source: With that single line of code, NVDA will enter sleep mode in that program (you should do this only if the program provides speech and/or braille support on its own).
es: Con esa única línea de código, NVDA entrará en modo latente en ese programa (sólo debes hacerlo si el programa proporciona soporte de voz y/o braille por sí solo).

source: ### Example 4: Announcing control property changes while using another app
es: ### Ejemplo 4: Anunciar cambios de propiedad de control mientras se usa otra aplicación

source: You can ask NVDA to handle specific events while focused on another app. This is done by calling eventHandler.requestEvents in app module's __init__ method. In order to invoke this, you need process ID (PID) for the application, window class name for the object and the name of the event to be handled.
es: Puedes pedir a NVDA que gestione eventos específicos mientras se concentra en otra aplicación. Esto se hace llamando a eventHandler.requestEvents en el método __init__ del módulo de aplicación. Para poder invocar esto, necesitas el ID de proceso (PID) para la aplicación, el nombre de clase de ventana para el objeto y el nombre del evento a tratar.

source: The below code allows NVDA to announce value changes while focused on another application.
es: El siguiente código permite a NVDA anunciar los cambios de valor mientras se centra en otra aplicación.

source: # The example app module for a messenger app.
es: # Ejemplo de módulo de aplicación para un programa de mensajería.

source: # The object we wish to track has window class name of "MessengerWindow".
es: # El objeto que deseamos rastrear tiene el nombre de la clase de ventana "MessengerWindow".

source: Once defined, even if focused in another app, new messages (values) will be announced.
es: Una vez definidos, aunque estén enfocados en otra aplicación, se anunciarán nuevos mensajes (valores).

source: ### Useful app module properties and methods
es: ### Propiedades y métodos útiles de los módulos de aplicación

source: `sleepMode` and `processID` are just two of many attributes that app modules have. Other useful properties and methods used in app modules include the following:
es: `sleepMode` y `processID` son sólo dos de los muchos atributos que tienen los módulos de aplicación. Otras propiedades y métodos útiles utilizados en los módulos de aplicación incluyen los siguientes:

source: * appName: the name of the app (usually the name of the executable).
es: * appName: el nombre de la aplicación (normalmente el nombre del ejecutable).

source: * productName: Records the actual product name for the app.
es: * productName: Registra el nombre real del producto para la aplicación.

source: * productVersion: Records the version of the app.
es: * productVersion: Registra la versión de la aplicación.
