Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/NVDA_Add-on_Development_Guide.po
Languages: es

source: * If you are writing app modules or drivers, become familiar with programs, synthesizers or braille displays you wish to support (e.g. read documentation, try using them, etc.).
es: * Si estás escribiendo módulos de aplicación o controladores, familiarízate con los programas, sintetizadores o pantallas braille a las que desees dar soporte (por ejemplo lee la documentación, trata de usarlos, etc.).

source: * When defining commands (especially in global plugins), consult commands used in NVDA and other add-ons first before assigning a new command in your add-on to avoid command conflicts.
es: * En la definición de las órdenes (especialmente en extensiones globales), primero consulta las órdenes utilizadas en NVDA y otros complementos antes de asignar una nueva orden en el complemento para evitar conflictos de órdenes.

source: ## Useful modules from NVDA core
es: ## Módulos útiles del núcleo de NVDA

source: Throughout the life of add-on development, you'll come across some useful modules from NVDA core that would be helpful in your add-on code. This section explains them and some functions in those modules that would be useful, along with examples that utilize some of them.
es: A lo largo de la vida del desarrollo de un complemento, te encontrarás con algunos módulos útiles del núcleo de NVDA que serían útiles en el código para tu complemento. Esta sección te los explica y también algunas funciones.

source: Note: for readers who are scripters for other screen readers, see Appendix D on equivalent functions between screen reader scripting facilities.
es: Nota: para lectores que sean creadores de scripts para otros lectores de pantalla, consultad el Apéndice D sobre las funciones equivalentes entre las herramientas de creación de scripts de lectores de pantalla.

source: ### List of useful NVDA core modules and methods
es: ### Lista de módulos y métodos básicos útiles de NVDA

source: The following lists available NVDA core modules and some useful methods and classes found in those modules:
es: A continuación se enumeran los módulos disponibles del núcleo de NVDA y algunos métodos útiles que se encuentran en los módulos:

source: * Addon Handler (addonHandler.py): The module which implements the add-on subsystem. The addonHandler.initTranslation() method is used to initialize internationalization support for your add-on.
es: * Addon Handler (addonHandler.py): El módulo que implementa el subsistema de complementos. El método addonHandler.initTranslation() se utiliza para inicializar el soporte de internacionalización para tu complemento.

source: * NVDA basic API (api.py): A collection of core methods used throughout NVDA, such as obtaining focus and navigator object, setting focus and so on. Some of the most useful functions are:
es: * API básica de NVDA (api.py): una colección de los métodos básicos utilizados en NVDA, como la obtención del foco y el navegador de objetos, ajustar el foco, etc. Algunas de las funciones más útiles son:

source: * `api.getFocusObject()`: Retrieves the focused control (returns the object with focus).
es: * `api.getFocusObject()`: recupera el control enfocado (devuelve el objeto con el foco).

source: * `api.getNavigatorObject()`: Fetches the current navigator object. If NVDA is set to follow system focus, the focus and navigator object will be the same, otherwise a different object is returned.
es: * `api.getNavigatorObject()`: obtiene el navegador de objetos actual. Si NVDA está configurado para seguir al foco del sistema, el foco y el navegador de objetos serán lo mismo, de otro modo se devuelve un objeto diferente.

source: * `api.getForegroundObject()`: Returns the foreground window of the current application (the parent of this object is the application itself).
es: * `api.getForegroundObject()`: devuelve la ventana en primer plano de la aplicación actual (el padre de este objeto es la aplicación misma).

source: * These have a corresponding method to set certain object as the focus or navigator object. Note that these lets NVDA see the new focus or navigator object but does not actually change system focus.
es: * Estos tienen un método correspondiente para establecer un objeto determinado como el foco o el navegador de objetos. Ten en cuenta que esto permite a NVDA consultar el foco o el navegador de objetos nuevo pero no cambia el foco actual del sistema.

source: * `api.getDesktopObject()`: returns the shell (topmost level_ object).
es: * `api.getDesktopObject()`: devuelve la shell (objeto del nivel más alto).

source: * `api.copyToClip()`: copies text to the clipboard.
es: * `api.copyToClip()`: copia texto en el portapapeles.

source: * App Module subsystem (appModuleHandler.py, appModules): The subsystem in charge of handling app modules (see the chapter on app modules for more information).
es: * Subsistema de módulos de aplicación (appModuleHandler.py, appModules): El subsistema encargado de manejar los módulos de aplicación (véase el capítulo sobre los módulos de aplicación para obtener más información).

source: * ARIA support (aria.py): Implements support for Accessible Rich Internet Applications (ARIA).
es: * Soporte de ARIA (aria.py): implementa el soporte para aplicaciones de Internet enriquecidas accesibles (ARIA).

source: * Base object collection (baseObject.py): Contains useful base objects such as scriptable objects (see the chapter on NVDA objects and overlay objects for more information).
es: * Colección de objetos base (baseObject.py): contiene objetos base útiles tales como objetos scriptables (consulta el capítulo sobre objetos de NVDA y superposición de objetos para más información).

source: * Braille input and output subsystem (braille.py, brailleInput.py): Controls braille output to and input from braille displays, needed by braille display driver add-ons.
es: * Subsistema de entrada y salida braille (braille.py, brailleInput.py): controla la salida y la entrada braille de las pantallas braille, necesario para complementos de controladores de pantallas braille.

source: * Build-in modules (builtin.py): Allows access to builtin modules when working with add-ons.
es: * Módulos integrados (builtin.py): permite el acceso a módulos integrados cuando se trabaja con complementos.

source: * Configuration (config): Manages configuration and profiles (profiles are available in 2013.3 or later).
es: * Configuración (config): gestiona la configuración y los perfiles (los perfiles están disponibles en 2013.3 o posterior).

source: * Controls and states collection (controlTypes.py): Includes dictionaries on control types (roles) and possible states that a control can be in.
es: * Colección de controles y estados (controlTypes.py): incluye diccionarios sobre los tipos de control (roles) y posibles estados.

source: * Events (eventHandler.py): Handles various events such as gaining focus. One function in particular is useful in app modules:
es: * Eventos (eventHandler.py): maneja varios eventos como la optención del foco. Una función en particular es útil en los módulos de aplicación:

source: * `eventHandler.requestEvents(process ID, window class name for the control, event to be requested)`: Allows NVDA to listen to specific events for certain controls while using another app.
es: * `eventHandler.requestEvents(process ID, window class name for the control, event to be requested)`: Permite a NVDA escuchar eventos específicos para ciertos controles mientras se utiliza otra aplicación.

source: * Extension points (extensionPoints.py): provides a way to let add-ons and other modules define and respond to specific action such as profile switches, actions in an add-on and so on. The following extension points are defined:
es: * Puntos de extensión (extensionPoints.py): proporciona una forma de permitir que los complementos y otros módulos definan y respondan a acciones específicas como cambios de perfil, acciones en un complemento, etc. Se definen los siguientes puntos de extensión:

source: * `extensionPoints.Action`: notifies when something happens e.g. profile switches.
es: * `extensionPoints.Action`; notifica cuando algo ocurre, por ejemplo: el perfil cambia.

source: * `extensionPoints.Decider`: decides whether to process something further e.g. processing keyboard input from a remote system.
es: * `extensionPoints.Decider`: decide si procesar algo más, por ejemplo: procesar la entrada del teclado desde un sistema remoto.

source: * `extensionPoints.Filter`: modifies a given text for further processing e.g. advanced speech sequences.
es: * `extensionPoints.Filter`: modifica un texto determinado para su procesamiento posterior, por ejemplo, secuencias avanzadas de voz.

source: * Global Commands collection (globalCommands.py): A list of global commands available while using NVDA (see section on script scope for more information).
es: * Colección de Comandos globales (globalCommands.py): Una lista de las órdenes globales disponibles durante el uso de NVDA (véase la sección sobre el alcance de un script para más información).

source: * Global Plugin subsystem (globalPluginHandler.py): The module needed for controlling global plugins.
es: * Subsistema de extensiones globales (globalPluginHandler.py): El módulo necesario para controlar las extensiones globales.

source: * NVDA GUI (gui): A collection of classes used by NVDA to display its messages graphically. Includes GUI's for NVDA menu, add-on manager and others.
es: * GUI de NVDA (gui): Una colección de clases utilizadas por NVDA para mostrar sus mensajes de forma gráfica. Incluye la interfaz gráfica de usuario para el menú de NVDA, el administrador de complementos y otros.

source: * Hardware port utilities (hwPortUtils.py): A set of utilities for communicating over serial and other hardware ports, useful during driver add-on development.
es: * Servicios de los puertos Hardware(hwPortUtils.py): Un conjunto de utilidades para la comunicación a través de los puertos serie de hardware y otros, útil durante el desarrollo de un complemento de controlador.

source: * IAccessible support (IAccessibleHandler.py, IAccessible objects): Used for supporting Microsoft Active Accessibility (MSAA)/IAccessible controls.
es: * Soporte para IAccessible (IAccessibleHandler.py, objetos IAccessible): Se utiliza para dar soporte a los controles IAccessible.

source: * Input management (inputCore.py): Manages input from the user.
es: * Gestión de entrada (inputCore.py): Gestiona la entrada del usuario.

source: * Java Access Bridge support (JABHandler.py): A collection of methods used for supporting JAB subsystem used for Java applications.
es: * Soporte de Java Access Bridge (JABHandler.py): Una colección de los métodos utilizados para soportar el subsistema JAB utilizado por las aplicaciones Java.

source: * Keyboard input (keyboardHandler.py): Supports entering commands from the keyboard.
es: * Entrada de teclado (keyboardHandler.py): Soporta la introducción de órdenes desde el teclado.

source: * Logging facility (logHandler.py): Allows a module to write logs to be viewed by a developer or a user via Log Viewer. It includes the following class:
es: * Función de registro (logHandler.py): Permite a un módulo escribir registros para ser vistos por un desarrollador o por un usuario a través del visualizador de registro. Incluye la siguiente clase:

source: * `logHandler.Log`: The class which implements logging facility.
es: * `logHandler.Log`: la clase que implementa la utilidad de registro.

source: * Math content presentation (MathPress packages): allows NVDA to recognize and interact with various math content and markup. NvDA ships with MathML support package and support for Math Player is included in 2015.2 or later.
es: * Presentación de contenido matemático (paquetes de MathPress): permite a NVDA reconocer e interactuar con diversos contenidos matemáticos y marcas de revisión. NVDA se envía con el paquete de soporte MathML y el soporte para Math Player se incluye en 2015.2 o posterior.

source: * Mouse support (mouseHandler.py): Supports mouse commands.
es: * Soporte de ratón (mouseHandler.py): Soporta órdenes de ratón.

source: * NVDA objects collection (NVDAObjects): A collection of NVDA objects or controls used in many applications and standards such as UIA (User Interface Automation). Some objects require special actions to be performed, and these are specified in behaviors module in NvDA objects package. Some of the common ones include:
es: * Colección de objetos de NVDA (NVDAObjects): Una colección de objetos o controles de NVDA que se utilizan en muchas aplicaciones y estándares como la UIA (User Interface Automation). Algunos objetos requieren que se realicen acciones especiales y éstas se especifican en el módulo de comportamientos del paquete de objetos NVDA. Entre los más comunes se incluyen:

source: * `NVDAObjects.NVDAObject`: the base class for NVDA objects that define events, properties and so on.
es: * `NVDAObjects.NVDAObject`: la clase base para objetos de NVDA donde se definen eventos, propiedades, etcétera.

source: * `NVDAObjects.IAccessible`: a collection of MSAA/IAccessible objects, such as working with SysListView32 list views and others.
es: * `NVDAObjects.IAccessible`: una colección de objetos MSAA/IAccessible, tales como la que funciona con vistas de listas SysListView32 y otros.

source: * `NVDAObjects.JAB`: a collection of classes used when interfacing with Java applications and Java Access Bridge.
es: * `NVDAObjects.JAB`: una colección de clases utilizadas al interactuar con aplicaciones Java y Java Access Bridge.

source: * `NVDAObjects.UIA`: various classes for objects powered by UI Automation. Since 2016, it is also the home of a collection of controls used in Microsoft Edge and objects powered by EdgeHTML rendering engine.
es: * `NVDAObjects.UIA`: varias clases para objetos impulsados por UI Automation. Desde 2016, también es el sitio de una colección de controles usados en Microsoft Edge y objetos promovidos por el motor de renderizado EdgeHTML.

source: * `NVDAObjects.Window`: generic windows and other custom objects such as those found in Microsoft Excel.
es: * `NVDAObjects.Window`: ventanas genéricas y otros objetos personalizados como los que se encuentran en Microsoft Excel.

source: * `NVDAObjects.behaviors`: a collection of behaviors for specific controls, such as edit fields with or without selection detection, terminals, tool tips, help balloons, a way to simulate table commands in various controls and others.
es: * `NVDAObjects.behaviors`: una colección de comportamientos para controles específicos, tales como editar campos con o sin detección de selección, terminales, consejos, globos de ayuda, una forma de simular órdenes de tabla en varios controles y otros.

source: * Review facility (review.py): assists with working with review cursor.
es: * Facilidad de revisión (review.py): ayuda a trabajar con el cursor de revisión.

source: * Scripts support (scriptHandler.py): Handles scripts, methods executed due to the user pressing keyboard commands and other input.
es: * Soporte de Scripts (scriptHandler.py): Maneja scripts, métodos ejecutados debido a la pulsación de las órdenes de teclado y otras entradas.

source: * Speech output (speech.py): Controls speech output.
es: * Salida de voz(speech.py): Controla la salida de voz.

source: * Synthesizer driver support (synthDriverHandler.py): This is the core module needed for speech synthesizer add-ons.
es: * Soporte para controladores de Sintetizador (synthDriverHandler.py): Este es el módulo principal necesario para complementos de sintetizador de voz.

source: * Widget text access (textInfos): Allows access to text for widget and documents.
es: * Acceso al texto de los Widgets (textInfos): Permite el acceso al texto de widgets y documentos.

source: * Touchscreen support (touchHandler.py): Provides support for touchscreen input (installed versions only).
es: * Soporte de pantalla táctil (touchHandler.py): Proporciona soporte para la entrada de la pantalla táctil (sólo versiones instaladas).

source: * `touchHandler.touchSupported()` (NVDA 2018.1 and later): returns if the system supports touch interaction.
es: * `touchHandler.touchSupported()` (NVDA 2018.1 o posterior): indica si el sistema soporta interacción táctil.

source: * Tone output (tones.py): Allows the user to hear tones. The following function is defined:
es: * Salida de tonos (tones.py): Permite al usuario escuchar tonos. Se definió la siguiente función:

source: * `tones.beep(pitch in hertz, duration in milliseconds, left channel volume, right channel volume)`: Plays a tone of specified pitch for specified duration. The first two arguments are mandatory, while the other two are optional.
es: * `tones.beep(tono en hercios, duración en milésimas de segundo, volumen del canal izquierdo, volumen del canal derecho)`: Reproduce un sonido de un tono específico durante un tiempo determinado. Los dos primeros argumentos son obligatorios, mientras que los otros dos son opcionales.

source: * User interface messages (ui.py): Includes various functions for speech and/or braille output, including:
es: * Mensajes de la interfaz de usuario (ui.py): Incluye varias funciones para la salida de voz y/o braille, incluyendo:

source: * `ui.message(message to be spoken/brailled)`: Speaks or brailles the message. This should be a string surrounded by quotes.
es: * `ui.message(mensaje a ser verbalizado/braillificado)`: verbaliza o braillifica el mensaje. Este debe ser una cadena entre comillas.

source: * `ui.browsableMessage(message to be shown, HTML or not)`: displays some text on a web browser window. If you want to use HTML markup, set isHTML argument to True.
es: * `ui.browsableMessage(mensaje a ser mostrado, HTML o no)`: muestra algún texto en una ventana del navegador web. Si deseas utilizar el marcado HTML, define el argumento isHTML como True.

source: * UIA support (UIAHandler.py, UIA objects): Used for supporting UIA (User Interface Automation) controls (Windows 7 and later).
es: * Soporte UIA (UIAHandler.py, objetos UIA): Usado para soportar controles UIA (User Interface Automation) (Windows 7 y posteriores).

source: * Virtual buffers (virtualBuffers): Handles virtual buffer documents such as web sites.
es: * Mmodos virtuales(virtualBuffers): Maneja documentos del modo virtual, tales como sitios web.

source: * Windows API wrappers: the following modules are thin wrappers around Windows API libraries. You can use the below modules or call Windows API directly via ctypes.windll.dllname (e.g. ctypes.windll.user32):
es: * Capas de la API de Windows: los siguientes módulos son capas delgadas de las bibliotecas de la API de Windows. Puedes utilizar los módulos siguientes o llamar a la API de Windows directamente a través de ctypes.windll.dllname (por ejemplo, ctypes.windll.user32):

source: * `winKernel`: Wraps some constants, structures and functions from kernel32.dll that are commonly encountered in NVDA.
es: * `winKernel`: abarca algunas constantes, estructuras y funciones de kernel32.dll que se encuentran comúnmente en NVDA.

source: * `winUser`: wraps around constants, structures and functions defined in user32.dll that are used by NVDA.
es: * `winUser`: abarca las constantes, estructuras y funciones definidas en user32.dll que utiliza NVDA.

source: The modules without .py extension are directories, containing specialist modules. There are other useful methods out there in addition to the list above, but the above are the most useful ones. See the NVDA source code documentation for other methods, or see the examples below on how these methods and others are used throughout the life of an add-on.
es: Los módulos sin extensión .py son directorios que contienen módulos especializados. Hay otros métodos útiles por ahí, además de la lista anterior, pero los anteriores son los más útiles. Consulta la documentación del código fuente de NVDA para ver otros métodos, o mira los ejemplos que aparecen a continuación para ver cómo se utilizan estos métodos y otros durante la vida de un complemento.

source: ### Example 1: am I on the right app where the focus is located?
es: ### Ejemplo 1: ¿Estoy en la aplicación correcta donde se encuentra el foco?

source: The below code checks whether the navigator object is located somewhere on the same app or not.
es: El siguiente código verifica si el navegador de objetos e encuentra en algún lugar de la misma aplicación o no.

source: The `api.getNavigatorObject()` function returns the current navigator object, the object you are interested in as opposed to focused object. Each NVDA object includes `appModule` member which records on which app an object is located.
es: La función `api.getNavigatorObject ()` devuelve el objeto del navegador actual, el objeto que te interesa en lugar del objeto enfocado. Cada objeto de NVDA incluye un miembro `appModule` que registra en qué aplicación se encuentra un objeto.

source: ### Example 2: Display a message on a browse mode document
es: ### Ejemplo 2: Mostrar un mensaje en un documento en modo exploración

source: In NVDA 2015.2 and later, it became possible to display a message on a browse mode window so people can use browse mode commands to review the message content. The below code displays "Hello world" on a document window.
es: Desde NVDA 2015.2 y posterior, fue posible mostrar un mensaje en una ventana del modo de exploración para que la gente pueda utilizar las órdenes del modo de exploración para revisar el contenido del mensaje. El siguiente código muestra"Hola mundo" en la ventana de un documento.

source: ui.browsableMessage("Hello World!", isHtml=False)
es: ui.browsableMessage("Hola Mundo!", isHtml=False)

source: The isHtml flag tells NVDA to treat the message as an HTML text.
es: La bandera isHtml indica a NVDA que trate el mensaje como un texto HTML.

source: ### Example 3: Announce the automation ID of a UIA object
es: ### Ejemplo 3: Anunciar el ID de automatización de un objeto UIA

source: In UI Automation, automation ID is used to identify different screen elements. The following code displays this information on a browsable window.
es: En UI Automation, el ID de automatización se utiliza para identificar diferentes elementos de pantalla. El siguiente código muestra esta información en una ventana navegable.

source: ### Example 4: Send keystrokes
es: ### Ejemplo 4: Enviar pulsaciones de teclas

source: You can ask NvDA to send specific keystrokes by instantiating a keyboard gesture object.
es: Puedes pedirle a NVDA que envíe pulsaciones de teclas específicas instanciando un objeto de gesto de teclado.

source: ### Example 5: Stop speech whenever screen content changes if dynamic content change announcement is off
es: ### Ejemplo 5: Detener la voz cada vez que cambie el contenido de la pantalla si el anuncio de cambio de contenido dinámico está desactivado

source: The below code is a handler for a name change event that stops speech whenever screen content changes if dynamic content change announcement is off.
es: El código que aparece a continuación es un controlador para un evento de cambio de nombre que detiene la voz siempre que el contenido de la pantalla cambie si el anuncio de cambio de contenido dinámico está desactivado.

source: This is just a sample of what various NVDA modules and functions can do in your add-on. We'll tour add-on components and meet more functions throughout this guide.
es: Esto es sólo una muestra de lo que pueden hacer varios módulos y funciones de NVDA en tu complemento. Recorreremos los componentes complementarios y realizaremos más funciones a lo largo de esta guía.

source: ## Add-on module components and development tips
es: ## Componentes del módulo de un complemento y consejos de desarrollo
