Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/ReleaseProcess.po
Languages: es

source: # Release Process
es: # El proceso de liberación de versiones

source: This document provides rough guidelines for the process of developing NVDA releases. All current and potential developers and translators should read and follow this document. These guidelines may be broken under special circumstances. Any concerns should be discussed with the lead developers: Mick Curran (@michaelDCurran) and Reef Turner (@feerrenrut).
es: Este documento ofrece pautas generales para el desarrollo de versiones de NVDA. Todos los desarrolladores y traductores, tanto actuales como aquellos que potencialmente puedan serlo, deberían leer y seguir este documento. Estas pautas pueden romperse en circunstancias especiales. Cualquier detalle relacionado con este documento debe discutirse con los desarrolladores principales: Mick Curran (@MichaelDCurran) y Reef Turner (@feerrenrut).

source: ## Release Workflow
es: ## Flujo de trabajo de versiones

source: This is the general release workflow. Information for specific community groups is provided in later sections. The production of a release consists of the following:
es: Este es el flujo de trabajo general de publicación de versiones. En las siguientes secciones se ofrece información para grupos específicos de la comunidad. La producción de una liberación consta de lo siguiente:

source: 1. Development Phase
es: 1. Fase de desarrollo

source: - Development is done in parallel to the release process for the prior version. E.G. NVDA 2020.2 is in development while NVDA 2020.1 is going through the Release Phase
es: - El desarrollo se hace en paralelo con el proceso de liberación de la versión anterior. Por ejemplo, NVDA 2020.2 se encuentra en desarrollo mientras NVDA 2020.1 se encuentra en fase de liberación

source: 1. Release Phase
es: 2. Fase de liberación

source: - Final testing, and translations work prior to release.
es: - Pruebas finales y trabajos de traducción previos a la liberación.

source: ### Development phase
es: ### Fase de desarrollo

source: * Contributions are made according to the [For Developers](#for-developers) section
es: * Las contribuciones se hacen siguiendo las especificaciones de la sección "Para desarrolladores" de este documento

source: * Once a pull request has been reviewed and approved by at least one NVDA Collaborator and all build checks have passed, a lead developer will make a final commit to the pull request which updates `changes.t2t`, and then will squash merge the pull request into master.
es: * Una vez que una solicitud de cambio ha sido revisada y aprobada por al menos un colaborador de NVDA y todas las comprobaciones de compilación se han superado, un desarrollador principal hará un commit final a la solicitud de cambio que actualice `changes.t2t`, y después mezclará la solicitud de cambio en master.

source: * If the merging of a pull request to `master` causes any build checks on `master` to fail, the pull request is reverted without question. This is however unlikely to be an issue as build checks on the pull request itself must have already passed.
es: * Si la mezcla de una solicitud de cambios en `master` causa que falle cualquier comprobación de compilación en `master`, la solicitud se revierte sin preguntar. Sin embargo, esto probablemente no será un problema, ya que las comprobaciones de compilación en la solicitud en sí deberían haberse superado.

source: * If a merged pull request has been identified as causing a regression, new bug, or does not work as originally reported, the pull request may be reverted at the discretion of the lead developers. Reasons in favor of not reverting the pull request may be:
es: * Si una solicitud de cambios mezclada se ha identificado como causante de un fallo nuevo, una regresión, o no funciona como se informó originalmente, los desarrolladores principales pueden revertir la solicitud. Las razones a favor de no revertir la solicitud de cambios pueden ser:

source: * The pull request was submitted by an active collaborator who is likely to follow up with a suitable pull request to address the issues.
es: * La solicitud de cambios fue enviada por un colaborador activo y se sabe con certeza que volverá con otra solicitud de cambios para solucionar los problemas.

source: * The bug is trivial enough to be fixed by a collaborator.
es: * El fallo es suficientemente trivial como para que un colaborador lo solucione.

source: * Automatic 'alpha snapshots' are made available to the public for very early testing. See [For Testers](#for-testers)
es: * Las 'versiones de desarrollo Alpha' se ponen a disposición del público para realizar pruebas en una fase muy temprana. Consulta la sección "Para evaluadores" de este documento

source: ### Release phase
es: ### Fase de liberación

source: The release phase is intended to refine the release, with testing from wider audiences, and incorporated translations.
es: La fase de liberación está destinada a refinar la liberación, con pruebas de audiencias extensas, ytraducciones incorporadas.

source: - RC: 1 week.
es: - RC: una semana.

source: - When issues are encountered, subsequent RC's may take another week at the discretion of lead developers.
es: - Si se encuentran problemas, los desarrolladores pueden decidir liberar otras RC durante una semana cada una.

source: #### Beta builds
es: #### Compilaciones beta

source: * A commit without any known serious issues, will be selected from the 'master' branch and merged into 'beta', this draws the line for features included in the release.
es: * Se selecciona un commit sin problemas serios conocidos de la rama 'master' y se mezcla en 'beta', dibujando la línea límite con las características que incluirá esa versión.

source: - This commit will have been on `master` and thus, in 'alpha builds' for at least 2 weeks and can now be considered beta quality.
es: - Este commit habrá estado en `master` y, por tanto, en 'versiones Alpha' al menos 2 semanas y ya se puede considerar que tiene calidad beta.

source: * A tagged 'beta release' will be created for wider testing.
es: * Se creará una 'versión beta' etiquetada para pruebas más extensas.

source: * New pull requests may be now considered for squash merging straight to beta.
es: * Se puede plantear mezclar las nuevas solicitudes de cambio directamente en beta.

source: - If addressing regression introduced in this release.
es: - Si corrigen regresiones introducidas en esta versión.

source: - If addressing a bug in a "must have" feature for this release.
es: - Si corrigen un fallo en una característica que esta versión "debe tener".

source: - If addressing a critical Operating System change out of our control.
es: - Si corrigen un cambio crítico en el sistema operativo fuera del control de NV Access.

source: * As appropriate new tagged beta releases will be published.
es: * Se publicarán nuevas versiones etiquetadas como beta si se considera apropiado.

source: * As necessary `beta` will be merged back into master.
es: * Se mezclará `beta` en master si es necesario.

source: - For critical pull requests or translation merges.
es: - Si hay solicitudes de cambios críticas o se mezclan traducciones.

source: * If a merged pull request that reached beta has been identified as causing a regression, new bug, or does not work as originally reported:
es: * Si una solicitud de cambios que llega a beta se identifica como causante de una regresión, un nuevo fallo o no funciona como se había indicado originalmente:

source: - The pull request may be reverted at the discretion of the lead developers.
es: - Los desarrolladores principales pueden decidir revertir la solicitud de cambios.

source: - It may be fixed by a collaborator if the bug is trivial enough.
es: - Un colaborador podría corregirla si el fallo es suficientemente trivial.

source: - Once a PR is reverted from `beta`, a replacement PR is very unlikely to get into the current release.
es: - Si se revierte una solicitud de cambios en `beta`, es más que probable que las solicitudes de cambio que la sustituyan no entren en la versión actual.

source: ### Translatable String Freeze
es: ### Congelación de cadenas traducibles

source: - The beta branch will enter a translatable string freeze.
es: - La rama beta entrará en una congelación de cadenas traducibles.

source: - No changes to text strings that affect translations are allowed. Minor spelling or grammatical fixes may be made to documentation files, but `gettext` strings in the code should not be changed at all.
es: - No se permiten cambios en las cadenas que afecten a las traducciones. Se pueden hacer pequeñas correcciones gramaticales y ortográficas en los archivos de documentación, pero no se deben alterar las cadenas `gettext` del código.

source: * Only critical bug fixes and translation updates should be committed to the beta branch at this stage. Otherwise the translation period will need to be extended by an appropriate amount of time.
es: * Sólo se deben enviar a la rama beta actualizaciones de traducciones y solucionar pequeños errores en esta fase. De lo contrario, se debe extender el periodo de traducción durante una cantidad adecuada de tiempo.

source: ### Release Candidate
es: ### Candidata a liberación (release candidate)

source: * After the translatable string freeze, the "rc" branch will be created based on the beta branch.
es: * Después de la congelación de cadenas traducibles, se actualizará la rama "rc" basándose en la rama beta.

source: * The first release candidate will immediately be released from the `rc` branch.
es: * Se liberará la primera versión candidata inmediatamente desde la rama `rc`.

source: * After this, only critical bug fixes should be committed to the `rc` branch.
es: * Después de esto, sólo se pueden enviar commits a la rama `rc` para solucionar problemas muy graves.

source: * Subsequent release candidates may be released.
es: * Pueden publicarse más versiones candidatas.

source: * The final release can only be made if there have been no significant changes and at least 1 week since the last release candidate.
es: * La versión final sólo puede crearse si no ha habido cambios significativos durante al menos una semana desde la última versión candidata.

source: ### Representation on GitHub
es: ### Representación en GitHub

source: * For most items, an issue will be filed and discussed before a pull request is submitted.
es: * Para la mayoría de elementos, se abrirá una incidencia y se discutirán los cambios antes de enviar una solicitud de cambios.

source: * If priority should be given to an issue for inclusion in a specific release, its milestone should be set to the appropriate release milestone (e.g. 2014.4).
es: * Si se debería dar prioridad a una incidencia para que se incluya en una versión específica, su hito (milestone) debe establecerse a la versión deseada (por ejemplo, 2014.4).

source: * Once a pull request is squash merged to the master branch, the milestone for the issue (if any) and pull request should be set to the next release milestone (e.g. 2013.2) and it should be closed as fixed.
es: * Una vez se mezcle una solicitud de cambios en la rama master, el hito para la incidencia (si lo hay) y el de la solicitud de cambios deberían establecerse en el hito de la siguiente versión (por ejemplo, 2013.2) y el problema debería cerrarse y marcarse como resuelto.

source: * Issues/pull requests for bug fixes for an rc should have their milestone set to the relevant release (e.g. 2013.2).
es: * Las incidencias y solicitudes de cambio para arreglar fallos en una versión candidata deberían tener el hito de dicha versión (por ejemplo, 2013.2).

source: ### Scheduled Releases
es: ### Programación de liberaciones

source: * In the past NVDA has been released 4 times per year. This is not expected to change drastically. The exact date for each release will be determined by the lead developers.
es: * En el pasado, se han liberado versiones de NVDA 4 veces al año. No se espera que esto cambie drásticamente. La fecha exacta para cada liberación será determinada por los desarrolladores principales.

source: ### Maintenance Release
es: ### Versiones de mantenimiento

source: * Under rare circumstances, a maintenance release (e.g. 2013.1.1) may be made.
es: * Bajo extrañas circunstancias, se puede crear una versión de mantenimiento (por ejemplo, 2013.1.1).

source: * A maintenance release may only include fixes for crashes and major security issues.
es: * Una versión de mantenimiento sólo puede incluir solución a fallos muy graves o problemas de seguridad.

source: * Maintenance releases are made from the `rc` branch.
es: * Las versiones de mantenimiento se crean desde la rama `rc`.

source: ## For Developers
es: ## Para desarrolladores

source: * GitHub issues should be created for most issues and discussed prior to starting work or submitting a pull request. This is to give lead developers and the community a chance to give feedback on the approach and prevent disappointment or wasted effort for contributors. However, some trivial changes might not require an issue first. See [[Contributing]] for details.
es: * En la mayoría de los casos, se debe crear una incidencia en GitHub para cada problema existente y discutirla antes de enviar una solicitud de cambios. Esto se hace para dar tanto a los desarrolladores como a la comunidad una oportunidad para hacer comentarios sobre el enfoque y evitar decepciones y esfuerzo desperdiciado de los colaboradores. Sin embargo, aquellos cambios que sean triviales no necesitan una incidencia. Mira el artículo sobre cómo contribuir con NVDA para más información.

source: * Work should be done in topic branches. Including for external contributors.
es: * El trabajo debería hacerse en ramas temáticas. Incluyendo colaboradores externos.

source: - A PR attempting to merge in the master branch of a contributors fork may not get automatic Pull Request builds.
es: - Una solicitud de cambios que intente mezclarse desde la rama master de la bifurcación de un colaborador podría no obtener compilaciones automáticas a partir de ella.

source: * Any relevant documentation should be included in the topic branch.
es: * Se debe incluir cualquier documentación relevante en la rama temática en cuestión.

source: * The topic branch should be submitted for inclusion using a pull request.
es: * La rama temática debería ser enviada para incluirla mediante una solicitud de cambios (pull request).

source: * New commands, drivers, settings, dialogs, etc. must be documented in the User Guide as appropriate.
es: * Las nuevas órdenes, controladores, ajustes, diálogos, etc. deben documentarse en la guía de usuario adecuadamente.

source: * All Pull Requests must follow the Pull Request template provided.
es: * Todas las solicitudes de cambio deben seguir la plantilla proporcionada a tal efecto.

source: * Pull requests must be based on NVDA's master branch.
es: * Las solicitudes de cambio deben basarse en la rama master de NVDA.

source: - A lead developer may specifically requested the pull request be made against `beta` or `rc` in the case of addressing bugs introduced in the current release cycle.
es: - Un desarrollador principal puede pedir específicamente que la solicitud de cambios se haga hacia `beta` o `rc` en caso de que se solucionen fallos introducidos en el ciclo de la versión actual.

source: * Submitted pull requests should not contain edits to `changes.t2t.
es: * Las solicitudes de cambio enviadas no deberían contener cambios en el fichero `changes.t2t`.

source: - Instead, change log entries should be placed in the pull request description, under the appropriate section in the template.
es: - En su lugar, las entradas del registro de cambios deberían situarse en la descripción de la solicitud de cambios, bajo la sección apropiada de la plantilla.

source: * All pull requests submitted must have their "Allow edits from maintainers" checkbox ticked. This is the GitHub default for new pull requests.
es: * Todas las solicitudes de cambio enviadas deben tener la casilla de verificación "Allow edits from maintainers" marcada. Generalmente, este es el caso para todas las nuevas solicitudes de cambio en GitHub.

source: ## For Translators
es: ## Para traductores

source: * All translation should be based on the `beta` branch.
es: * Todas las traducciones deben basarse en la rama `beta`.

source: * Translators should ensure their translation is up to date a day before the translatable string freeze ends in order for it to be included in the upcoming final release. The lead developers will announce the deadline when the freeze begins, if in doubt check the [NVDA-Translations message board](https://groups.io/g/nvda-translations/) for the "language freeze" announcement. Work submitted after this time will not be included in the upcoming release.
es: * Los traductores deben asegurarse de que su traducción esté lista un día antes de que finalice la congelación de cadenas de traducción para que sus cambios sean incluidos en la versión final. Los desarrolladores principales anunciarán la fecha límite cuando la congelación comience, en caso de dudas se puede consultar el [tablón de mensajes de nvda-translations](https://groups.io/g/nvda-translations/) para buscar el anuncio de "congelación de traducciones". Cualquier trabajo que se envíe fuera de plazo no se incluirá en la versión que esté por hacerse.

source: ## For Testers
es: ## Para evaluadores

source: * Pre-release builds for testing (known as "snapshot builds") can be downloaded from the snapshots page at https://www.nvaccess.org/files/nvda/snapshots/.
es: * Se pueden descargar liberaciones previas para pruebas (conocidas como "versiones de desarrollo") desde la [página de versiones de desarrollo](https://www.nvaccess.org/files/nvda/snapshots/).

source: - It lists 'alpha snapshots', 'beta releases', and 'release candidates'.
es: - En ella se listan las 'versiones alpha', 'versiones beta' y las 'candidatas a liberación'.

source: * The `alpha` builds are bleeding edge. It includes code that is being tested for possible inclusion in upcoming releases, but it may not yet be tested much (if at all) and there may be major bugs. Alpha snapshots are created directly from the `master` branch each time it changes (I.E. when a pull request is merged). Although the automated tests pass, these builds have likely had no user testing.
es: * Las compilaciones `alpha` son inestables. Incluyen código que se está probando para su posible incorporación en versiones futuras, pero que no se ha evaluado mucho (o nada) todavía y podría tener problemas importantes. Las versiones alfa se crean a partir de la rama `master` cada vez que ésta cambia (p.ej. cuando se mezcla una solicitud de cambio). Como su nombre sugiere, estas versiones son de calidad alfa. Y aunque pasen las pruebas automáticas, estas versiones no han tenido evaluadores humanos.

source: * 'beta releases' are 'beta' quality. They include all features for the upcoming release that have proved stable in the alpha builds. A feature is considered stable if it has been in 'alpha builds' for at least a week.
es: * Las liberaciones 'beta' están en estado 'beta'. Incluyen código que irá en la próxima versión cuya estabilidad ha sido probada en las compilaciones alpha. Una característica se considera estable si ha permanecido en 'compilaciones alpha' al menos durante una semana.

source: * 'rc releases' in most cases will be identical to the final release.
es: * En la mayoría de casos, las 'liberaciones RC' serán idénticas a la versión final.
