Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/spladdoninternals.po
Languages: es

source: Here is a list of steps Studio app module performs when it is about to leave this world:
es: Aquí hay una lista de pasos que sigue el módulo de aplicación de Studio cuando está a punto de abandonar este mundo:

source: 1. The "terminate" method is called. Just like the startup (constructor) routine, this method first calls the terminate method defined in the default app module, which closes handles and performs other closing routines.
es: 1. Se llama al método "terminate". Al igual que el procedimiento de inicialización (constructor), este método primero llama al método terminate definido en el módulo de aplicación por defecto, que cierra manejadores y realiza otros procedimientos de cierre.

source: 2. Calls splconfig.terminate() function to save add-on settings and perform shutdown routines for some features. This function goes through following steps:
es: 2. Se llama a la función splconfig.terminate() para guardar los ajustes del complemento y realizar tareas de apagado de algunas características. Esta función sigue los siguientes pasos:

source: 1. In add-on 7.0, if update check timer is running, the timer is told to stop, and update metadata is copied back to normal profile. This step is gone in 19.01.
es: 1. En el complemento 7.0, si el temporizador de búsqueda de actualizaciones está funcionando, recibe la orden de detenerse, y se copian los metadatos de actualización de vuelta en el perfil normal. Este paso se elimina en la versión 19.01.

source: 2. Starting with add-on 18.07, active SPL component is unregistered via splconfig.closeConfig function. If there are other components running, the below steps will not occur, otherwise add-on settings will be closed.
es: 2. Empezando con el complemento 18.07, se elimina el componente activo del registro mediante la función splconfig.closeConfig. Si hay otros componentes en ejecución, los siguientes pasos no ocurrirán, y en cualquier otro caso las opciones del complemento se cerrarán.

source: 3. Unless disabled through flags in 17.10, profiles are saved (beginning with normal profile) to disk if and only if profile-specific settings were changed (an online cache used for storing profile settings when they are loaded is kept for this purpose). This step will not occur if an in-memory version of normal profile is in use or other SPL components are active. The online profile cache is gone in 21.10.
es: 3. A menos que se desactive con indicadores en 17.10, se guardan los perfiles (empezando con el perfil normal) en disco si y sólo si se cambian ajustes específicos del perfil (con este propósito se conserva una caché en línea usada para almacenar ajustes de los perfiles cuando estos se cargan). Este paso no ocurrirá si está en uso una versión en memoria del perfil normal o hay otros componentes de SPL activos. La caché de perfiles en línea ya no está en 21.10.

source: 4. If there is an instant switch profile defined, this is recorded in the normal profile, otherwise it is removed from the profile database.
es: 4. Si hay un perfil de cambio instantáneo definido, este se registra en el perfil normal, de cualquier otro modo se elimina de la base de datos de perfiles.

source: 5. Once all profiles are saved, various flags, active profile and config pool is cleared.
es: 5. Una vez se guardan todos los perfiles, se limpian diversos indicadores, el perfil activo y el contenedor de configuración.

source: 6. For add-on 5.x and earlier, there is only one broadcast profile to worry about, and this profile is saved at this point.
es: 6. Para el complemento 5.x y anteriores, hay sólo un perfil de emisión del que preocuparse, y este perfil se guarda en este punto.

source: 7. These steps are part of splconfig.SPLConfig.save method in add-on 8.0 and later.
es: 7. Estos pasos son parte del método splconfig.SPLConfig.save en el complemento 8.0 y posteriores.

source: 3. In 17.12 and later, NVDA notifies registered handlers for app terminate action. As noted above, this will cause add-on dialogs to close without saving settings.
es: 3. En 17.12 y posteriores, NVDA notifica a los manejadores registrados la acción de finalización de aplicación. Como se explica arriba, esto causará que los diálogos del complemento se cierren sin guardar los ajustes.

source: 4. NVDA then attempts to remove StationPlaylist Add-on Settings entry from NVDA's preferences menu, then various maps used by Studio app module (such as Cart Explorer map) are cleared.
es: 4. A continuación NVDA intenta eliminar la entrada de ajustes del complemento de SPL del menú de preferencias de NVDA, después se limpian diversos mapas usados por la aplicación Studio (como el mapa del explorador cart).

source: 5. An important task is cleaning up objects cache used by some SPL Assistant commands, as cached information (specifically, objects) will point to something else next time Studio starts (without restarting NVDA), which is dangerous.
es: 5. Una tarea importante es limpiar las cachés de objetos de la aplicación usada por algunas órdenes del asistente de SPL, ya que la información en caché (concretamente objetos) apuntará a un lugar distinto la próxima vez que se inicie Studio (sin reiniciar NVDA), lo que supone un peligro.

source: 6. As the app module is laid to rest, the window handle value for Studio window is cleared. This is a must, as the handle will be different next time Studio runs. At this point, NVDA removes splstudio (Studio app module) from list of app modules in use.
es: 6. Como el módulo de aplicación se sienta a descansar, el valor del manejador de ventana para la ventana de Studio se limpia. Esto es obligatorio, ya que el manejador será diferente la próxima vez que se inicie Studio. En este punto, NVDA elimina splstudio (el módulo de aplicación de Studio) de la lista de módulos de aplicación en uso.

source: ### Add-on updates: updating to latest and greatest version
es: ### Actualizaciones del complemento: actualizar a la última y más fantástica versión

source: Note: this feature, dubbed "standalone add-on update", is gone in 19.01, although the mechanism behind it is documented here for sake of completeness. Standalone add-on update refers to using SPL Assistant to check for updates from Studio.
es: Nota: esta función, reciemtemente llamada "actualización independiente del complemento", se ha ido en la versión 19.01, aunque el mecanismo que hay tras ella se documenta aquí para dar completitud. La actualización independiente hace referencia a usar el asistente de SPL para buscar actualizaciones desde Studio.

source: In add-on 7.0 and later (until 18.12), it is possible to update to the latest version of the add-on by using add-on update check facility. This is done by connecting to a server where the update add-on files are stored.
es: En el complemento 7.0 y posteriores (hasta la versión 18.12), es posible actualizar a la última versión del complemento usando la característica de comprobación de actualizaciones del complemento. Esto se hace conectando a un servidor donde se alojan los archivos de actualización del complemento.

source: The SPL add-on uses a combination of urllib library and update channels (explained later) to fetch the needed update metadata. The user can tell the add-on to check for updates automatically or one can perform this check manually.
es: El complemento SPL usa una combinación de la biblioteca urllib y canales de actualización (explicados más tarde) para recuperar los metadatos necesarios de actualización. El usuario puede decirle al complemento que busque actualizaciones automáticamente o puede comprobarlas de forma manual.

source: The update check is performed as follows:
es: La búsqueda de actualizaciones se hace de la siguiente manera:

source: 1. If the add-on is told to check for updates, the Studio app module constructor will start a timer whose purpose is to call a function when it is time to check for an update.
es: 1. Si le decimos al complemento que busque actualizaciones, el constructor del módulo de aplicación de Studio iniciará un temporizador cuyo propósito es llamar a una función cuando sea hora de buscar una actualización.

source: 2. If automatic update check is enabled, the update manager (splconfig.updateInit) will determine when the update was checked last. This is done in order to perform update checks every 24 hours.
es: 2. Si está activada la búsqueda automática de actualizaciones, el gestor de actualizaciones (splconfig.updateInit) determinará cuando fue la última vez que se buscaron actualizaciones. Esto se hace para realizar búsquedas de actualizaciones cada 24 horas.

source: 3. Once the timer kicks in (automatic update check is on), the update check function (splupdate.updateChecker) will be called. This function uses two parameters to determine if a status progress tone should be played and to schedule the next update check.
es: 3. Una vez el temporizador llega a su fin (con la búsqueda automática de actualizaciones activada), se llamará a la función de búsqueda de actualizaciones (splupdate.updateChecker). Esta función usa dos parámetros para determinar si debería reproducirse un tono de estado de progreso y para programar la próxima búsqueda de actualizaciones.

source: 4. The update check function first connects to the URL for the current update channel (more on channels at the end of this article) and compares the filename returned by the server. If the file names does not match, the add-on will interpret this as presence of an update and will return a dictionary containing current add-on version, new version (parsed as a regular expression) and URL for the file, and if not, it returns nothing.
es: 4. La función de búsqueda de actualizaciones primero se conecta a la URL del canal de actualizaciones actual (más sobre canales al final de este artículo) y compara el nombre de archivo devuelto por el servidor. Si los nombres de archivo no encajan, el complemento interpretará esto como que hay una actualización disponible y devolverá un diccionario que contiene la versión actual del complemento, la nueva versión (extraída de una expresión regular) y la URL del archivo, y si no, no devuelve nada.

source: 5. If a new version is available and if the user said "yes" to update prompt, the update metadata (update timestamp) will be cached to be retrieved by the app module later.
es: 5. Si hay una nueva versión disponible y el usuario ha dicho "Sí" a la pregunta de actualización, los metadatos de la actualización (sello de actualización) se guardarán para que el módulo de aplicación los consulte más tarde.

source: 6. This process repeats if automatic check is enabled (a timer will be set to call this function again after 24 hours).
es: 6. Este proceso se repetirá si la búsqueda automática está activada (se creará un temporizador para llamar otra vez a esta función en 24 horas).

source: In case of a manual update check (described in SPL Assistant layer section), apart from not using a timer and stopping an update check timer temporarily (if needed), it will go through steps 3 through 5 from above.
es: En el caso de una búsqueda manual de actualizaciones (descrita en la sección de la capa del asistente de SPL), aparte de no usarse un temporizador y detener el temporizador de búsqueda de actualizaciones automática temporalmente (si es necesario), se harán los pasos del 3 al 5 explicados arriba.

source: ## Time announcements, alarms and adjusting basic settings
es: ## Anuncios de tiempo, alarmas y modificación de ajustes básicos

source: Now that we know how Studio app module is born and dies, it is time for us to look at what happens while Studio is in use, and we'll start with how the add-on announces time, work with alarms and uses basic settings.
es: Ahora que sabemos cómo nace y muere el módulo de aplicación de Studio, es el momento para que miremos qué pasa mientras Studio está en uso, y empezaremos por ver cómo anuncia la hora este complemento, cómo trabaja con las alarmas y usa ajustes básicos.

source: ### Time announcement routines: a tale of four brothers
es: ### Procedimientos de anunciado de tiempo: un cuento de cuatro hermanos

source: SPL Studio app module for NVDA comes with four time announcement commands. These are elapsed time, remaining time, broadcaster time and complete time including seconds. The first two uses Studio API to obtain needed information, while others use a combination of Python routines and Windows API functions.
es: El módulo de aplicación de SPL Studio para NVDA viene con cuatro órdenes de verbalización de tiempo. Estas son tiempo transcurrido, tiempo restante, hora del locutor y hora completa incluyendo segundos. Los dos primeros usan la api de Studio para obtener la información necesaria, mientras que los otros usan una combinación de procedimientos Python y funciones de la api de Windows.

source: Three of these routines are assigned to commands (sometimes termed gestures). These are:
es: Tres de estos procedimientos tienen órdenes asignadas (a veces llamadas gestos). Estas son:

source: * Control+Alt+T: Remaining time
es: * Ctrl+alt+t: tiempo restante

source: * Alt+Shift+T: Elapsed time
es: * Alt+shift+t: tiempo transcurrido

source: * NVDA+Shift+F12: Broadcaster time
es: * NVDA+shift+f12: tiempo del locutor

source: One can then use Input Gestures dialog (part of NVDA screen reader) to change them or assign a command to complete time routine.
es: Se puede usar el diálogo de gestos de entrada (parte del lector de pantalla NVDA) para cambiarlas o asignar una orden a la función de hora completa.

source: ### A step sideways with studioAPI function: A central Studio API handler and dispatcher
es: ### Un paso a un lado con la función StudioApi: un manejador y procesador central de la api de Studio

source: Before going any further, it is important to mention a function that not only is used by the first two time routines, but also comes in handy in SPL Assistant and other methods. This function, called studioAPI (part of the main app module and defined as a module-level function in splbase module), sends messages to Studio window and retrieves the value returned. The signature is:
es: Antes de continuar, es importante mencionar una función que no sólo usan los dos primeros procedimientos de tiempo, sino que también es útil en el asistente de SPL y otros métodos. Esta función, llamada studioAPI (parte del módulo de aplicación principal y definida como una función a nivel de módulo), envía mensajes a la ventana de Studio y recupera el valor devuelto. Su cabecera es:

source: With the arguments being the message to be sent to studio window (arg and command). At first glance, it may seem similar to user32's SendMessage function (in fact, that's what the studioAPI function will call), but unlike a typical SendMessage function routine, the Studio handle and message type is automatically filled in, hence only argument (WParem) and command (LParem) are needed.
es: Siendo los argumentos el mensaje que se envía a la ventana de Studio (arg y command). A primera vista, puede parecer similar a la función SendMessage de user32 (de hecho, es a la que llamará la función studioAPI), pero a diferencia del procedimiento típico de la función SendMessage, el manejador de Studio y el tipo de mensaje se rellenan automáticamente, por lo que sólo el argumento (WParam) y la orden (LParam) son necesarios.

source: In older versions of the add-on, studioAPI did more than return results. It called a callback with or without an offset, as well as not return anything. However, the only callback passed in was time announcer (next section), thus in 2018, studioAPI function has been relegated to a thin wrapper around SendMessage function with Studio window handle and message typed filled in.
es: En versiones más antiguas del complemento, studioAPI hacía más que devolver resultados. Llamaba a una función de retorno con o sin desplazamiento, o no devolvía nada. Sin embargo, la única función de retorno que se le pasaba era la de verbalización de tiempo (próxima sección), y por lo tanto en 2018, la función studioAPI ha sido relegada a una delgada envoltura alrededor de la función SendMessage con el manejador de la ventana de Studio y el tipo de mensaje rellenados.

source: ### First applications of studioAPI function: Announcing elapsed and remaining times
es: ### Primeras aplicaciones de la función studioAPI: verbalización de tiempo transcurrido y restante

source: When you press Control+Alt+T or Alt+Shift+T to hear remaining or elapsed time, the script will first check if you are in the main Playlist Viewer, and if so, will call studioAPI function with correct arguments and commands, the result then being fed to announceTime function. In fact, the only differences are argument that is used and the error message.
es: Cuando pulses ctrl+alt+t o alt+shift+t para escuchar el tiempo transcurrido o el restante, el script primero comprobará si estás en el visor principal de listas de reproducción, y si es así, llamará a la función studioAPI con los argumentos correctos y órdenes, devolviendo el resultado a la función announceTime. De hecho, las únicas diferencias son el argumento que se usa y el mensaje de error.

source: ### Broadcaster time: Simulating Studio's broadcaster clock
es: ### Hora del locutor: simulando el reloj del locutor de Studio

source: When you listen to radio shows, you may hear messages such as, "five minutes to two" or "ten minutes past five". This announcement is called broadcaster time.
es: Cuando escuchas programas de radio, puedes oír mensajes como, "Cinco minutos para las dos" o "Son las cinco y diez". Este anuncio se llama hora del locutor.

source: Studio does display broadcaster clock. However, because it is in the middle of the screen, one has to use object navigation commands to locate it, and this method was used in older add-on releases. This involved locating the foreground window (api.getForegroundObject()) and navigating through a preset direction to arrive at the clock object, and this is still used in some places. However, this was prone to a critical problem: sometimes, the object we're interested in changed positions (a good example was when different builds of Studio 5.10 were released).
es: Studio muestra el reloj del locutor. Sin embargo, como está en medio de la pantalla, hay que usar órdenes de navegación de objetos para ubicarlo, y esto se hacía en versiones antiguas del complemento. Esto implicaba ubicar la ventana en primer plano (api.getForegroundObject()) y navegar en una dirección prestablecida para llegar al objeto del reloj, y esto todavía se usa en algunos lugares. Sin embargo, esto era propenso a un problema crítico: en ocasiones, el objeto en el que estamos interesados cambiaba su posición (un buen ejemplo era cuando se publicaban diferentes versiones de Studio 5.10).

source: Recently, this method was abandoned in favor of using Python's time module to obtain current time and convert it into a format that is familiar to broadcasters, thus removing the need to use object navigation. When you press NVDA+Shift+F12, NVDA first fetches local time (time.localtime), then converts this into a format suitable for output. Along the way NVDA tries to emulate how Studio displays broadcaster clock. Recently, a slight modification was made so this process can be used to obtain time left to top of the hour when NVDA+Shift+F12 is pressed twice, with the difference being subtracting local time from top of the next hour. When processing is complete for both cases, NVDA announces the output text.
es: Recientemente, este método se ha abandonado en favor del uso del módulo time de Python para obtener la hora actual y convertirla a un formato que sea familiar para los locutores, por lo tanto eliminando la necesidad de usar navegación por objetos. Cuando pulsas NVDA+shift+f12, NVDA primero recupera la hora local (time.localtime), después la convierte a un formato adecuado para la salida. A lo largo del camino, NVDA intenta emular cómo muestra Studio el reloj del locutor. Recientemente se ha hecho una ligera modificación para que este proceso pueda usarse para obtener el tiempo restante hasta la hora en punto cuando NVDA+shift+f12 se pulsa dos veces, con la diferencia de que la hora local se extrae de la siguiente hora. Cuando el proceso se completa para ambos casos, NVDA verbaliza el texto de salida.

source: ### Complete time: Windows API to the rescue
es: ### Hora completa: la api de Windows al rescate

source: Here, complete time refers to time including seconds. Normally, when you press NVDA+F12, NVDA excludes seconds when announcing time. All that is needed to announce seconds is to change the format argument for kernel32.dll's GetTimeFormatEx (formerly GetTimeFormat) function. With this change, NVDA can announce time including seconds, but in order to use it, you need to assign a command to this feature (some app module commands are not assigned by default).
es: Aquí, hora completa se refiere a la hora incluyendo los segundos. Normalmente, cuando pulsas NVDA+f12, NVDA excluye los segundos al verbalizar la hora. Lo único que hace falta para verbalizar los segundos es cambiar el argumento de formato en la función GetTimeFormatEx (antes GetTimeFormat) de kernel32.dll. Con este cambio, NVDA puede verbalizar la hora incluyendo segundos, pero para usarla, debes asignar una orden para esta función (algunas órdenes del módulo de aplicación no vienen asignadas por defecto).

source: ### Setting alarms
es: ### Establecimiento de alarmas

source: Studio app module comes with three alarms: song outro (ending), intro/ramp, and microphone active alarm. Because we need to talk about some important things when talking about microphone alarm, we'll just tour the routine used when setting up the intro and outro alarms.
es: El módulo de aplicación de Studio viene con tres alarmas: fin de canción (desenlace), introducción y alarma de micrófono activo. Ya que tenemos que hablar de cosas importantes al explicar la alarma del micrófono, recorreremos el procedimiento usado al establecer las alarmas de introducción y fin.

source: Prior to 2020, separate dialogs were used to configure song outro and intro alarm settings. In 2020, these have been combined into one command that opens Alarms category in SPL add-on settings. The mechanism behind the former method is documented for completeness.
es: Antes de 2020, se usaban diálogos independientes para configurar las opciones de sonido de alarma de intro y salida. En 2020, se han combinado en una orden que abre la categoría Alarmas en la configuración del complemento de SPL. El mecanismo detrás del primer método se documenta por motivos de completitud.

source: The following two controls are used to configure song outro and intro settings from Alarms settings (Alt+NVDA+1):
es: Los siguientes dos controles se usan para configurar los ajustes de los sonidos de introducción y salida en las opciones de la alarma (Alt+NVDA+1):

source: * Alarm setting: a spin box (a sping control) is used to adjust alarm values. You can type the alarm value or use up or down arrow to change the value. If an incorrect value is entered, the maximum value (59 for end of track, 9 for song intro) will be used.
es: * Ajuste de alarma: un botón giratorio (un control giratorio) se usa para ajustar los valores de la alarma. Puedes teclear el valor de la alarma o usar flechas arriba y abajo para cambiarlo. Si se introduce un valor incorrecto, se usará el valor máximo (59 para fin de pista, 9 para introducción de canción).

source: * Notification check box: This sets whether alarm will play or not.
es: * Casilla de verificación de notificación: establece si la alarma se reproducirá o no.
