Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/spladdoninternals.po
Languages: es

source: The main reason for using threads is to prevent background tasks from blocking user input (commands will not work when a long running task is run from the main NVDA thread). This is more noticeable when library scan is active as you'll find out soon. For now, let's take a look at microphone alarm.
es: El motivo principal para usar hilos es evitar que las tareas en segundo plano bloqueen la entrada de usuario (las órdenes no funcionarán cuando una tarea que tarda mucho en ejecutarse lo haga desde el hilo principal de NVDA). Esto es más perceptible cuando el escaneo de biblioteca está activo, como podrás comprobar pronto. Por ahora, echemos un vistazo a la alarma del micrófono.

source: #### Microphone alarm: A timer duo waiting to do their work
es: #### Alarma del micrófono: un dúo de temporizadores esperando para hacer su trabajo

source: Simply put, microphone alarm is a timer (akin to a countdown timer). When the microphone becomes active, Studio app module will tell a timer thread to come alive. This timer's only job is to play the alarm sound and display a warning message, and it will wait a while (microphone alarm value in seconds; for example, five seconds).
es: En pocas palabras, la alarma de micrófono es un temporizador (un temporizador de cuenta atrás). Cuando el micrófono se pone activo, el módulo de aplicación de Studio hará que un hilo temporizador venga a la vida. La única misión de este temporizador es reproducir el sonido de alarma y mostrar un mensaje de aviso, y esperará un rato (valor de la alarma del micrófono en segundos; por ejemplo, cinco segundos).

source: The master switch which flips the microphone alarm timer is:
es: El interruptor maestro que hace girar al temporizador de la alarma del micrófono es:

source: Where "micAlarm" denotes how long this timer will wait and the second argument is the task to be performed (messageSound function). If microphone alarm is off (value is 0), this switch will be left alone forever (turned off until you enable the alarm by specifying a value above 0).
es: Donde "micAlarm" indica cuánto tiempo esperará el temporizador y el segundo argumento es la tarea a realizar (función messageSound). Si la alarma del micrófono está apagada (su valor es 0), este interruptor quedará solo para siempre (apagado hasta que actives la alarma especificando un valor superior a 0).

source: However, microphone alarm is more than a timer: a unique feature of timers is responding to events (a cancel event, that is). When the microphone becomes active, microphone alarm timer will become active. If you happen to turn off your microphone before microphone alarm kicks in, NVDA instructs microphone alarm to quit (timer is canceled). In other words, the "real" master switch is status change, and one of the activities performed by name change event handler (event_nameChange function described earlier) is to manage microphone alarm timer via doExtraAction method (in fact, microphone alarm and Cart Explorer are managed from this function).
es: Sin embargo, la alarma del micrófono es más que un temporizador: una función única de los temporizadores es responder a eventos (un evento de cancelación). Cuando el micrófono se activa, el temporizador de la alarma del micrófono se activará con él. Si apagas el micrófono antes de que la alarma del micrófono salte, NVDA ordena a la alarma del micrófono que salga (se cancela el temporizador). En otras palabras, el interruptor maestro "real" es el cambio de estado, y una de las actividades que el manejador de evento de cambio de nombre (función event_nameChange descrita anteriormente) realiza es la de gestionar el temporizador de la alarma del micrófono mediante el método doExtraAction (de hecho, la alarma del micrófono y el explorador cart se gestionan desde esta función).

source: In some cases, NVDA can be told to periodically notify you that microphone is active. If this is the case, NVDA will start a new timer (this time, wx.PyTimer) that'll run a function to do just that periodically after the initial microphone alarm is sounded. Just like the master microphone alarm timer, this time will quit if microphone is turned off.
es: En algunos casos, podemos decirle a NVDA que nos avise periódicamente de que el micrófono está activo. Si este es el caso, NVDA iniciará un nuevo temporizador (esta vez, wx.PyTimer) que ejecutará una función para hacerlo periódicamente después de que suene la primera alarma de micrófono. Al igual que con el temporizador maestro de alarma, este temporizador también se detendrá si el micrófono se apaga.

source: #### Library scan: a unique combination of Studio API and a background thread
es: #### Escaneo de biblioteca: una combinación única de la api de Studio y un hilo en segundo plano

source: When NVDA is told to keep an eye on background library scanning, it calls up another thread to perform this duty. This thread will ask Studio for number of items scanned so far and take appropriate action after scanning is complete (in fact, multiple helper functions are used).
es: Al decirle a NVDA que mantenga vigilado el escaneo de biblioteca en segundo plano, este llama a otro hilo para hacer esta tarea. Este hilo le preguntará a Studio por el número de elementos escaneados hasta ahora y tomará las medidas adecuadas en cuanto el escaneo se complete (de hecho, se usan varias funciones auxiliares).

source: The library scan routine is performed as follows:
es: El procedimiento de escaneo de biblioteca es el siguiente:

source: 1. NVDA will make sure you are not in Insert Tracks dialog (if you are, background library scan routine will not be invoked, as event_nameChange will perform this duty instead).
es: 1. NVDA se asegurará de que no estés en el diálogo de inserción de pistas (si estás ahí, no se invocará el procedimiento de escaneo de la biblioteca en segundo plano, ya que event_nameChange hará lo mismo en su lugar).

source: 2. If you do close Insert Tracks while a scan is in progress, or invoke library scan from SPL Assistant (Shift+R), NVDA will instruct a thread to keep an eye on scan progress in the background(see below for signature) to allow you to use Studio commands and to let you hear scan progress from other programs.
es: 2. Si cierras el diálogo de insertar pistas mientras hay un escaneo en progreso, o invocas el escaneo de biblioteca desde el asistente de SPL (shift+r), NVDA ordenará que un hilo vigile el progreso del escaneo en segundo plano (mira abajo la cabecera) para permitirte usar órdenes de Studio y dejarte oír el progreso del escaneo desde otros programas.

source: 3. Library scan thread will ask Studio to return number of items scanned (this is done every second) and will store the result for record keeping.
es: 3. El hilo de escaneo de biblioteca pedirá a Studio que le devuelva el número de elementos escaneados (lo hace cada segundo) y almacenará el resultado para llevar un registro.

source: 4. After the scan result is obtained, the thread will check where you are in studio, and if you are back in Insert Tracks dialog, the thread will terminate (see step 1).
es: 4. Después de obtener el resultado del escaneo, el hilo comprobará en qué parte de Studio estás, y si te encuentras de vuelta en el diálogo de inserción de pistas, el hilo finalizará (mira el paso 1).

source: 5. Every five seconds, library scan thread will call a private function (which wants to see how many items were scanned and current library scan announcement setting) to announce library scan results as follows:
es: 5. Cada cinco segundos, el hilo de escaneo de biblioteca llamará a una función privada (que quiere ver cuántos elementos se han escaneado y el ajuste actual de verbalización de escaneo de biblioteca) para anunciar los resultados del escaneo de la biblioteca de la siguiente manera:

source: * If you tell NVDA to announce scan progress, NVDA will say, "scanning" and/or play a beep (if told to do so).
es: * Si le pides a NVDA que verbalice el progreso del escaneo, este dirá "Escaneando" y / o reproducirá un pitido (si así lo tiene indicado).

source: * If NVDA is told to announce scan count, number of items scanned so far will be announced (again with or without a beep).
es: * Si se pide a NVDA que verbalice la cantidad de elementos escaneados, se verbalizarán los que se han analizado hasta ahora (otra vez con o sin pitido).

source: * This reporter function will not be invoked if you tell NVDA to ignore library scan completely or ask it to interupt you only when the overall scan is complete (you can press Alt+NVDA+R to cycle through different library scan announcement settings).
es: * No se invocará a esta función informadora si le dices a NVDA que ignore el escaneo de biblioteca completamente o le pides que te interrumpa sólo cuando el escaneo general se haya completado (puedes pulsar alt+NVDA+r para cambiar rápidamente entre los diferentes ajustes de verbalización de escaneo de biblioteca).

source: 6. Once library scanning is complete (after checking scan result value every second and seeing that the previous scan result and the current one have same values), NVDA will announce scan results (in some cases, number of items scanned will be announced). In Studio 5.10 and later, the library scan counter will not be defined when scan completes, which is more efficient than keeping track of equalities.
es: 6. Una vez el escaneo de la biblioteca se completa (después de comprobar el valor del resultado cada segundo y ver que el resultado del escaneo anterior y el actual tienen el mismo valor), NVDA verbalizará los resultados del escaneo (en algunos casos, se verbalizará el número de elementos escaneados). En Studio 5.10 y versiones posteriores, el contador del escaneo de la biblioteca no estará definido cuando el escaneo se complete, lo que es más eficiente que ir comparando.

source: You can imagine what would have happened if the above operation was not a background task: cannot perform other NVDA commands until library scan is complete, cannot cancel this operation and what not. And this is the signature of the thread that performs the above operation:
es: Te puedes imaginar qué habría pasado si la operación anterior no fuese una tarea en segundo plano: no se podrían ejecutar otras órdenes de NVDA hasta que se completara el escaneo de biblioteca y no se podría cancelar la operación. Esta es la cabecera del hilo que realiza la operación de arriba:

source: libraryScanner = threading.Thread(target=self.libraryScanReporter, args=(_SPLWin, countA, countB, parem))
es: libraryScanner = threading.Thread(target=self.libraryScanReporter, args=(_SPLWin, countA, countB, param))

source: There are important arguments in use: the function (task) to be performed and arguments for this function. The most important argument is the last one: Studio 5.0x and 5.10 expects different arguments when told to report number of items scanned so far.
es: Hay argumentos importantes en uso: la función (tarea) a realizar y los argumentos para esta función. El argumento más importante es el último: Studio 5.0x y 5.10 esperan argumentos diferentes cuando se les pide que informen de los elementos escaneados hasta el momento.

source: Despite limitations of Python's threading routines, if used properly, it can open new possibilities, and you saw some of them above: microphone alarm and background library scan. Use of threads in the Studio app module also allows NVDA to be responsive while using Studio and allows background tasks to be faithful to the tasks at hand. We'll come back to threads when we talk about encoder connection routines. There is a more "magical" feature we'll visit, and this is our next stop on the Add-on Internals: Cart Explorer.
es: A pesar de las limitaciones de los procedimientos de Python para hilos, si se usan adecuadamente, pueden abrir nuevas posibilidades como las que has visto arriba: la alarma del micrófono y el escaneo de la biblioteca en segundo plano. El uso de hilos en el módulo de aplicación de Studio también permite que NVDA sea rápido mientras se utilice Studio y permite que las tareas en segundo plano sean fieles a la tarea que se desempeña a mano. Volveremos a los hilos cuando hablemos de los procedimientos de conexión del codificador. Hay una característica más "mágica" que visitaremos, y es nuestra siguiente parada en el recorrido por el interior del complemento: el explorador cart.

source: ## The magic behind Cart Explorer
es: ## La magia que hay tras el explorador cart

source: A live radio broadcast would not be complete without jingles. This can range from station promotions (often called "promos"), advertisements, jingles to convey the mood of a show, segment jingles and more. Many station automation programs, including StationPlaylist Studio includes facilities to manage jingles (sometimes called carts), including defining a cart to be played when cart keys are pressed, announcing the name of the playing cart and saving specific carts to a safe location.
es: Una emisión de radio en directo no estaría completa sin jingles. Estos pueden ir desde promociones de radio (a veces llamadas "promos"), anuncios, jingles para transmitir el estado de ánimo en un programa, jingles de segmento y más. Muchos programas de automatización de emisoras, incluido StationPlaylist Studio, incluyen formas de gestionar jingles (a veces llamados carts), incluyendo la definición de un cart para que sea reproducido al pulsar las teclas de cart, verbalizar el nombre del cart en reproducción y guardar nuestros carts específicos en una ubicación segura.

source: For blind broadcasters, one of the things they worry is pressing a wrong jingle key by accident, thus script writers were asked to implement a way for broadcasters to learn which carts are assigned to cart keys. As of time of this post, all three screen readers (JAWS for Windows (script author: Brian Hartgen), Window-Eyes (script author: Jeff Bishop), NVDA (script author: Joseph Lee (I, the author of this article)) includes a feature to learn jingle assignments. As this is an article on internals of an NVDA add-on, I'll give you an overview of what happens when you activate and explore cart assignments (in fact, this section was the most interesting and feedback driven portion of the add-on). Along the way you'll learn where Cart Explorer (NVDA's version of cart learn mode) draws its power and why it is very important.
es: Una de las cosas que preocupa a los locutores ciegos es pulsar una tecla de jingle incorrecta por accidente, por lo que se pidió a los desarrolladores de scripts que implementaran una forma para que los locutores aprendieran qué carts están asignados a las teclas cart. En el momento en que escribo este artículo, los tres lectores de pantalla (JAWS for Windows (autor de los scripts: Brian Hartgen), Window Eyes (autor de los scripts: Jeff Bishop) y NVDA (autor de los scripts: Joseph Lee (yo, el autor de este artículo)) incluyen una función para aprender las asignaciones de jingles. Como esta es una serie de artículos sobre el interior de un complemento de NVDA, te daré una descripción de lo que pasa cuando activas y exploras las asignaciones cart (de hecho, esta sección fue la porción más interesante y dirigida por comentarios del complemento). A lo largo del camino aprenderás de dónde coge su poder el explorador cart (la versión de NVDA del modo de aprendizaje de cart) y por qué es muy importante.

source: ### Carts in StationPlaylist Studio
es: ### Carts en StationPlaylist Studio

source: Studio comes in three editions: Demo (same as Pro but for limited time trial), Standard and Pro. The first user visible difference between Standard and Pro is number of cart assignments: Standard can store 48 jingles, while Pro can work with 96 of them.
es: Studio viene en tres ediciones: Demo (igual que la Pro pero funcionando durante un tiempo limitado de prueba), Standard y Pro. La primera diferencia visible para el usuario entre Standard y Pro es la cantidad de asignaciones de cart: la Standard puede almacenar 48 jingles, mientras que la Pro puede trabajar con 96 de ellos.

source: To play jingles, a broadcaster would use Cart Edit Mode Control+T), then assign a hotkey to a file. For Studio Standard, you can assign F1 through F12 by themselves or in combination with Control, Shift or Alt. In Demo and Pro, number row can be assigned (1 through 9, 0, hyphen (-) and equals (=) either by themselves or in combination with Control, Shift or Alt, for a grand total of 96 jingles). Once jingles are assigned, they will appear under cart menus (there are four cart menus, one for standalone keys (called main) and one each for Control, Shift and Alt).
es: Para reproducir jingles, un locutor usaría el modo de edición de cart (ctrl+t), y a continuación asignaría una tecla rápida a un archivo. En Studio Standard, puedes asignar de f1 a f12 por sí mismas o en combinación con ctrl, shift o alt. En Demo y Pro, puede asignarse la fila de números (del 1 al 9, el 0, el guión (-), y el igual (=) bien por sí solos o en combinación con ctrl, shift o alt, para llegar al total de 96 jingles). Una vez los jingles están asignados, aparecerán en los menús de cart (hay cuatro menús de cart, uno para teclas independientes (llamado principal) y uno para control, otro para shift y otro para alt).

source: ### Where does Studio store carts?
es: ### ¿Dónde almacena Studio los carts?

source: Studio's "carts" are housed in Studio installation folder. There are four cart files (called banks) in use: a .cart file for each of the cart banks (main, Shift, Control, Alt). During normal business hours, Studio will work with these four banks unless told by a broadcaster to load carts from a different cart bank file.
es: Los "carts" de Studio se alojan en la carpeta de instalación de Studio. Hay cuatro archivos de cart (llamados bancos) en uso: un archivo .cart por cada uno de los bancos de carts (principal, shift, control, alt). Durante las horas laborables, Studio funcionará con estos cuatro bancos a menos que un locutor cargue otros carts desde un archivo de banco de carts diferente.

source: ### Cart Explorer: my own Summer of Code
es: ### Explorador cart: mi propio verano de código

source: It was a hot day in June 2014 when I sat down to design a way to let broadcasters learn cart assignments. Since I was developing add-on 3.0 back then, I decided that this feature should be a top priority feature to be included in the upcoming release.
es: Era un día caluroso en junio de 2014 cuando me senté a diseñar una forma de que los locutores aprendieran las asignaciones cart. Ya que estaba desarrollando el complemento 3.0 por entonces, decidí que esta característica debería tener la prioridad más alta para incluirla en la liberación que estaba por llegar.

source: When I started writing this feature, the first thing I thought about was its name. I felt "cart learn mode" didn't really convey the picture - after all, I reasoned that broadcasters will use this feature to explore cart assignments. Thus the name "Cart Explorer" was chosen - in effect, when you use this feature, you are browsing jingle assignments in preparation for a show.
es: Cuando empecé a escribir esta característica, la primera cosa en la que pensé fue su nombre. Yo sentía que "Modo de aprendizaje de cart" no representaba adecuadamente el cuadro - después de todo, razoné que los locutores usarán esta característica para explorar las asignaciones de cart. Por tanto, elegí el nombre "Explorador cart" - en efecto, cuando usas esta característica, estás explorando las asignaciones de jingles para prepararte para un programa.

source: Next, I read JAWS script documentation to get a glimpse of how Brian has managed to implement cart learn mode. In JAWS scripts, script settings are stored in the user configuration directory (typically this is %systemdrive%\Users\%username%\AppData\Roaming\Freedom Scientific\JAWS\%JAWSVersion%\Settings\Enu; Brian, please correct me if I'm wrong). A section of this script configuration file is dedicated to carts, and JAWS scripts use a map of key names and cart values to announce cart information while cart learn mode is active.
es: Después, leí la documentación de los scripts de Jaws para hacerme una idea de cómo implementó Bryan el modo de aprendizaje de cart. En los scripts de Jaws, los ajustes de cada script se alojan en la carpeta de configuración del usuario (normalmente esta es %systemdrive%\Users\%username%\AppDate\Roaming\Freedom Scientific\JAWS\%JAWSVersion%\Settings\Esn; Bryan, corrígeme por favor si me equivoco). Una sección de este archivo de configuración del script está dedicada a los carts, y Jaws usa un mapa de nombres de clave y valores de cart para anunciar la información del cart mientras el modo de aprendizaje de carts esté activo.

source: Based on this information, I started writing an ini file parser, seeing that broadcasters would store cart assignments in a configuration database. This was prone to a number of errors, including wrong cart name format, nonexistent cart key assignment, invalid configuration format and others. I once wrote a blog post (on my personal blog) explaining how this worked (times have changed, as you'll see very soon).
es: Basándome en esta información, comencé a escribir un intérprete de archivos ini, viendo que los locutores almacenarían las asignaciones de cart en una base de datos de configuración. Este estaba sujeto a un gran número de errores, incluidos el formato equivocado del nombre del cart, asignación de clave de cart no existente, formato de configuración no válido y otros. Una vez escribí una entrada de blog (en mi blog personal) explicando cómo funcionaba (los tiempos han cambiado, como verás muy pronto).

source: Then I became curious as to how Studio stores its own cart banks, and naturally, I opened the folder where carts were stored and opened each .cart file in Notepad++ (a very handy text editor). From reading the cart bank format (explained below), I thought it might be useful to write a cart bank file parser. Thus I resumed writing Cart Explorer routines, this time incorporating the cart bank format, not forgetting to handle suttle errors, and this is the routine used in add-on releases up to 5.x (6.0 uses a completely different yet related routine, as you'll see).
es: Entonces me entró la curiosidad de cómo guarda Studio sus propios bancos cart y, naturalmente, abrí la carpeta donde se almacenaban los carts y abrí cada archivo .cart en Notepad++ (un editor de texto muy útil). Desde que leí el formato del banco cart (explicado debajo), pensé que podría ser útil escribir un intérprete de archivos cart. Por tanto continué escribiendo los procedimientos del explorador cart, en esta ocasión incorporando el formato del banco cart, sin olvidarme de tener en cuenta los errores, y este es el procedimiento que se usa en versiones del complemento posteriores a la 5.x (la 6.0 usa un procedimiento relacionado pero totalmente diferente, como verás).

source: While writing the first version of Cart Explorer, I realized that this feature needed some real life testing, so I asked a seasoned blind broadcaster to test this feature. We spent a better part of Independence Day writing, debugging and rewriting this routine until we felt satisfied. In the end, our hard work paid off, as you can see in subsequent paragraphs.
es: Mientras escribía la primera versión del explorador cart, me di cuenta de que esta característica necesitaba algunas pruebas en la vida real, por lo que pedí a un locutor ciego profesional que la probara. Invertimos la mejor parte del día de la independencia escribiendo, depurando y reescribiendo este procedimiento hasta que nos sentimos satisfechos. Al final, nuestro duro trabajo fue recompensado, como puedes ver en los siguientes párrafos.
