Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/spladdoninternals.po
Languages: es

source: In graphical user interfaces (GUI's), an object is a more technical term for controls (sometimes called widgets). This includes windows, form fields, links, documents and so on. A control (object) can convey information such as state of the control, location, color and so on (the control contains both visible and internal attributes that can be used by other programs).
es: En las interfaces gráficas de usuario (GUIs), un objeto es un término más técnico para los controles (a veces llamados widgets). Esto incluye ventanas, campos de formulario, enlaces, documentos y demás. Un control (objeto) puede contener información como estado del control, ubicación, color y demás (el control contiene atributos visibles e internos que otros programas pueden usar).

source: In NVDA world, all screen elements (controls) are objects. As such, when dealing with objects, NVDA uses accessibility API's to obtain needed information. To provide a consistent user experience, differences between accessibility API's (IAccessible, UI Automation, Java Access Bridge and so on) are abstracted and provides a mechanism to announce same information across controls implemented using different frameworks. For example, when a check box is checked, NVDA will say "checked"" - NVDA will know if you checked this box because the underlying accessibility API informs NVDA of this change, and the same information is spoken regardless of whether it is dealing with IAccessible, UIA and so on.
es: En el mundo de NVDA, todos los elementos de la pantalla (controles) son objetos. Por tanto, al trabajar con objetos, NVDA usa las apis de accesibilidad para obtener la información necesaria. Para proporcionar una experiencia de usuario consistente, se abstraen las diferencias entre las distintas apis de accesibilidad (IAccessible, UI Automation, Java Access Bridge y otras), y se ofrece un mecanismo para verbalizar la misma información a través de controles implementados en distintos marcos de trabajo. Por ejemplo, cuando se marca una casilla de verificación, NVDA dice "marcado" - NVDA sabrá que has marcado esta casilla porque la api de accesibilidad subyacente informa a NVDA de este cambio, y la misma información se verbaliza sin importar que esté tratando con IAccessible, UIA o cualquier otro.

source: Currently, NVDA can work with IAccessible, User Interface Automation (UIA), Java Access Bridge (JAB) and others (WAI ARIA is supported). Support modules for these API's lives in source/NVDAObjects directory of the NVDA Core source code.
es: Actualmente, NVDA puede trabajar con IAccessible, User Interface Automation (UIA), Java Access Bridge (JAB) y otras (se soporta WAI Aria). Los módulos de soporte para estas apis se encuentran en el directorio source/NVDAObjects del código fuente principal de NVDA.

source: ### Overlay classes: Customizing built-in objects
es: ### Clases superpuestas: personalización de objetos incorporados

source: If NVDA was limited to using its own object handlers, we would be limited to information that is correctly exposed by accessibility API's (no app modules at all). But why is that NVDA can announce extra information for some controls and comes with various app modules for different applications? This is done through overlay classes - custom objects and their handlers built on top of API classes (built-in objects).
es: Si NVDA estuviera limitado a usar sus propios manejadores de objetos, estaríamos limitados a la información que exponen correctamente las apis de accesibilidad (no habría módulos de aplicación). ¿Pero por qué NVDA puede verbalizar información extra de algunos controles y viene con diversos módulos de aplicación para diferentes aplicaciones? Esto se hace mediante clases de superposición - objetos personalizados y sus manejadores construidos sobre clases de la api (objetos incorporados).

source: In essence, overlay classes are subclasses of stable API classes (subclasses are specialist classes deriving (inheriting) from one or more parent classes). This allows custom (overlay) objects to provide extra properties, ranging from control-specific commands to removing certain properties. For example, here's how NVDA's way of announcing toast notifications (Windows 8.x and 10) works:
es: En esencia, las clases de superposición son subclases de clases estables de la api (las subclases son clases especializadas que derivan (heredan) de una o más clases padre). Esto permite a los objetos personalizados (superpuestos) proporcionar propiedades extra, desde órdenes específicas para un control a eliminación de ciertas propiedades. Por ejemplo, así es como funciona NVDA al verbalizar las notificaciones emergentes (Windows 8.x y 10):

source: 1. Toasts are notifications from apps, and they are UIA objects (NVDAObjects.UIA.Toast).
es: 1. Las notificaciones emergentes vienen de las aplicaciones, y son objetos UIA (NVDAObjects.UIA.Toast).

source: 2. When events fired by toasts are received by NVDA, it'll check to make sure it is dealing with toast notifications.
es: 2. Cuando NVDA recibe los eventos disparados por las notificaciones emergentes, este se asegurará de que está trabajando exactamente con este tipo de notificaciones.

source: 3. When NVDA is dealing with toasts, it'll perform what it is told to do by toast objects (announce toasts provided by "report help balloons" is checked from Object Presentation dialog).
es: 3. Cuando NVDA trate con notificaciones emergentes, hará lo que le hayan dicho que haga los objetos de notificación emergente (verbalizar las notificaciones sólo si está marcada la casilla "Anunciar globos de ayuda" en el diálogo Presentación de objetos).

source: ### Why do objects and overlay classes matter in Studio app module?
es: ### ¿Por qué son importantes los objetos y las clases de superposición en el módulo de aplicación de Studio?

source: Some readers might ask this question after reading the above section on overlay classes. I had to introduce overlay classes because they are important in Studio app module: track items in playlist Viewer are overlay classes. In fact, there are at least three of them: an abstract base class representing track items for studio and other apps (appModules.splstudio.SPLTrackItem), a generic representation of Studio track item (appModules.splstudio.SPLStudioTrackItem), and a playlist viewer (main window) track item (appModules.splstudio.StudioPlaylistViewerItem; in case of playlist viewer item class, it derives its power from track item class for Studio, which in turn is powered by abstract SPL track item powered by IAccessible).
es: Algunos lectores podrían hacerse esta pregunta después de leer la sección de arriba sobre las clases de superposición. Tenía que introducir las clases de superposición porque son importantes en el módulo de aplicación de Studio: los elementos de pista en el visor de listas de reproducción son clases de superposición. De hecho, hay al menos tres de ellas: una clase base abstracta que representa elementos de pista para Studio y otras aplicaciones (appModules.splstudio.SPLTrackItem), una representación genérica de un elemento de pista de Studio (appModules.splstudio.SPLStudioTrackItem), y un elemento de pista del visor de listas de reproducción (ventana principal) (appModules.splstudio.StudioPlaylistViewerItem; en el caso de la clase de elemento de pista del visor de listas de reproducción, su poder deriva de la clase de elemento de pista de Studio, que a su vez hereda del elemento de pista abstracto de SPL proporcionado por IAccessible).

source: These classes were born when I started working on Studio 5.10 support in 2014. Because Studio 5.10 uses a different way of showing track properties, I had to come up with a way to take care of them. Adding to the urgency was the fact that Studio 5.10 uses check marks to indicate whether a track is selected for playback (Studio 5.0x and earlier uses check boxes), and when check marks are checked in Studio 5.10, NVDA would not announce newly checked state, fixed by defining a routine to be used when SPACE is pressed (via an overlay class). In addition, initial version of Track Finder (see below) was sensitive to object description changes, I modified it to account for differences between Studio versions.
es: Estas clases nacieron cuando empecé a trabajar en el soporte para Studio 5.10 en 2014. Ya que Studio 5.10 usa una manera diferente para mostrar propiedades de la pista, tuve que trabajar en una manera de procesarlas. A la urgencia se añadía el hecho de que Studio 5.10 usa marcas de verificación para indicar si una pista está seleccionada para reproducción (Studio 5.0x y anteriores usan casillas de verificación), y cuando estas marcas de verificación se marcan en Studio 5.10, NVDA no anuncia el nuevo estado de verificación, esto se arregló creando un procedimiento usado al pulsar espacio (mediante una clase de superposición). Además, la primera versión del buscador de pistas (mira más abajo) era sensible a cambios de descripción de los objetos, la modifiqué para que tuviera en cuenta las diferencias entre versiones de Studio.

source: Then in 2015, when I was designing Track Dial (next section), I thought about scope of this feature. I thought, "if I let this be invoked from everywhere, it could lead to issues such as errors and attempting to use Track Dial from somewhere other than track items". Then I thought, "perhaps I should limit this feature to main playlist viewer at the cost of making sure I identify track items correctly". Given that I had experience with overlay classes and since there was already an overlay class for Studio 5.10 track items, I decided to go with the latter option, which led to defining a new overlay class for Studio 5.0x track items and letting 5.10 track items inherit from this new class.
es: Después, en 2015, cuando estaba diseñando el dial de pista (siguiente sección), pensé en el ámbito de esta característica. Pensé, "Si dejo que se invoque desde cualquier parte, podría crear problemas como errores e intentos de usar el dial de pista desde un lugar distinto a los elementos de pista". Después pensé, "Tal vez debería limitar esta característica al visor de listas de reproducción principal con el coste de identificar los elementos de pista correctamente". Dado que tenía experiencia con clases de superposición y ya que había una clase de superposición para los elementos de pista de Studio 5.10, decidí seguir adelante con la última opción, que desembocó en la definición de una nueva clase de superposición para los elementos de pista de Studio 5.0x y dejando que la clase de los elementos de pista de Studio 5.10 heredara de esta nueva clase.

source: In 2018, as support for Columns Explorer was being worked on for Creator and Track Tool, I decided to overhaul the entire track item class hierarchy. Since track items would use same column navigation routines, it was decided to split SPL 5.0x track item class into two classes: the old track item class, and a new abstract class providing basic services for Studio, Creator and Track Tool track items. Also, in order to support column reordering, SysListView32 class was employed, as it provides a handy routine to retrieve column content for the correct column when columns were rearranged on screen.
es: En 2018, mientras se estaba trabajando en el soporte del explorador de columnas para Creator y la herramienta de pista, decidí revisar la jerarquía completa de clases de elemento de pista. Ya que los elementos de pista usaban los mismos procedimientos de navegación por columnas, decidí dividir la clase de elemento de pista de SPL 5.0x en dos clases: la vieja clase de elemento de pista, y una nueva clase abstracta que proporciona servicios básicos para los elementos de pista de Studio, Creator y la herramienta de pista. Además, para dar soporte al reordenado de columnas, se empleó la clase SysListView32, ya que proporciona un procedimiento útil para recuperar el contenido de una columna en la columna correcta cuando estas se reordenan en pantalla.

source: In 2020, SPL track item overlay classes were reworked. Because base SPL track item class was meant to serve as a blueprint, it became an abstract base class in 2019. What was formerly Studio 5.10 track item class became a specialist class for playlist viewer items, and old Studio 5.0x item class was revived to represent track items found in other parts of Studio such as Insert Tracks dialog. At the same time, column navigation services provided by the SPL track item base class was eliminated in favor of using facilities provided by SysListView32 list item class to provide consistency with NVDA itself and to add column navigation commands for Creator's playlist editor and Remote VT client (prior to this, SPL track item base provided customized column navigation commands). Later, track name and description routines were revised to use SysListView32 routines (see the section on custom column announcement order), which resolved a long-standing problem where track information would not be announced unless "report object descriptions" setting was enabled from NVDA.
es: En 2020, se reconstruyeron las clases de superposición del elemento de pista de SPL. Ya que la clase base del elemento de pista fue concebida para actuar como plantilla, se convirtió en una clase abstracta en 2019. Lo que primero era la clase de elemento de pista de Studio 5.10 se convirtió en una clase especializada para los elementos del visor de listas de reproducción, y la antigua clase para elementos de Studio 5.0x revivió para representar elementos de pista disponibles en otras partes de Studio, como en el diálogo Insertar pistas. Al mismo tiempo, los servicios de navegación por columnas proporcionados por la clase base de elemento de pista de SPL se eliminaron en favor de las funciones proporcionadas por la clase del elemento de lista SysListView32 para proporcionar consistencia con el propio NVDA y añadir órdenes de navegación por columnas en el editor de listas de reproducción de Creator y el cliente Remote VT (antes, la clase base de elemento de pista de SPL proporcionaba órdenes de navegación por columnas personalizada). Posteriormente, se revisaron los procedimientos de nombre de pista y descripción para usar procedimientos de SysListView32 (consulta la sección sobre el anuncio de columnas en orden personalizado), lo que que resolvió un problema de larga duración por el que no se anunciaba la información de la pista a menos que se activase la opción "Anunciar descripciones de objeto" en NVDA.

source: ### Track items overview
es: ### Descripción de los elementos de pista

source: Each track item in Studio (including playlist viewer), and in extension, tracks found in Creator, Track Tool, and Remote VT client, consists of a row of columns (6 for Studio 5.0x and earlier, 18 for playlist viewer in Studio 5.10 and later, may vary on other track lists). As far as NVDA is concerned, it is an overlay class that provides a number of services, including:
es: Cada elemento de pista de Studio (incluyendo el visor de listas de reproducción) y, en extensión, las pistas que se encuentran en Creator, la herramienta de pista y el cliente Remote VT, consta de una fila de columnas (6 para Studio 5.0x y anteriores, 18 para el visor de lista de reproducción de Studio 5.10 y posteriores, puede variar en otras listas de pistas). Tal y como está concebido NVDA, es una clase de superposición que proporciona un número de servicios, incluyendo:

source: * Routines for navigating and announcing various columns (most were eliminated in favor of using SysListView32 list item routines directly in 2020).
es: * Procedimientos para anunciar y navegar por diversas columnas (la mayoría se eliminaron en favor del uso de los procedimientos de la clase SysListView32 directamente en 2020).

source: * Announcing columns in specific order (see the next chapter on importance of column navigation).
es: * Verbalizar las columnas en un orden específico (mira el próximo capítulo para conocer la importancia de la navegación por columnas).

source: * For Studio, obtaining track comments if defined (see track comments section below).
es: * En Studio, Obtener comentarios de pista si están definidos (mira la sección de comentarios de pista más abajo).

source: * For studio 5.10 and later, a routine to handle when check marks are checked (when you check a track by pressing SPACE, NVDA will announce the newly checked state and will update the braille display accordingly).
es: * En Studio 5.10 y posteriores, un procedimiento para procesar la marcación de las marcas de verificación (cuando marques una pista pulsando espacio, NVDA verbalizará el nuevo estado de verificación y actualizará la pantalla braille apropiadamente).

source: We'll come back to track items when talking about columns later. For now, let's move onto two related features in Studio app module that works with track items: Track Finder and track comments. There is a second feature that deals with Track Finder, and we'll meet this feature in the next section.
es: Volveremos a los elementos de pista cuando hablemos de columnas en el próximo artículo. Por ahora, movámonos a dos características relacionadas en el módulo de aplicación de Studio que funcionan con los elementos de pista: buscador de pistas y comentarios de pista. Hay una segunda característica que trata con el buscador de pistas, la encontraremos en la siguiente sección.

source: ### Track Finder: Locating tracks given a search string
es: ### Buscador de pistas: ubicación de pistas dada una cadena de búsqueda

source: Track Finder allows you to search for tracks with the given artist or song title. This is done by performing a "linear search" - examining one track item to the next until the search term is found. This feature was partly inspired by similar features in other screen readers and NVDA's own find facility (cursorManager.FindDialog and its friends).
es: El buscador de pistas permite buscar pistas dado su autor o el título de la canción. Esto se hace mediante una "búsqueda lineal" - examinando un elemento de pista y el siguiente hasta que se encuentra el término de búsqueda. Esta característica está inspirada en parte por características similares en otros lectores de pantalla y la propia función de búsqueda de NVDA (cursorManager.FindDialog y sus amigos).

source: Track finder is not limited to searching for artist or title: a variation of this dialog (called Column Search) allows you to search for text in specific columns such as duration, file name and so on. Another variation of this dialog, called Time Range Finder (which is a separate dialog of its own (splmisc.SPLTimeRangeDialog) but modeled after Track Finder) uses Studio API to locate tracks with duration between minimum and maximum specified by a user.
es: El buscador de pistas no está limitado a buscar por artista o título: una variante de este diálogo (llamada búsqueda por columnas) permite buscar texto en columnas específicas como duración, nombre de archivo y demás. Otra variante de este diálogo, llamada buscador de rango de tiempo (que es un diálogo separado del otro (splmisc.SPLTimeRangeDialog) pero modelado después del buscador de pista) usa la api de Studio para ubicar pistas con duración entre el mínimo y el máximo especificados por el usuario.

source: In reality, Track Finder and Column Search are a single dialog (splmisc.SPLFindDialog) that presents two dialogs (does this sound familiar?). For now, we'll talk about how the original Track Finder (add-on 2.x to 5.x) works (stay tuned for the next section to learn more about Column Search and the complete refactoring of track finder and its applications).
es: En realidad, el buscador de pistas y el buscador por columnas son un único diálogo (splmisc.SPLFindDialog) que presenta dos diálogos (¿Te suena de algo?). Por ahora, hablaremos de cómo el buscador de pistas original (complementos del 2.x al 5.x) funciona (estáte atento a la próxima sección para aprender más sobre la búsqueda de columnas y la refactorización completa del buscador de pistas y sus aplicaciones).

source: #### Original track Finder: commands, routines and controls
es: #### Buscador de pistas original: órdenes, procedimientos y controles

source: To use Track Finder, press Control+NVDA+F (wait, I saw this command before). For anyone who are accustomed to NVDA's browse mode, this command would be familiar: find text in webpages. This command performs activities similar to alarm dialogs (see sections above): after conditions are checked (making sure you are in playlist viewer and you have added at least one track) and setting required flags, NVDA opens Track Finder dialog where you can enter a search term and press ENTER. NVDA will call track finder function (trackFinder) to locate the track with the given search term, and depending on search results, NVDA will move focus to the track or open a dialog saying results were not found.
es: Para usar el buscador de pistas, pulsa ctrl+NVDA+f (espera, yo ya he visto antes esta orden). Para cualquiera que esté acostumbrado al modo exploración de NVDA, esta orden debería ser familiar: buscar texto en páginas web. Esta orden realiza actividades similares a los diálogos de alarma (mira los artículos anteriores): después de comprobar las condiciones (asegurándose de que estás en el visor de lista de reproducción y que has añadido al menos una pista) y establecer los indicadores necesarios, NVDA abre el diálogo del buscador de pistas, donde puedes introducir un término de búsqueda y pulsar intro. NVDA llamará a la función del buscador de pistas (trackFinder) para encontrar la pista con el término de búsqueda dado, y dependiendo de los resultados de búsqueda, NVDA moverá el foco a la pista o abrirá un diálogo diciendo que no se encontraron resultados.

source: Two other commands are used as part of Track Finder: Find next and previous, assigned to NVDA+F3 and NVDA+Shift+F3, respectively (they also come from browse mode). When these commands are invoked, it'll check if you have searched for a term before, and if not, it'll open Track Finder dialog. If you have searched for a term before, NVDA will perform linear search with search direction specified (trackFinder method in the app module takes various parameters, and one of them is search direction).
es: Otras dos órdenes se usan como parte del buscador de pistas: buscar siguiente y anterior, asignadas to NVDA+f3 y NVDA+shift+f3, respectivamente (también vienen del modo exploración). Cuando se invocan estas órdenes, se comprueba si has introducido previamente un término de búsqueda, y si no es así, se abrirá el diálogo del buscador de pistas. Si previamente ya has buscado un término, NVDA hará una búsqueda lineal en la dirección de búsqueda especificada (el método trackFinder en el módulo de aplicación acepta varios parámetros, y uno de ellos es la dirección de búsqueda).

source: #### Track Finder 1.0 versus 2.0
es: #### Comparación del buscador de pistas 1.0 y el 2.0

source: In add-on version 2.0 to 5.x, when told to find tracks, NVDA will look for search term in track descriptions (in case you are searching for artist in Studio 5.0x, NVDA will also check the name of the check box, as this holds artist name). Although this was simple to implement, it had some issues:
es: En las versiones del complemento 2.0 a 5.x, al pedirle que busque pistas, NVDA buscará el término de búsqueda en las descripciones de pista (en caso de que estés buscando por artista en Studio 5.0x, NVDA también comprobará el nombre de la casilla de verificación, ya que contiene el nombre del artista). Aunque esto fue fácil de implementar, tenía varios problemas:
