Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/spladdoninternals.po
Languages: es

source: The various changes due to introduction of Config Hub are:
es: Los diversos cambios producidos al introducir el centro de configuración son:

source: * Switching profiles: no longer need to copy settings back and forth between live config dictionary and the designated profile in the config pool. Profile switching is simple as swapping new and old profile maps.
es: * Cambios de perfil: ya no existe la necesidad de copiar los ajustes de un sitio a otro entre el diccionario de configuración activa y el perfil en cuestión en la pool de configuración. El cambio de perfiles es tan simple como intercambiar los mapas del antiguo y el nuevo perfil.

source: * A history of activated profiles is now kept inside this dictionary.
es: * Se guarda en este diccionario un historial de los perfiles activados.

source: * It is possible to pass in additional options when creating a new profile, such as whether it should be cached, validated now and so on.
es: * Es posible pasar opciones adicionales al crear un nuevo perfil, tales como si debería meterse en caché, validarse en el momento y demás.

source: #### How does profile switching work
es: #### Cómo funciona el cambio de perfiles

source: Note: information on time-based profile is included for completeness.
es: Nota: la información de perfiles basados en tiempo se incluye por completitud.

source: Besides switching to different profiles via broadcast profiles dialog, a profile can be set to be switched to instantly during a live show. In older releases, time-based profiles were supported in which NVDA will switch to a designated broadcast profile just before the show starts.
es: Además de pasar a distintos perfiles mediante el diálogo de perfiles de emisión, se puede configurar un perfil para que se active instantáneamente durante un programa en directo. En versiones anteriores, se soportaban perfiles basados en tiempo, que NVDA activaba justo antes de que empezara el programa.

source: An instant switch profile is a profile to be switched to if told by the user. This is used before you connect to a streaming server to load settings appropriate for a show (as of time of this writing, only one can be selected as an instant switch profile; to define this profile, select a profile to be used as a show, then go to profile switching button and select it).
es: Un perfil de cambio instantáneo es un perfil al que se cambia si así lo indica el usuario. Se suelen usar antes de conectar a un servidor de emisión para cargar los ajustes apropiados para un programa (en el momento en que se escribe esto, sólo puede elegirse un único perfil como perfil de cambio instantáneo; para definirlo, selecciona el perfil de tu programa, ve al botón de cambio de perfil y selecciónalo).

source: In contrast, a time-based profile is a special type of instant switch profile that will be activated at a specific date and time. A separate map (a pickle map) is employed to store settings related to these profiles, and the user-facing options can be found in triggers dialog found in add-on settings (see the next section for an overview of this dialog and the configuration format for this map).
es: En contraste, un perfil basado en tiempo es un tipo especial de perfil de cambio instantáneo que se activará en la fecha y hora especificadas. Se emplea un mapa separado (un mapa pickle) para almacenar los ajustes relativos a estos perfiles, sus opciones de interfaz de usuario pueden encontrarse en el diálogo de disparadores situado en los ajustes del complemento (mira la siguiente sección para ver una descripción de este diálogo y el formato de configuración de este mapa).

source: To activate an instant switch profile, press SPL Assistant, F12. For time-based profile, it'll activate itself when it is time to do so (with help from a countdown timer located in splmisc module). In ither case, the switching procedure is as follows:
es: Para activar un perfil de cambio instantáneo, pulsa asistente de SPL, f12. Los perfiles basados en tiempo se activarán por sí solos cuando sea hora de hacerlo (con la ayuda de un temporizador de cuenta atrás situado en el módulo splmisc). En ambos casos, el procedimiento para cambiar el perfil es el siguiente:

source: 1. Performs some checks, including:
es: 1. Se hacen varias comprobaciones, entre ellas:

source: * Checks if a switch profile (instant or time-based) is defined.
es: * Se comprueba si se ha definido un perfil de cambio (instantáneo o basado en tiempo).

source: * For instant switch profiles, if a profile is defined, it'll make sure you are not using the instant switch profile yet.
es: * Para los perfiles de cambio instantáneo, si hay alguno definido, se comprueba que no lo estás usando todavía.

source: 2. For add-on 7.x and earlier, saves the index of the active profile.
es: 2. En los complementos 7.x y anteriores, se guarda el índice del perfil activo.

source: 3. Locates the name of the switch profile and the profile associated with it and switches to the switch profile (for add-on 7.x, reassigns SPLConfig to use the switch profile; for 8.0 and later, swaps normal profile with the instant profile map). At this point, NVDA may announce metadata streaming status if told to do so when switching profiles, and with 17.12, made simpler through an action extension point notifier that tells appropriate functions to respond to profile switch action.
es: 3. Se ubica el nombre del perfil de cambio y el perfil asociado a él, y se cambia al perfil seleccionado (en el complemento 7.x, se reasigna SPLConfig para que use el perfil de cambio; en el 8.0 y posteriores, se intercambian los mapas del perfil normal y el perfil instantáneo). En ese momento, NVDA puede verbalizar el estado de los metadatos del flujo si está configurado para hacerlo al cambiar de perfil. En la versión 17.12, esto se ha simplificado a través de un notificador de punto de extensión de acción que indica a las funciones apropiadas que reaccionen ante la acción de cambio de perfil.

source: 4. If no duration is specified for a time-based profile, NVDA will set next switch time and date by calling splconfig.setNextTrigger, otherwise this is delayed until the show is complete.
es: 4. Si un perfil basado en tiempo no tiene una duración especificada, NVDA establecerá la siguiente fecha y hora de cambio llamando a splconfig.setNextTrigger, en cualquier otro caso se espera a que el programa termine.

source: 5. If told to return to the previously active profile, it'll tell SPLConfig to use the previously active profile (the index for the previously active profile is located and is used to pull the profile with the given index from the config pool).
es: 5. Si se indica que hay que volver al perfil previamente activo, SPLConfig recibirá la orden de usar el perfil anterior (el índice para el perfil activo anteriormente ya se había guardado y se usa para recuperar el perfil de la pool de perfiles).

source: 6. When deactivating a time-based profile, NVDA will now find out when the next switch date and time will be.
es: 6. Al desactivar un perfil basado en tiempo, NVDA averiguará cuándo serán las próximas fecha y hora de activación.

source: #### Time-based switching fields and triggers dialog
es: #### El diálogo de disparadores y campos del cambio basado en tiempo

source: Note: this section is no longer applicable since 2020 but is kept for historical reasons.
es: Nota: esta sección ya no es aplicable desde 2020, pero se conserva por motivos históricos.

source: For each time-based profile, a list with seven fields is employed to describe trigger (switch) date and time. These are:
es: Para cada perfil basado en tiempo, se emplea una lista con siete campos para describir la fecha y hora del disparador (cambio). Son los siguientes:

source: * Trigger date (integer between 0 and 127): A 7-bit integer, denoting days on which a given profile should be activated. This field is used in profile triggers dialog to set or clear activation day checkboxes. A value of 0 means the profile should not be activated, and if so, it is removed from the triggers map.
es: * Fecha del disparador (entero entre 0 y 127): un entero de 7 bits, indicando en cuántos días debería activarse un perfil. Este campo se usa en el diálogo de disparadores de perfil para marcar o desmarcar las casillas de verificación de días de activación. El valor 0 significa que el perfil no debería activarse, y si es así, se elimina del mapa de disparadores.

source: * Switch date and time (five integers): The first five fields used for constructing datetime.datetime object (year, month, day, hour, minute) are stored. This is used to let NVDA know when to switch profiles.
es: * Fecha y hora del cambio (cinco enteros): los cinco primeros campos usados para construir datetime. El objeto datetime (año, mes, día, hora, minuto) se almacena. Se usa para que NVDA sepa cuándo cambiar de perfil.

source: * Duration (integer between 0 and 1439): An integer specifying the duration of this profile (show) in minutes. This is mainly used by a timer that becomes active when the profile in question becomes active, and the only job of this timer is to switch back to another profile when the show is complete.
es: * Duración (entero entre 0 y 1439): un entero que especifica la duración de este perfil (programa) en minutos. Lo usa principalmente un temporizador que se activa al activarse el perfil en cuestión, y cuya única función es volver a otro perfil cuando el programa se acabe.

source: The triggers dialog, used to configure these fields for the selected profile, consists of two groups of controls:
es: El diálogo de disparadores, usado para configurar estos campos en el perfil seleccionado, consta de dos grupos de controles:

source: * Trigger days: seven checkboxes, one for each day of the week. Checking or clearing these boxes sets corresponding bits in the trigger date field.
es: * Días del disparador: siete casillas de verificación, una para cada día de la semana. Al marcarlas o desmarcarlas se cambian los bits correspondientes en el campo de fecha del disparador.

source: * Switch time: three number entry fields denoting when to switch to this profile (hour and minute) and the duration of this show (minutes).
es: * Hora del cambio: tres campos de entrada numérica que indican cuándo se debe cambiar al perfil (hora y minuto) y la duración del programa (en minutos).

source: Once the data is gathered, NVDA will first check if trigger date checkboxes are checked (if no checkboxes are checked, the profile is removed). Next, NVDA will see if another profile has taken the given time slot, and if not, will proceed to store the next trigger date and time (will not be saved until OK button is clicked from the main add-on settings dialog).
es: Una vez que se recopilan los datos, NVDA primero comprobará si están marcadas las casillas de verificación de fecha del disparador (si no hay ninguna marcada, se elimina el perfil). A continuación, NVDA comprobará si otro perfil tiene asignada la misma franja de tiempo, y si no es así, procederá a almacenar la fecha y hora del disparador (no se guardarán hasta que se haga clic en el botón aceptar en el diálogo principal de ajustes del complemento).

source: #### Profile caching
es: #### Caché de perfiles

source: Note: profile caching was a core component of broadcast profiles management from add-on 7.0 to 21.10 and is documented for historical reasons.
es: Nota: la caché de perfiles fue un componente clave en la gestión de perfiles de emisión desde el complemento 7.0 hasta el 21.10, y se documenta por motivos históricos.

source: More recent computers ship with a type of drive called a solid-state drive (sSD). This is the internal disk version of a high-quality flash drive that is larger (physically and in capacity) than a typical USB flash drive. Unlike a spinning hard drives, solid-state drives use flash memory to store information, and therefore data can be read and written faster.
es: Los ordenadores más recientes vienen con un tipo de unidad llamada unidad de estado sólido (SSD). Esta es la versión en disco interno de una unidad flash de alta calidad mayor (físicamente y en capacidad) que una unidad flash USB normal. Al contrario que los discos duros giratorios, las unidades de estado sólido usan la memoria flash para almacenar información, y por tanto los datos se pueden leer y escribir más rápido.

source: One downside of an SSD is limited data writes. Flash memory can endure a limited number of read and write cycles before data cannot be written to a specific location. To avoid this, system software will do its best to store new content across the entire disk so every location can store content (this is called ware leveling).
es: Una desventaja de los SSD es la limitación de escrituras de datos. La memoria flash puede resistir un número limitado de ciclos de lectura y escritura antes de que los datos no se puedan escribir en una ubicación concreta. Para evitarlo, el software del sistema se esforzará en alojar el nuevo contenido por todo el disco de tal forma que se distribuya por todas las ubicaciones (esto se llama nivelación ware).

source: To help prolong SSD life, add-on 7.0 introduced broadcast profile caching. Whenever profiles (including normal profile) are loaded from disk the first time, a copy of settings stored in profiles is stored in an online cache, a dictionary with profile names as keys, which in turn refers to the dictionary view of profile settings. When profiles are saved, the contents of the profile to be saved is compared to this online cache and the profile contents will be written to disk if settings are changed. This assumption takes advantage of the fact that users would not change add-on settings every time Studio is used.
es: Para ayudar a prolongar la vida de los SSD, el complemento 7.0 introdujo una caché de perfiles de emisión. Siempre que se cargan los perfiles desde disco (incluyendo el perfil normal) por primera vez, se aloja una copia de los ajustes de estos perfiles en una caché en línea, un diccionario que usa nombres de perfiles como claves, que en cierto modo hacen referencia a la vista de diccionario de los ajustes del perfil. Cuando los perfiles se guardan, el contenido de cada perfil a guardar se compara con esta caché en línea y sus contenidos se escriben en disco si las opciones han cambiado. Esta suposición aprovecha el hecho de que los usuarios no cambian las opciones del complemento cada vez que se usa Studio.

source: At first profile caching was seen as a way to increase SSD life. But it was later discovered that the caching mechanism made profile save procedure complex. Further, the SSD technology is more robust in 2021 compared to the first time profile caching was introduced (2016), therefore profile caching mechanism was removed in add-on 21.10.
es: Al principio, la caché de perfiles se veía como una forma de aumentar la vida de los SSD. Sin embargo, más tarde se descubrió que el mecanismo de caché volvía complejo el procedimiento para guardar perfiles. Además, la tecnología SSD es más robusta en 2021 comparada con la primera vez que se introdujo la caché de perfiles (2016). Por tanto, el mecanismo de caché de perfiles se eliminó en el complemento 21.10.

source: This concludes a detailed tour of Studio app module internals. The rest of the article will focus on SPL Studio Utilities global plugin, encoder support and a few thoughts on how the add-on is developed, starting with a tour of SPL Controller layer commands.
es: Así concluye un recorrido detallado por el interior del módulo de aplicación de Studio. El resto de los capítulos se enfocarán en la extensión global de utilidades de SPL, soporte del codificador y unas cuantas consideraciones sobre cómo se desarrolla el complemento, comenzando con un recorrido por las órdenes del controlador de SPL.

source: ## Introduction to SPL Utilities: SPLController and focusing to Studio window
es: ## Introducción a las utilidades de SPL: SPLController y cómo llevar el foco a la ventana de Studio

source: Now that we've covered the "kernel" (innermost parts) of this add-on, it is time to talk about the icing: SPL Utilities global plugins and its contents.
es: Ahora que hemos cubierto el "kernel" (la parte más íntima) de este complemento, es hora de hablar sobre la extensión global de utilidades de SPL Studio y sus contenidos.

source: Note: until 2019, encoder support was part of SPL Utilities, but it is now part of SPL Engine app module which is covered next.
es: Nota: hasta 2019, el soporte de codificadores era parte de las utilidades de SPL, pero ahora forma parte del módulo de aplicación del motor de SPL, que se explica a continuación.

source: ### Overview and global plugin contents
es: ### Descripción y contenidos de la extensión global

source: As described in the add-on design section, SPL add-on comes with several app modules and a global plugin. This was needed not only to differentiate between module types and expertese, but also allow Studio functions to be invoked from other programs.
es: Como se ha descrito en la sección de diseño del complemento, el complemento de SPL viene con diversos módulos de aplicación y una extensión global. Esto era necesario no sólo para diferenciar entre tipos de módulos y experiencias, sino también para permitir que las funciones de Studio puedan invocarse desde otros programas.

source: Previously, SPL Utilities was also the home of encoder support routines, introduced in fall 2014 with add-on 3.0. In 2020, encoder support module was moved into its own app module named SPL Engine (splengine package).
es: Anteriormente, las utilidades de SPL constituían el hogar de los procedimientos de soporte del codificador, introducidos a finales de 2014 con el complemento 3.0. En 2020, el módulo de soporte del codificador se ha movido a su propio módulo de aplicación, conocido como motor de SPL (paquete splengine).

source: The SPL Utilities global plugin is housed inside globalPlugins/splUtils/__init__.py. The module consists of global plugin class, SPL Controller driver and commands housed inside the class, and global constants used to communiocate with Studio. It also includes a routine to switch focus to Studio from anywhere.
es: La extensión global de utilidades de SPL se aloja en globalPlugins/splUtils/__init__.py. El módulo consta de una clase de extensión global, el controlador de SPL y órdenes alojadas dentro de la clase, así como constantes globales usadas para comunicarse con Studio. También incluye un procedimiento para desplazar el foco a Studio desde cualquier parte.

source: ### SPL Controller layer
es: ### La capa del controlador de SPL

source: The SPL Controller layer (entry command unassigned, same reason as the Assistant layer entry command) is used to invoke Studio functions from anywhere. The entry routine is similar to the app module counterpart (SPL Assistant) except for the following:
es: La capa del controlador de SPL (orden de entrada sin asignar, mismo motivo que el de la orden de entrada al asistente de SPL) se usa para invocar funciones de Studio desde cualquier sitio. El procedimiento de entrada es similar a su homólogo del módulo de aplicación (el asistente de SPL) salvo por lo siguiente:

source: * NVDA will make sure Studio is running (if so, it'll cache the window handle value just as in the Studio app module), otherwise it cannot enter SPL Controller layer.
es: * NVDA se asegurará de que Studio esté en ejecución (si es así, almacenará en caché el valor del manejador de ventana al igual que en el módulo de aplicación de Studio), en cualquier otro caso no se puede entrar en la capa del controlador de SPL.

source: * All commands (except two) use Studio API (Studio API and use of user32.dll's SendMessage was described in a previous section).
es: * Todas las órdenes (excepto dos) usan la api de Studio (en un artículo anterior se describió el funcionamiento de la api de Studio y la función SendMessage de user32.dll).

source: For mechanics of layer commands, see section on add-on design where layer commands were discussed.
es: Para ver los mecanismos de las órdenes de capa, consulta un artículo anterior que hablaba del diseño del complemento, donde se expusieron estas órdenes.

source: The following commands utilize Studio API:
es: Las siguientes órdenes utilizan la api de Studio:

source: * A/Shift+A: Automation on/off.
es: * A/Shift+A: activar o desactivar automatización.

source: * L/Shift+L: Line in on/off.
es: * L/Shift+L: activar o desactivar entrada de línea.

source: * M/Shift+M/N: Microphone on/off/instant on/off toggle.
es: * M/Shift+M/N: activar o desactivar micrófono, o conmutador instantáneo para encenderlo y apagarlo.

source: * P: Play.
es: * P: reproducir.

source: * Q: Obtain various status information. Due to API changes, this command works better in studio 5.20 and later.)
es: * Q: obtener diversa información de estado (debido a cambios en la api, esta orden funciona mejor en Studio 5.20 y posteriores.)

source: * R: Remaining time for the currently playing track (if any).
es: * R: tiempo restante de la pista actualmente en reproducción (si la hay).

source: * Shift+R: Library scan progress and umber of items scanned.
es: * Shift+r: progreso del escaneo de biblioteca y cantidad de elementos escaneados.

source: * S/T: Stop with fade/instant stop.
es: * S/T: parar progresivamente o parar de forma instantánea.

source: * U: Play/pause.
es: * U: reproducir / pausar.

source: For readers familiar with Studio keyboard commands, you'll find yourself at home (they are indeed Studio commands except pressing Shift will turn a feature off and Shift+R will remind you of Control+Shift+R for library scan from Insert Tracks dialog). The letter "Q" stands for "query Studio status".
es: Los lectores familiarizados con las órdenes te teclado de Studio se sentirán como en casa (en cierto modo estas son órdenes de Studio, salvo porque shift se usa para desactivar algunas características, y shift+r te recordará al ctrl+shift+r que se usa para escanear desde el diálogo de inserción de pistas). La letra Q se queda para "Consultar el estado de Studio" (consultar, en inglés, es query).

source: Here are the two exceptions
es: Estas son las dos excepciones

source: * E: NVDA will search for and announce connection status of encoders. This is done by locating top-level windows for various encoder windows and using EnumChildWindows to look for actual encoders list.
es: * E: NVDA buscará y anunciará el estado de conexión de los codificadores. Esto se hace ubicando las ventanas de más alto nivel y buscando diversas ventanas de codificadores, para a continuación obtener la lista real de codificadores llamando a EnumChildWindows.

source: * F1: Opens a browse mode document displaying Controller layer commands (does this sound familiar?).
es: * F1: abre un documento en modo exploración que muestra las órdenes de la capa del controlador (¿Te suena familiar?).

source: ### Focusing to Studio window from anywhere
es: ### Cómo llevar el foco a la ventana de Studio desde cualquier parte
