Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/spladdoninternals.po
Languages: es

source: 1. Because of track item changes in Studio 5.10, I had to spend some time adjusting the track finder formula.
es: 1. A causa de los cambios del elemento de pista en Studio 5.10, tuve que dedicar algún tiempo a ajustar la fórmula del buscador de pistas.

source: 2. When finding a track in a playlist with hundreds of tracks loaded, finding a track at the end of the playlist took several seconds, and this wasn't acceptable to users.
es: 2. Al buscar una pista en una lista de reproducción con cientos de pistas cargadas, encontrar una pista al final de la lista llevaba varios segundos, y esto no era aceptable para los usuarios.

source: In add-on 6.0, thanks to column search, Track Finder's performance was improved. Also, track finder was split into two functions: trackFinder still manages moving focus or showing the error dialog, while the linear search now lives in a private function. This design allows track finder routine to be used by more than one feature (in this case, place marker feature uses this, as you'll see in the next section.
es: En el complemento 6.0, gracias a la búsqueda por columnas, el rendimiento del buscador de pistas mejoró. Además, el buscador se dividió en dos funciones: trackFinder todavía gestiona el movimiento del foco o muestra el diálogo de error, mientras que la búsqueda lineal ahora reside en una función privada. Este diseño permite que el procedimiento de búsqueda de pistas pueda ser usado por más de una característica (en este caso, el marcador de posiciones lo usa, como verás en la próxima sección).

source: For both versions, the signature of trackFinder method (linear search routine in 1.0, search results manager in 2.0) in the Studio app module is:
es: En ambas versiones, la cabecera del método trackFinder (procedimiento de búsqueda lineal en 1.0, gestor de resultados de búsqueda en 2.0) en el módulo de aplicación de Studio es:

source: Text is the search term, obj is where the search should begin, direction specifies search direction and column is used if Column Search is used (searching for text in specific columns). In Track Finder 2.0 (add-on 6.0), add an "s" to column keyword, and since 2021, columns argument expects a list of column position integers.
es: Text es el término de búsqueda, obj indica dónde debería comenzar la búsqueda, direction especifica la dirección de búsqueda y column se usa si se emplea la búsqueda por columnas (buscar texto en columnas específicas). En el buscador de pistas 2.0 (complemento 6.0), se añade una "s" a la palabra clave column, y desde 2021, el argumento de columnas espera una lista de enteros de posición de columna.

source: ## Method resolution order and importance of column navigation in track items, Track Tool and other features
es: ## Orden de resolución de métodos e importancia de la navegación por columnas en los elementos de pista, la herramienta de pista y otras características

source: In the previous section, you saw how overlay classes work, as well as how track items in Studio are defined and used. We'll continue our tour of track items by looking at column navigation feature and how it is used in various places. But before we get into that, we need to talk about how NVDA knows how certain commands apply in specific situations via method resolution order.
es: En la sección anterior vimos cómo funcionaban las clases de superposición, y cómo se definen y usan los elementos de pista en Studio. Vamos a continuar con nuestro recorrido por los elementos de pista mirando la característica de navegación por columnas y viendo cómo se usa en diversos lugares. Pero antes de eso, debemos hablar sobre cómo sabe NVDA cómo aplicar ciertas órdenes en situaciones específicas mediante el orden de resolución de métodos.

source: ### Method resolution order: locating commands and defining command scope
es: ### Orden de resolución de métodos: ubicación de órdenes y definición de su ámbito

source: If multiple classes (objects) are defined, especially if inheritance is involved, it becomes hard to determine which method is which and where various methods are defined. This becomes complicated when two or more classes inherit from a single parent, or multiple inheritance is in use (Python supports both scenarios).
es: Si se definen múltiples clases (objetos), especialmente si la herencia está implicada, es duro determinar qué método es cuál y dónde se definen diversos métodos. Esto se hace más complicado cuando dos o más clases heredan del mismo padre, o se emplea herencia múltiple (Python soporta ambos escenarios).

source: One way Python solves this is through Method Resolution Order (MRO). Simply put, when a method is to be used, it first looks at whether this method is defined in the object it is dealing with, and if not, will consult the parent of this object.
es: Una forma que tiene Python de resolver esto es a través del orden de resolución de métodos (ORM). Resumiendo, cuando tiene que usarse un método, primero se mira si el método está definido en el objeto con el que estamos tratando, y si no, se consultará al padre de este objeto.

source: For example, suppose we have a list box that defines a scroll method, and a custom list box widget inherits from this list box (in effect, custom list box is a list box). To make matters slightly complicated, let's say the scroll method is not defined (not really defined) in the custom list box. Then when the user scrolls through the custom list box, Python will see that the custom list box does not have the scroll method, so it'll look at the parent (original list box) and use its scroll method (in this case, yes, Python will use the parent's scroll method).
es: Por ejemplo, supongamos que tenemos un cuadro de lista que define un método scroll, y un widget de cuadro de lista personalizado que hereda de este cuadro de lista (en efecto, el cuadro de lista personalizado es un cuadro de lista). Para complicar un poco más las cosas, digamos que el método scroll no está definido (no está realmente definido) en el cuadro de lista personalizado. Cuando el usuario se desplace por el cuadro de lista personalizado, Python verá que el cuadro de lista personalizado no tiene el método scroll, por lo que mirará en el padre (cuadro de lista original) y empleará su método scroll (en este caso sí, Python usará el método scroll del padre).

source: In terms of NVDA, method resolution order comes in handy when dealing with overlay classes. This has wide ranging consequences, including ability to limit where certain commands can be used to not defining a command (setting the script bound to gesture to None), effectively forcing NVDA to look up a given gesture from the base class (parent). If NVDA cannot locate the command in question, it'll pass this to Windows, which then sends the command to the active program.
es: En términos de NVDA, el orden de resolución de métodos es útil al tratar con clases de superposición. Esto tiene un extenso rango de consecuencias, incluyendo la habilidad de limitar dónde se pueden emplear ciertas órdenes o no definir una orden (configurando el script para que esté asociado al gesto None), forzando a NVDA de forma efectiva a que busque un gesto en una clase base (padre). Si NVDA no puede hallar la orden en cuestión, la pasará a Windows, que a continuación envía la orden al programa activo.

source: ### Finishing the puzzle: MRO and Studio's track items
es: ### Terminando el puzle: MRO y los elementos de pista de Studio

source: As described in the previous section, Studio app module defines three classes for track items: abstract base class for tracks found in Studio and other apps, a class representing track items found throughout Studio, and another for representing playlist viewer track items. In reality, all that matters is the first two, with the playlist viewer item class providing custom routines on top of the Studio track item class. In case of MRO, playlist viewer item class will be consulted if playlist viewer is in use, otherwise main Studio track item class will be consulted, which in turn will consult SPL track item base class. Other apps such as Track Tool and Remote VT client have their own MRO, ultimately consulting SPL track item base class defined in Studio app module.
es: Como se describía en la sección anterior, el módulo de aplicación de Studio define tres clases para los elementos de pista: una clase base abstracta para pistas encontradas en Studio y otras aplicaciones, una clase representando elementos de pista que se encuentran a lo largo de Studio, y otra que representa elementos de pista del visor de listas de reproducción. En realidad, todo lo que importa está en las dos primeras, y la clase para el visor de listas de reproducción proporciona procedimientos personalizados sobre la clase de elemento de pista de Studio. En caso de MRO, se consultará al módulo del visor de listas de reproducción si este está en uso, y en cualquier otro caso NVDA consultará al elemento principal de pista de Studio, lo que a efectos prácticos es consultar la clase base de elemento de pista de SPL. Otras aplicaciones, como la herramienta de pista o el cliente Remote VT, tienen su propio MRO, que desemboca también en una consulta a la clase base de elemento de pista de SPL definida en el módulo de aplicación de Studio.

source: The most important job of appModules.splstudio.SPLTrackItem class is announcing column data. Prior to 2020, it also housed column navigation commands and routines such as next and previous column, handler for Track Dial (historical), and a dedicated routine to announce column information given column number and optional header. In 2020, only Columns Explorer remains.
es: El trabajo más importante de la clase appModules.splstudio.SPLTrackItem es anunciar datos de columnas. Antes de 2020, alojaba también procedimientos y órdenes de navegación por columnas tales como columna siguiente o anterior, el manejador del dial de pista (histórico), y un procedimiento dedicado para anunciar la información de una columna dados su número y una cabecera opcional. En 2020, sólo permanece el explorador de columnas.

source: On top of the base SPL track item class is general Studio track item class, which does nothing, as it is meant to represent tracks in places such as Insert Tracks dialog. However the class that represents playlist viewer items (appModules.splstudio.StudioPlaylistViewerItem) adds routines and scripts for use from playlist viewer. These include:
es: Por encima de la clase base de elemento de pista de SPL se encuentra la clase general de elemento de pista de Studio, que no hace nada, ya que está diseñada para representar pistas en lugares como el diálogo para insertar pistas. Sin embargo, la clase que representa los elementos del visor de lista de reproducción (appModules.splstudio.StudioPlaylistViewerItem) añade procedimientos y scripts para usar desde el visor de lista de reproducción. Entre ellos se incluyen:

source: * reportFocus: This is called when reporting track items to you (broadcaster). It's main job is to see if custom column order is defined (see below) and builds needed pieces if column order is specified. Later in 2020, column order handling was moved to track name getter.
es: * reportFocus: se llama a esta función al informarte a ti (locutor) sobre los elementos de pista. Su función principal es ver si se ha definido un orden personalizado para las columnas (mira más abajo) y construir las piezas necesarias si se especifica un orden de columnas. Posteriormente en 2020, el manejo del orden de columnas se movió al getter del nombre de pista.

source: * Track comments: Routines related to working with comments for traks (see the previous section for details).
es: * Comentarios de pista: procedimientos relacionados con el trabajo con comentarios de pista (mira la sección anterior para más detalles).

source: * Announcing toggle state of tracks when Space is pressed.
es: * Anunciar el estado de conmutación de las pistas al pulsar la barra espaciadora.

source: * Toggling column announcement inclusion and order between screen order and custom order (see column announcement order section for details).
es: * Conmutar la inclusión y el orden de los anuncios de columna entre orden en pantalla y orden personalizado (consulta la secci´ón sobre el orden de anuncio de las columnas para más detalles).

source: ### Birth of Track Dial: from hesitation to possibilities
es: ### Nacimiento del dial de pista: de la duda a las posibilidades

source: Note: Information on Track Dial is kept for reference purposes. Track Dial was deprecated in 2017 with the release of add-on 17.04.
es: Nota: la información sobre el dial de pista se conserva con propósitos de referencia y consulta. El dial de pista quedó obsoleto en 2017 con la publicación del complemento 17.04.

source: As I was writing the add-on, one of the top suggestions I received was ability to use enhanced arrow keys feature to review columns. This feature allows broadcasters using screen reader scripts to use arrow keys to review column information such as artist, duration and so on. As of time of this writing, all three screen reader scripts support this feature.
es: Según estaba programando el complemento, una de las sugerencias que más recibía era la capacidad de usar la característica de flechas mejoradas para revisar columnas. Esta característica permite a los locutores que usan scripts para lectores de pantalla usar las flechas para revisar información de columnas como artista, duración y demás. En el momento en que escribo esto, los tres scripts para lectores de pantalla soportan esta característica.

source: At first, I told broadcasters that this wasn't possible. My impression back then (summer 2014) was that I had to manipulate track description text (obj.description) to enable this possibility. But seeing how other screen readers implement this convinced me that it might be possible to implement this for NVDA users, thus I started researching this in fall 2014.
es: Al principio, dije a los locutores que esto no era posible. Mi impresión por entonces (verano de 2014) era que tendría que manipular el texto de la descripción de pista (obj.description) para activar esta posibilidad. Pero viendo cómo implementaban esto otros lectores de pantalla, me convencí de que podría ser posible implementarlo para usuarios de NVDA, y por tanto comencé a investigar sobre ello a finales de 2014.

source: I started by looking for patterns in description text that could be used to give users an impression that column navigation was active (when it was not). I studied how Python handles regular expressions and manipulated substrings (str.find and slicing) with no satisfactory results. Then in 2015, while working on improving support for Studio's own stream encoder, I noticed that the encoder entries were SysListView32 objects (NVDAObjects.IAccessible.SysListView32). Careful study of this object, especially a method to retrieve column content, gave me an idea as to how to bring Track Dial to life.
es: Comencé buscando patrones en el texto de la descripción que pudieran ser usados para dar a los usuarios la impresión de que la navegación por columnas estaba activa (cuando no lo estaba). Estudié cómo trabajaba Python con las expresiones regulares y cómo manipulaba subcadenas (str.find y división) sin resultados satisfactorios. Después, en 2015, mientras trabajaba para mejorar el soporte para el codificador propio de Studio, me di cuenta de que las entradas del codificador eran objetos SysListView32 (NVDAObjects.IAccessible.SysListView32). Estudié cuidadosamente este objeto, especialmente un método para recuperar el contenido de una columna, y esto me dio una idea sobre cómo traer el dial de pista a la vida.

source: ### The magic behind Track Dial: SysListView32 controls
es: ### La magia tras el dial de pista: los controles SysListView32

source: SysListView32 controls are lists with items organized into columns. For example, certain apps use these controls to arrange entries into columns, such as in certain table-based apps, and in case of studio, displaying various status about encoders.
es: Los controles SysListView32 son listas con elementos organizados en columnas. Por ejemplo, ciertas aplicaciones usan estos controles para ordenar entradas en columnas, tales como ciertas aplicaciones basadas en tablas, y en el caso de Studio, mostrar diversos estados de los codificadores.

source: When these controls are encountered, NVDA allows you to use table navigation commands (Control+Alt+arrows) to navigate between columns, provided that there are child objects (columns) exposed by the accessibility API implementation in use. Table navigation commands are supplied by another class (behaviors.RowWithFakeNavigation; the behaviors mix-in includes things NVDA should perform in various scenarios, including terminal input and output, editable text handling (via a dedicated module) and so on). This is all possible thanks to a method in SysListView32 class (NVDA Core) that allows one to retrieve column text, and this became the engine for Track Dial, Columns Explorer and other column navigation facilities in this add-on (I say "add-on" because column navigation is used by both Studio and Track Tool). This was further solidified in 2018 and later when all track item classes (including Creator track items and SAM encoder entries) were repowered by SysListView32.ListItem class.
es: Cuando se encuentran estos controles, NVDA permite usar órdenes de navegación de tablas (ctrl+alt+flechas) para navegar entre columnas, asumiendo que hay objetos hijo (columnas) expuestos por la implementación de la api de accesibilidad en uso. Las órdenes de navegación de tabla vienen ofrecidas por otra clase (behaviors.RowWithFakeNavigation; el paquete behaviors incluye cosas que NVDA debería hacer en diversos escenarios, incluyendo entrada y salida de una terminal, procesamiento de texto editable (mediante un módulo dedicado) y demás). Todo esto es posible gracias a un método en la clase SysListView32 (núcleo de NVDA) que permite recuperar el texto de una columna, y este se convirtió en el motor para el dial de pista, el explorador de columnas, y otras características de navegación por columnas en el complemento (digo "complemento" porque tanto Studio como la herramienta de pista usan la navegación por columnas). Esto se solidificó más en 2018 y más tarde, cuando todas las clases de elementos de pista (incluyendo los elementos de pista de Creator y las entradas del codificador SAM) fueron potenciadas por la clase SysListView32.ListItem.

source: Until 2018, the column text retrieval routine (which lives in SysListView32 and a copy lives in splstudio.splmisc module) was as follows:
es: Hasta el 2018, El procedimiento de recuperación del texto de la columna (que reside en SysListView32 y cuya copia reside en el módulo splstudio.splmisc) era el siguiente:

source: 1. Features requiring text from a specific column will call a private function in splstudio.splmisc module, which will take the current object and the column index as parameters.
es: 1. Las características que necesiten texto de una columna específica llamarán a una función privada en el módulo splstudio.splmisc, que recibirá el objeto y el índice de columna como parámetros.

source: 2. The column retriever first looks up the handle for the process where the control lives, then creates a place holder for the buffer to hold the column content.
es: 2. El recuperador de columnas primero obtiene el manejador del proceso donde reside el control, luego crea un marcador de posición para el buffer que capturará el contenido de la columna.

source: 3. Next, it looks at the size of the underlying sysListView32 control (ctypes.sizeof) and asks Windows to allocate storage for an internal SysListView32 control via kernel32.dll's VirtualAllocEx. This is needed to store the resulting column text. Same is done for another place holder to store the actual column text by calling VirtualAllocEx.
es: 3. A continuación, mira el tamaño del control SysListView32 subyacente (ctypes.sizeof) y pide a Windows que reserve almacenamiento para un control SysListView32 interno mediante la función VirtualAllocEx de kernel32.dll. Esto es necesario para almacenar el texto de la columna resultante. Lo mismo se hace con otro marcador de posición para almacenar el texto real de la columna llamando a VirtualAllocEx.

source: 4. The retriever then creates an internal SysListView32 control used as a place holder to store column text, then asks Windows to tell the process where the column text lives to reveal the column text for the specified column (first calls WriteProcessMemory, sens a message via user32.dll's SendMessage to retrieve text length, then uses ReadProcessMemory to retrieve the actual column text if there is something to read). Once the column text is revealed, the retriever stores the text inside the text buffer (ctypes.create_unicode_buffer, allocated to store the resulting text).
es: 4. El recuperador crea a continuación un control interno SysListView32 usado como marcador de posición para almacenar el texto de la columna, después le pide a Windows que le diga al proceso donde reside el texto de la columna que revele el texto de columna de la columna especificada (primero se llama a WriteProcessMemory, se envía un mensaje mediante la función SendMessage de user32.dll para recuperar la longitud del texto, luego se usa ReadProcessMemory para recuperar el texto real de la columna si hay algo que leer). Una vez se ha revelado el texto de la columna, el recuperador almacena el valor dentro del buffer de texto (ctypes.create_unicode_buffer, reservado para almacenar el texto resultante).

source: 5. Lastly, the retriever frees resources (VirtualFreeEx) and returns the just retrieved column text, which can be used by routines requesting this.
es: 5. Por último, el recuperador libera recursos (VirtualFreeEx) y devuelve el texto de la columna recién recuperado, que puede ser usado por los procedimientos que lo habían solicitado.

source: In 2018, this was simplified by use of SysListView32 routines directly. In 2020, almost the entire table navigation routines are performed by the base SysListView32 item class (the only exception being row navigation in playlist viewer).
es: En 2018, esto se simplificó usando directamente los procedimientos de SysListView32. En 2020, la clase base de elemento SysListView32 realiza casi todos los procedimientos de navegación por tablas (siendo la única excepción la navegación por filas en el visor de listas de reproducción).

source: ### Column retrieval and navigation routines: from hesitation to a cornerstone
es: ### Recuperación de columnas y procedimientos de navegación: de la duda a la piedra angular
