Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/spladdoninternals.po
Languages: es

source: As mentioned in the chapter on life of the Studio app module, one of the things the app module does is load the add-on configuration database by calling splconfig.initialize function. The job of this function is to load the add-on configuration map from various places (for add-on 5.x, it will be the main configuration map only, while 6.0 also searches appModules/profiles folder to load broadcast profiles). The format of the configuration file is that of a typical ini file, and as far as NVDA is concerned, it is a dictionary.
es: Como se menciona en el capítulo que habla del ciclo de vida del módulo de aplicación de Studio, una de las cosas que el módulo de aplicación hace es cargar la base de datos con la configuración del complemento llamando a la función splconfig.initialize. El trabajo de esta función es cargar el mapa de configuración del complemento de diversos lugares (en el complemento 5.x, será sólo el mapa de configuración principal, mientras que el 6.0 también busca en la carpeta appModules/profiles para cargar los perfiles de emisión). El formato del archivo de configuración es el de un archivo ini típico, y tal y como NVDA está concebido, se trata de un diccionario.

source: When the configuration database is ready, Studio app module will then use values stored in this settings dictionary to perform various tasks, including microphone alarm, announcing listener count and so on. If multiple profiles are defined, NVDA will start with the first configuration map (normal profile), and the active profile is denoted by splconfig.SPLConfig map (more on profiles in a moment).
es: Cuando la base de datos de configuración está lista, el módulo de aplicación empleará los valores almacenados en este diccionario de ajustes para llevar a cabo diversas tareas, incluyendo la alarma del micrófono, verbalización del número de oyentes y demás. Si se han definido varios perfiles, NVDA empezará con el primer mapa de configuración (perfil normal), y el perfil activo irá determinado por el mapa splconfig.SPLConfig (más sobre los perfiles en un momento).

source: After you are done using Studio, close Studio so settings can be saved to disk. This involves saving individual profiles, copying global settings to the normal profile and saving the normal profile to disk.
es: Después de que acabes de usar Studio, ciérralo para que los ajustes puedan guardarse a disco. Esto implica guardar perfiles individuales, copiar los ajustes globales al perfil normal y guardar el perfil normal a disco.

source: ### The StationPlaylist Add-on Settings Dialog
es: ### El diálogo de ajustes del complemento StationPlaylist

source: Studio app module allows you to configure various settings in two ways: via a shortcut key (discussed in a section on configuring basic settings) or via the settings dialog. When you use a shortcut key to change settings, NVDA will look up the value for the setting, change it, announce the new setting and store the newly changed value in the settings map.
es: El módulo de aplicación de Studio te permite configurar diversos ajustes de dos formas: mediante un atajo de teclado (expuesto en una sección que habla de configurar ajustes básicos), o mediante el diálogo de ajustes. Cuando usas un atajo de teclado para cambiar ajustes, NVDA buscará el valor para el ajuste, lo cambiará, verbalizará el nuevo ajuste y almacenará el valor recién cambiado en el mapa de ajustes.

source: Alternatively, you can configure settings via the add-on settings dialog (Alt+NVDA+0). As it is a settings dialog (powered by gui.SettingsDialog), it will look just like any NVDA preferences dialog. For some advanced options, this dialog is the only gateway to access them (covered below).
es: Alternativamente, puedes configurar los ajustes mediante el diálogo de ajustes del complemento (alt+NVDA+0). Como es un diálogo de preferencias (proporcionado por gui.SettingsDialog), será muy parecido a todos los diálogos de preferencias de NVDA. Este diálogo es la única puerta para llegar a algunas opciones avanzadas (explicadas debajo).

source: Until 2018, add-on settings were divided into various dialogs. With the release of NVDA 2018.2, it became possible to house all settings under one roof, divided into various settings panels. Visually, it resembles a two-column layout, with the left column showing a list of settings categories, and the right column displaying settings for the chosen category. See below for notes on multi-category settings.
es: Hasta 2018, las opciones del complemento estaban divididas en varios diálogos. Con la llegada de NVDA 2018.2, se hizo posible alojar todas las opciones bajo un mismo techo, divididas en diversos paneles de ajustes. Visualmente, recuerda a una disposición en dos columnas, teniendo la columna de la izquierda una lista de categorías de opciones, y la columna derecha mostrando los ajustes de la categoría elegida. Mira más abajo para ver notas sobre las opciones multicategoría.

source: In 2020, broadcast profiles management was split into its own dialog. Prior to this split, most add-on settings panels relied on broadcast profiles panel for synchronization and updating their controls. This created complications, especially when panels other than broadcast profiles were opened directly. To avoid this issue and to make panels independent of each other, broadcast profiles dialog was born.
es: En 2020, la gestión de perfiles de emisión se separó en su propio diálogo. Antes de esta división, la mayoría de paneles de opciones del complemento se apoyaban en el panel de perfiles de emisión para sincronizar y actualizar sus controles. Esto creaba complicaciones, especialmente cuando se abrían directamente paneles que no fueran el de perfiles de emisión. Para evitar este problema y hacer los paneles independientes entre sí, nació el diálogo de perfiles de emisión.

source: The add-on settings dialog (splconfui.SPLConfigDialog) contains following options:
es: El diálogo de ajustes del complemento (splconfui.SPLConfigDialog) contiene las siguientes opciones:

source: * Global settings: these are settings not affected by profiles. These include status announcements, announcing listener count, library scan options and so on.
es: * Ajustes globales: son ajustes a los que no les afectan los perfiles. Estos incluyen anuncios de estado, verbalización del número de oyentes, opciones del escaneo de biblioteca y demás.

source: * Profile-specific settings: Currently alarms, metadata streaming and column announcement settings are profile-specific. These are end of track alarm and the option to use this alarm, song ramp (intro) time and the setting to use this alarm, microphone alarm and microphone alarm interval. It also includes URL's for metadata streaming and column announcement order and inclusion. For numeric settings such as alarm value, it is a spin control (wx.SpinCtrl; use up or down arrow keys to change them).
es: * Ajustes específicos del perfil: actualmente las alarmas, el flujo de metadatos y los ajustes de verbalización de columnas son específicos del perfil. Estos son la alarma de fin de pista y la opción para usarla, la alarma de introducción y el ajuste para usarla, la alarma del micrófono y el intervalo de alarma de micrófono. También se incluyen URLS para flujo de metadatos y orden de verbalización e inclusión de columnas. Para los ajustes numéricos como el valor de la alarma, se muestra un botón giratorio (wx.SpinCtrl; usa las flechas arriba y abajo para cambiarlos).

source: * Reset settings: NVDA will ask if you wish to reset settings in the currently active profile back to factory defaults. This is done by using a function in splconfig module (splconfig.resetConfig) that will set current profile values to defaults (a default configuration map is included for this purpose; this map uses a configuration specification (confspec, part of defining validation routine via validator module (a close friend of ConfigObj), and this confspec is defined in the splconfspec module).
es: * Restablecer ajustes: NVDA te preguntará si quieres restablecer los ajustes del perfil activo actualmente a los que vienen por defecto de fábrica. Esto se hace usando una función en el módulo splconfig (splconfig.resetConfig) que establecerá los valores del perfil actual a los que vienen por defecto (con este propósito se incluye un mapa con la configuración por defecto; este mapa usa una especificación de configuración (confspec, parte de la definición del proceso de validación mediante el módulo validator (un amigo cercano de ConfigObj), la confspec se define en el módulo splconfspec).

source: When you press Alt+NVDA+0 from Studio to open this dialog, the following will happen:
es: Cuando pulses alt+NVDA+0 desde Studio para abrir este diálogo, ocurrirá lo siguiente:

source: 1. Just like alarm dialogs (see above), NVDA will make sure no other dialogs are open.
es: 1. Al igual que con los diálogos de alarma (mira los artículos anteriores), NVDA se asegurará de que no hay otros diálogos abiertos.

source: 2. It'll then call a function in splconfui module, which in turn will prepare the dialog to be shown.
es: 2. Después llamará a una función en el módulo splconfui, que se encargará de preparar el diálogo a mostrar.

source: 3. The preparation routine (SettingsDialog.makeSettings) will populate the dialog with controls and options associated with each control, with current options coming from configuration values stored in the active profile.
es: 3. El procedimiento de preparación (SettingsDialog.makeSettings) poblará el diálogo con controles y opciones asociadas con cada control. Las opciones actuales vendrán de los valores de configuración almacenados en el perfil activo.

source: 4. Once the dialog is ready, it'll pop up and you'll land on "General add-on settings" button (formerly status message checkbox) or list of active profiles depending on the add-on version and add-on command-line switches (former is 5.x or restrictions on loading profiles is in place, latter is 6.0 and no restrictions). You can then use typical dialog navigation commands to navigate through various options.
es: 4. Una vez el diálogo esté listo, aparecerá y aterrizarás en el botón "Ajustes generales del complemento" (anteriormente la casilla de verificación del mensaje de estado) o en la lista de perfiles activos, según la versión del complemento que tengas y los argumentos de la línea de órdenes del complemento (lo primero pasa en la 5.x o cuando haya restricciones en la carga de perfiles, lo segundo en la 6.0 y sin restricciones). A partir de ahí ya puedes usar órdenes estándar de navegación por diálogos para desplazarte por las distintas opciones.

source: After configuring some settings, click OK or Apply. NVDA will then locate the selected profile and tell SPLConfig to use this profile, then store options from the settings dialog into the configuration map. If Apply button is pressed and if the selected profile is not the active one, NVDA will present a message reminding users that settings will be saved to the profile selected from settings dialog, not the active one at the moment. After that, changes will be saved and add-on settings will reappear.
es: Después de configurar algunos ajustes, haz clic en aceptar o aplicar. NVDA localizará a continuación el perfil seleccionado y pedirá a SPLConfig que use este perfil, luego almacenará las opciones del diálogo de ajustes dentro del mapa de configuración. Si se pulsa el botón aplicar y el perfil seleccionado no es el perfil activo, NVDA mostrará un mensaje recordando a los usuarios que los ajustes se guardarán en el perfil seleccionado en el diálogo de ajustes, y no en el que esté activo en ese momento. Después de eso, se guardarán los cambios y reaparecerán los ajustes del complemento.

source: In case you discard new settings (clicking Cancel), NVDA will check to see if an instant switch profile is defined, and if so, it'll perform various operations depending on whether the instant profile has been renamed or deleted.
es: En el caso de que descartes los nuevos ajustes (haciendo clic en cancelar), NVDA comprobará si se ha definido un perfil de cambio instantáneo, y si es así, realizará varias operaciones dependiendo de si el perfil instantáneo se ha renombrado o eliminado.

source: #### Multi-category settings
es: #### Ajustes en varias categorías

source: The description above refers to the old add-on settings interface, which was based on old NVDA settings routines. In the past, there were discussions between add-on users regarding changing the current add-on interface to that of a multi-category settings interface so all add-on settings can be found under one roof.
es: La descripción anterior se refiere a la interfaz antigua de ajustes del complemento, que estaba basada en las funciones antiguas de ajustes de NVDA. En el pasado hubo debates entre los usuarios del complemento relacionados con cambiar la interfaz actual del complemento a una interfaz agrupada en categorías de tal forma que todos los ajustes del complemento se encuentren bajo un mismo techo.

source: In the old days, if one wanted to change settings in NVDA, one would open NVDA's preferences menu and hunt for correct dialog. For instance, when changing browse mode related settings, the place to go was NVDA menu/Preferences/Browse Mode. This meant settings were scattered throughout different dialogs.
es: En los viejos tiempos, si se querían modificar ajustes en NVDA, había que abrir el menú de preferencias de NVDA y elegir el diálogo correcto. Por ejemplo, al cambiar los ajustes relacionados con el modo exploración, el lugar al que ir era menú de NVDA / preferencias / modo exploración. Esto significaba que la configuración estaba dispersa a lo largo de diferentes diálogos.

source: In 2018, a major paradigm shift occurred in NVDA's own user interface: multi-category settings screen. In NVDA 2018.2, a new settings screen, combining various dialogs into a panel, launched. For many settings, one can now open NVDA Menu/Preferences/Settings, select the desired settings category, then change settings. This also had the benefit of moving many settings under one roof.
es: En 2018, se produjo un cambio importante en el paradigma de la propia interfaz de usuario de NVDA: la pantalla de opciones en categorías. En NVDA 2018.2 se lanzó una nueva pantalla de ajustes, combinando varios diálogos en un panel. Para muchos ajustes, ahora se puede abrir el menú de NVDA / preferencias / opciones, seleccionar la categoría de ajustes deseada, y luego cambiar los ajustes. Esto también tuvo el beneficio de mover muchos ajustes bajo un solo techo.

source: As a follow-up to this development, StationPlaylist add-on settings has undergone a major facelift. As noted throughout this article, add-on settings are housed under various dialogs, with the main add-on settings dialog serving as a gateway to these dialogs. In 2018, this has changed into a multi-category settings screen.
es: Como un seguimiento a este desarrollo, los ajustes del complemento de StationPlaylist están sufriendo un lavado de cara. Como se observa a lo largo de este artículo, los ajustes del complemento se alojan bajo diversos diálogos, sirviendo el diálogo principal de ajustes del complemento como una puerta hacia estos diálogos. En 2018, esto se ha convertido en una pantalla de ajustes con varias categorías.

source: ### All about broadcast profiles
es: ### Todo sobre los perfiles de emisión

source: In Studio app module world, a broadcast profile (usually shortened to profile) is a group of settings to be used in a show. This is achieved by using a configuration profile container (splconfig.SPLConfigPool for add-on 6.x and 7.x, splconfig.SPLConfig.profiles for 8.0 and later) for storing these profiles, and one of them is used at any given time (by default, the first profile).
es: En el mundo del módulo de aplicación de Studio, un perfil de emisión (o simplemente perfil, para abreviar) es un grupo de ajustes que se usan en un programa. Esto se lleva a cabo empleando un contenedor de perfiles de configuración (splconfig.SPLConfigPool en los complementos 6.x y 7.x, splconfig.SPLConfig.profiles en 8.0 y posteriores) para almacenar estos perfiles, uno de ellos se usa durante un tiempo específico (por defecto, el primer perfil).

source: There are two ways of creating a profile: brand new or as a copy. Both uses the same dialog (splconfui.NewProfileDialog), with the difference being the base profile in use. For a brand new profile, settings from the normal profile will be used (minus profile-specific settings, which are set to default values), and for a copy, the new profile will contain all settings from the base profile. In both cases, a memory resident profile will be created and initialized just like other profiles (splconfig.unlockConfig/splconfig.SPLConfig.createProfile, taking the name of the new profile as a parameter); this was done to reduce unnecessary disk writes. Also, new/copy profile dialog (and other dialogs invoked from the main configuration dialog) will disable the main settings dialog.
es: Hay dos formas de crear un perfil: partiendo desde cero o como una copia. Ambas formas usan el mismo diálogo (splconfui.NewProfileDialog), siendo la única diferencia el perfil de partida que se usa. Para un nuevo perfil desde cero, se usarán los ajustes del perfil normal (excepto los ajustes específicos del perfil, para los que se establecen valores por defecto), y para la copia, el nuevo perfil contendrá todos los ajustes del perfil de partida. En ambos casos, se creará un perfil residente en memoria y se iniciará como cualquier otro perfil (splconfig.unlockConfig/splconfig.SPLConfig.createProfile, que reciben el nombre de perfil como parámetro); esto se hizo para reducir escrituras innecesarias en disco. Además, el diálogo de nuevo perfil o copiar perfil (y otros diálogos invocados desde el diálogo principal de configuración) deshabilitarán el diálogo principal de ajustes.

source: In case the selected profile is deleted, the profile will be removed from the profiles list, the configuration file associated with the profile will be deleted (if it exists) and a previously active profile will take over unless if the active profile itself is gone, in which case normal profile will be set as the active profile. In case of a rename operation, it'll look for a profile with the old name and change some properties to reflect name change. There is an important step the app module will perform if an instant switch profile is renamed or deleted (if renamed, the instant profile variable will hold the new name, and if deleted, instant profile value will be None). A similar procedure was invoked in older releases when dealing with time-based profiles.
es: En caso de que el perfil seleccionado sea eliminado, este se quitará de la lista de perfiles, se eliminará el archivo de configuración asociado al perfil (si existe) y el perfil activo anteriormente tomará el control a menos que sea el perfil activo el que se vaya, en cuyo caso el perfil normal se establecerá como perfil activo. En caso de operaciones de renombrado, se buscará un perfil con el nombre antiguo y se cambiarán algunas propiedades para reflejar el cambio de nombre. Hay un paso muy importante que el módulo de aplicación llevará a cabo si se renombra o se elimina un perfil de cambio instantáneo (si se renombra, la variable del perfil instantáneo guardará el nuevo nombre, y si se elimina, el valor del perfil instantáneo será None). Se invocaba un procedimiento similar en versiones antiguas al tratar con perfiles basados en tiempo.

source: #### Broadcast profiles dialog
es: #### El diálogo de perfiles de emisión

source: Inspired by NVDA screen reader's configuration profiles dialog, this dialog (splconfui.BroadcastProfilesDialog) shows various profile management controls. When you press Alt+NVDA+P to open this dialog, you'll be greeted with a list of profiles loaded and buttons to create a brand new profile or a copy of an existing profile, rename and delete profiles. It also contains a "triggers" button to configure profile triggers such as instant profile switching.
es: Inspirado en el diálogo de perfiles de configuración del lector de pantalla NVDA, este diálogo (splconfui.BroadcastProfilesDialog) muestra diversos controles de gestión de perfiles. Al pulsar alt+NVDA+p para abrir este diálogo, se mostrará una lista con perfiles cargados y botones para crear un nuevo perfil o copiar un perfil existente, renombrar y eliminar perfiles. También contiene un botón "Disparadores" para configurar disparadores de perfiles, como cambio instantáneo.

source: There is one more control: activate button. This button is disabled by default if the selected profile is the active profile, becoming active otherwise. Regardless of status of activate button, pressing Enter from profiles list will activate the selected profile.
es: Hay un control más: el botón Activar. Este botón se encuentra deshabilitado por defecto si el perfil seleccionado es el perfil activo, habilitándose en cualquier otro caso. Dejando aparte el botón Activar, al pulsar intro desde la lista de perfiles se activará el perfil seleccionado.

source: But there are no OK and Cancel buttons - there is only a "Close" button. How can a broadcast profile become "active" when you press Enter? This is done by setting AffirmativeId to "Activate" button. In effect, "activate" button acts as OK button, which will eventually call the handler associated with "close" button.
es: Pero no hay botones Aceptar y Cancelar - tan sólo hay un botón "Cerrar". ¿Cómo se puede "activar" un perfil al pulsar intro? Esto se hace configurando AffirmativeId en el botón "Activar". A efectos prácticos, el botón "Activar" actúa como el botón "Aceptar", que eventualmente llama al manejador asociado con el botón "Cerrar".

source: #### Introducing Config Hub
es: #### Presentación del centro de configuración

source: In add-on 6.x and 7.x, a combination of SPLConfig map and the config pool was used to allow users to switch between profiles. Because these were using facilities provided by other modules, this meant custom variables such as active profile flag had to live in splconfig module.
es: En los complementos 6.x y 7.x, se usaba una combinación del mapa SPLConfig y la pool de configuración para permitir a los usuarios cambiar entre perfiles. Debido a que se apoyaban en funciones proporcionadas por otros módulos, algunas variables personalizadas como el indicador del perfil activo debían residir en el módulo splconfig.

source: To solve this problem and to allow centralized profile management, a concept of Configuration Hub (ConfigHub) was introduced in add-on 8.0. Inspired by NVDA's own configuration management facility and powered by Chain Map (a dictionary that holds multiple lookup maps), this class not only stores list of currently loaded profiles and the dictionary representing current settings, it also houses various records such as name of the active profile, a history of previously activated profiles and so on, as well as support routines for profile management.
es: Para resolver este problema y permitir una gestión centralizada de perfiles, se introdujo el concepto de centro de configuración (ConfigHub) en el complemento 8.0. Inspirado por el propio sistema de gestión de configuración de NVDA y potenciado por un mapa en cadena (un diccionario que contiene varios mapas de búsqueda), esta clase no sólo almacena la lista de perfiles actualmente cargados y el diccionario que representa los ajustes actuales, también aloja diversos registros como el nombre del perfil activo, un historial de perfiles activados anteriormente y demás, así como procedimientos de soporte para la gestión de perfiles.
