Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/spladdoninternals.po
Languages: es

source: 1. For add-on 6.x and 7.x, loads a predefined configuration file named userConfigPath/splstudio.ini. In add-on 6.0 and later, this is known as "normal profile). In add-on 6.x and 7.x, this is done by calling splconfig.unlockConfig() function that handles configuration validation via ConfigObj and Validator, and in 8.0 and later, this is part of SPLConfig constructor. In add-on 17.10 and later, this step will not take place if NVDA is told to use an in-memory config, and in 18.07 and later, any SPL app module that opens SPLConfig (splconfig.openConfig) will register its app name to indicate which app is starting.
es: 1. Para los complementos 6.x y 7.x, se carga un archivo de configuración predefinido llamado rutaAjustesDeUsuario/splconfig.ini. En el complemento 6.0 y versiones posteriores, esto se conoce como "perfil normal". En los complementos 6.x y 7.x, esto se hace llamando a la función splconfig.unlockConfig(), que se encarga de la validación de la configuración mediante ConfigObj y Validator, y en el 8.0 y posteriores, esto es parte del constructor de SPLConfig. En el complemento 17.10 y posteriores, este paso no tendrá lugar si decimos a NVDA que utilice configuración en memoria, y en la versión 18.07 y posteriores, cualquier módulo de aplicación de SPL que abra SPLConfig (splconfig.openConfig) registrará el nombre de la aplicación para indicar qué aplicación se está iniciando.

source: 2. For add-on 6.0 and later, loads broadcast profiles from addonDir/profiles folder. These are .ini files and are processed just like the normal profile except that global settings are pulled in from the normal profile. In add-on 8.0, just like normal profile, this is done when constructing SPLConfig object. In add-on 17.10 and later, if the add-on is told to use normal profile only, this step will not occur.
es: 2. Para el complemento 6.0 y posteriores, se cargan los perfiles de emisión desde la carpeta rutaDelComplemento/profiles. Son archivos .ini y se procesan como se hace con el perfil normal salvo porque los ajustes globales se toman desde el perfil normal. En el complemento 8.0, al igual que con el perfil normal, esto se hace al construir el objeto SPLConfig. En el complemento 17.10 y posteriores, si decimos al complemento que use solamente el perfil normal, no se hará este paso.

source: 3. Each profile is then appended to a record keeper container (splconfig.SPLConfigPool for 6.x and 7.x, splconfig.SPLConfig.profiles in 8.0 and later). Then the active profile is set and splconfig.SPLConfig (user configuration map) is set to the first profile in the configuration pool (normal profile; for add-on 5.x and earlier or if only normal profile is to be used (17.10 and later), there is (or will be) just one profile so append step is skipped).
es: 3. A continuación, cada perfil se anexa a un contenedor encargado de los registros (splconfig.SPLConfigPool para 6.x y 7.x, splconfig.SPLConfig.profiles en 8.0 y posteriores). Después se establece el perfil activo y splconfig.SPLConfig (mapa de configuración del usuario) se establece al primer perfil en el contenedor de configuración (perfil normal; para el complemento 5.x y anteriores o si sólo va a usarse el perfil normal (17.10 y posteriores), hay (o habrá) simplemente un perfil, por lo que el paso de anexar se omite).

source: 4. Between add-on 7.0 and 21.10 (enhanced in 17.10 and relaxed in 20.09), unless in-memory config is requested, Normal profile dictionary (not others) is cached. This is useful in keeping a record of settings loaded from disk versus run-time configuration and is employed when comparing values when saving profiles. See profile caching section in broadcast profiles for details and reasons which is documented for historical reasons.
es: 4. Entre los complementos 7.0 y 21.10 (mejorado en 17.10 y relajado en 20.09), a menos que se solicite la configuración en memoria, el diccionario del perfil normal (y no otros) se guarda en caché. Esto es útil para conservar un registro de ajustes cargados de disco contra la configuración en tiempo de ejecución, y se emplea al comparar valores al guardar perfiles. Mira la sección de guardado de perfiles en perfiles de emisión para más detalles y razones, documentada por motivos históricos.

source: 5. Starting from add-on 18.08,. if NVDA supports it, SPLConfig will listen to config save action so add-on settings can be saved when config save command (Control+NVDA+C) is invoked. Add-on 19.03 added support for config reload/reset action so add-on settings can be reloaded or reset to defaults if Control+NVDA+R is pressed once or three times, respectively.
es: 5. Comenzando con el complemento 18.08, si NVDA lo soporta, SPLConfig escuchará la acción de guardar configuración para guardar los ajustes del complemento cuando se invoque la orden para guardar la configuración (control+NVDA+c). En el complemento 19.03 se añade soporte para la acción de recarga / restablecimiento de la configuración, de tal forma que las opciones del complemento se recargan o restablecen a valores por defecto si se pulsa NVDA+CTRL+r una o tres veces, respectivamente.

source: 6. If an instant profile is defined (a cached instant profile name is present), the instant profile variable is set accordingly.
es: 6. Si se define un perfil instantáneo (hay presente un nombre de perfil instantáneo en la caché) se establece de forma apropiada la variable de perfil instantáneo.

source: 7. If errors were found, NVDA either displays an error dialog (5.x and earlier) or a status dialog (6.0 and later) detailing the error in question and what NVDA has done to faulty profiles. This can range from applying default values to some settings to resetting everything to defaults (the latter will occur if validator reports that all settings in the normal profile are invalid or ConfigObj threw parse errors, commonly seen when file content doesn't make sense).
es: 7. Si se encuentran errores, NVDA muestra un diálogo de error (5.x y anteriores) o bien un diálogo de estado (6.0 y posteriores) detallando el error en cuestión y lo que ha hecho NVDA a los perfiles fallidos. Esto puede pasar por aplicar valores por defecto a algunos ajustes para restablecer los ajustes por defecto (lo último ocurrirá si el validador informa de que todos los ajustes en el perfil normal son inválidos o configObj lanzó errores de interpretación, vistos comúnmente cuando el contenido del archivo no tiene sentido).

source: 8. Between add-on 7.0 and 18.12, add-on update facility is initialized (splupdate.initialize). among other things, the initialization routine loads update check metadata. In 2018, prior to being removed, update initialization was moved to app module constructor. We'll meet add-on update routines (housed in splstudio/splupdate.py) later in this article.
es: 8. Entre los complementos 7.0 y 18.12, se inicializa la característica de actualizaciones (splupdate.initialize). Entre otras cosas, el procedimiento de inicialización carga los metadatos de búsqueda de actualizaciones. En 2018, la inicialización de las actualizaciones se hace como parte del constructor del módulo de aplicación. Encontraremos los procedimientos de actualización del complemento (alojados en splstudio/splupdate.py) más adelante en este artículo.

source: 9. In add-on 8.0, track comments are loaded (if any). See track items section for details.
es: 9. En el complemento 8.0, se cargan los comentarios de pista (si los hay). Mira la sección de elementos de pista para más detalles.

source: 10. Although not part of the init routine, starting from 17.12, various modules register one or more functions for action notifications. See extension points section for details.
es: 10. Aunque no es parte del procedimiento de inicialización, empezando con el complemento 17.12, diversos módulos registran una o más funciones para notificaciones de acción. Mira la sección de puntos de extensión para más detalles.

source: 4. Starting with NVDA 2015.3, it became possible for an app module to request NVDA to monitor certain events for certain controls even if the app is not being used. This is done by calling eventHandler.requestEvents function with three arguments: process ID, window class for the control in question and the event to be monitored. For earlier versions of NVDA (checked via built-in hasattr function), this step is skipped, and background status monitor flag is then set accordingly. We'll discuss event handling throughout this article.
es: 4. Empezando con NVDA 2015.3, es posible para un módulo de aplicación pedirle a NVDA que monitorice ciertos eventos para ciertos controles incluso si no se está usando la app. Esto se hace llamando a la función eventHandler.requestEvents con tres argumentos: identificador del proceso, clase de ventana para el control en cuestión y el evento a monitorizar. Para versiones más antiguas de NVDA (comprobadas mediante la función incorporada hasattr), se salta este paso, y el indicador de monitorización del estado en segundo plano se establece de forma apropiada. Hablaremos del procesamiento de eventos a lo largo de este artículo.

source: 5. Next, GUI subsystem is initialized (NVDA uses wxPython). This routine adds an entry in NVDA's preferences menu entitled "SPL Studio Settings", the add-on configuration dialog.
es: 5. Después, se inicializa el subsistema gráfico (NVDA usa WXPython). Este procedimiento añade una entrada en el menú de preferencias de NVDA, titulada "Ajustes de SPL Studio", el diálogo de configuración del complemento.

source: 6. As described above, the app module will look for the window handle for the Studio app. In order to avoid this routine consuming resources and making NVDA not responsive, this is done in a separate thread. The thread performs the following:
es: 6. Como se ha descrito antes, el módulo de aplicación buscará el manejador de ventana de la aplicación Studio. Para evitar que este procedimiento consuma recursos y reduzca el rendimiento de NVDA, esto se hace en un hilo separado. El hilo hace lo siguiente:

source: 1. Studio window handle is searched via a loop. If Studio exits for whatever reason, an event flag is raised by the app module, causing this thread to exit.
es: 1. Se busca el manejador de ventana de Studio con un bucle. Si Studio se cierra por la razón que sea, el módulo de aplicación activa un indicador de evento, causando que este hilo finalice.

source: 2. If the handle is found, its value is recorded in a flag found in base services module (splbase).
es: 2. Si se encuentra el manejador, su valor se registra en un indicador situado en el módulo de servicios básicos (splbase).

source: 3. If the app module is told to announce status of metadata streaming and connect to predefined URL's, NVDA will do it at this point provided that Studio's playlist viewer (discussed later) is loaded. In order to announce status messages as the last announcement after connecting to metadata servers, Studio app module places ui.message in the event queue to be handled by NVDA (queueHandler.queueFunction). More on internals of metadata announcement and related components in the SPL Assistant chapter.
es: 3. Si le decimos al módulo de aplicación que verbalice el estado del flujo de metadatos y conexión a URLs predefinidas, NVDA hará todo eso en este punto, asumiendo que el visor de listas de reproducción de Studio (explicado más tarde) está cargado. Para verbalizar mensajes de estado en último lugar después de conectar a los servidores de metadatos, el módulo de aplicación de Studio sitúa ui.message en la cola de eventos para que NVDA la procese (queueHandler.queueFunction). Hay más información sobre el interior del anuncio de metadatos y sus componentes relacionados en el capítulo sobre el asistente de SPL.

source: 7. Between add-on 7.0 and 18.12, if automatic update check is enabled, update check timer is started.
es: 7. Entre los complementos 7.0 y 18.12, si está activada la búsqueda automática de actualizaciones, se inicia el temporizador asociado.

source: #### Changes introduced in 17.10 due to volatile configuration flags
es: #### Cambios introducidos en 17.10 debido a indicadores de configuración volátil

source: In add-on 17.10, several internal flags and associated command-line switches are introduced to control how the add-on settings are loaded and treated. Presence of these flags will significantly alter the way settings are loaded and saved. These flags should be used when instructed by the add-on developer, as they are used for troubleshooting or experimenting purposes.
es: En el complemento 17.10, se introducen varios indicadores internos y argumentos de línea de órdenes asociados para controlar cómo se cargan y se tratan los ajustes del complemento. La presencia de estos indicadores alterará significativamente la forma en que se cargan y guardan los ajustes. Estos indicadores deberían usarse cuando lo indique el desarrollador del complemento, ya que su propósito es experimentar o solucionar problemas.

source: The flags are as follows:
es: Los indicadores son los siguientes:

source: 1. Do not save changes to disk (configVolatile/--spl-configvolatile, removed in 20.09): all profiles (including broadcast profiles) will be loaded from disk but changes will not be saved. With this flag turned on, profile caching will not occur if supported, including normal profile.
es: 1. No guardar cambios a disco (configVolatile/--spl-configvolatile, eliminado en la versión 20.09): todos los perfiles (incluyendo los perfiles de emisión) se cargarán desde disco, pero sus cambios no se guardarán. Con este indicador activado, la conservación de perfiles en caché no ocurrirá si está soportada, incluso para el perfil normal.

source: 2. Load normal profile only (normalProfileOnly/--spl-normalprofileonly): broadcast profiles will not be used i.e. cannot create and switch amongst broadcast profiles. Combining this with NVDA setting to not have configuration to disk on exit effectively makes normal profile a read-only config store.
es: 2. Cargar solamente el perfil normal (normalProfileOnly/--spl-normalprofileonly): no se usarán perfiles de emisión, no se podrán crear estos perfiles ni pasar de uno a otro. Combinando este indicador con la opción de NVDA para no guardar la configuración al salir, el perfil normal se convierte de forma efectiva en un almacén de configuración de sólo lectura.

source: 3. Use in-memory config (configInMemory/--spl-configinmemory): only normal profile will be used, but instead of loading settings from disk, an in-memory version with default settings applied will be used (and no profile caching if supported).
es: 3. Usar configuración en memoria (configInMemory/--spl-configinmemory): sólo se usará el perfil normal, pero en lugar de cargar los ajustes desde disco, se usará una versión en memoria con los ajustes por defecto aplicados (y sin caché de perfiles si se soporta).

source: Using flags that specify the use of normal profile only will restrict ability to create new broadcast profiles.
es: Usar indicadores que especifiquen la utilización solamente del perfil normal restringirá la habilidad de crear nuevos perfiles de emisión.

source: #### Changes introduced in 18.07 to handle add-on settings from apps other than Studio
es: #### Cambios introducidos en 18.07 para procesar opciones del complemento desde aplicaciones distintas a Studio

source: Because Columns Explorer (see the corresponding section below) is used in Studio, Creator and Track Tool, it became necessary to change how add-on settings are loaded and managed outside of Studio. Instead of splconfig.initialize calling SPLConfig constructor directly, it will call splconfig.openConfig function that will call the constructor (if needed) and add the app name to a list of active SPL components. If this is done with add-on settings already loaded, no construction activity will take place.
es: Como el explorador de columnas se usa en Studio, Creator y la herramienta de pista (lee la sección correspondiente a continuación), se hizo necesario cambiar la forma de cargar y gestionar la configuración del complemento fuera de Studio. En vez de llamar directamente al constructor de SPLConfig en splconfig.initialize, se llama a la función splconfig.openConfig, que llamará al constructor (si es necesario) y añadirá el nombre de la aplicación a una lista de componentes de SPL. Si esto se hace con los ajustes del complemento ya cargados, no tendrá lugar ninguna actividad de construcción.

source: In app modules for Creator and Track Tool, the constructor will call splconfig.openConfig to perform the above activity. When the app module terminates (see below), splconfig.closeConfig will be called to unregister the component that is being terminated, and if no SPL components are active, add-on settings will be gone from memory.
es: En los módulos de aplicación de Creator y la herramienta de pista, el constructor llamará a splconfig.openConfig para realizar la actividad explicada arriba. Cuando el módulo de aplicación finaliza (mira más abajo), se llamará a splconfig.closeConfig para eliminar del registro el componente que finaliza, y si no hay componentes de SPL activos, las opciones del complemento se irán de la memoria.

source: ### Life of the app module: events, commands and output
es: ### Vida del módulo de aplicación: eventos, órdenes y salida

source: Once the Studio app module is ready, you can then move to Studio window and perform activities such as:
es: Una vez el módulo de Studio está listo, puedes moverte a la ventana de Studio y realizar actividades como estas:

source: * Press commands, and NVDA will respond by either opening a dialog or speaking what it did.
es: * Pulsar órdenes, y NVDA responderá abriendo un diálogo o bien diciendo lo que ha hecho.

source: * Announce status changes such as microphone status. The length and format of these messages (and other add-on messages) are controlled by message verbosity flag (in case verbosity is set to advanced, NVDA will shorten these announcements, which comes from a messages pool). A special case is announcing artist and title of the currently playing track automatically, for which object navigation is employed. This is necessary due to a broken option in Studio itself.
es: * Verbalizar cambios de estado, como estado del micrófono. La longitud y formato de estos mensajes (y otros mensajes del complemento) están controlados por el indicador de verbosidad de mensajes (en el caso de que la verbosidad se establezca en avanzada, NVDA acortará estos anuncios, que vienen de un contenedor de mensajes). Un caso especial es la verbalización automática de título y artista de la pista que se está reproduciendo actualmente, para el que se emplea navegación por objetos. Esto es necesario por culpa de una opción rota en el propio Studio.

source: * Find tracks.
es: * Buscar pistas.

source: * Examine information in columns via Track Dial and/or Columns Explorer (Track Dial was deprecated in 2017).
es: * Examinar la información en columnas mediante el dial de pista y / o el explorador de columnas (el dial de pista quedó obsoleto en 2017).

source: * Listen to progress of a library scan in the background.
es: * Escuchar el progreso de escaneado de una biblioteca en segundo plano.

source: * Perform SPL Assistant gestures.
es: * Realizar gestos del asistente de SPL.

source: * For 6.0 and later, manage broadcast profiles (we'll talk about broadcast profiles in configuration management section).
es: * Para 6.0 y posteriores, gestionar perfiles de emisión (hablaremos de los perfiles de emisión en la sección de gestión de la configuración).

source: * For 17.12 and later, respond to actions such as broadcast profile switches.
es: * Para 17.12 y posteriores, responder ante acciones como cambios de perfil de emisión.

source: For Creator and Track Tool, it will let you review column data.
es: En Creator y la herramienta de pista, te permitirá revisar los datos de una columna.

source: #### Extension points
es: #### Puntos de extensión

source: Introduced in NVDA 2017.4, an extension point is a notification system from NVDA that tells modules and functions to perform tasks when something happens. For example, the braille subsystem will load a different braille display if different configuration profiles specify this change, or a speech synthesizer can filter certain text from spoken messages before announcing it to users.
es: Introducido en NVDA 2017.4, un punto de extensión es un sistema de notificaciones de NVDA que dice a los módulos y funciones que realicen tareas cuando algo ocurra. Por ejemplo, el subsistema braille cargará una pantalla braille diferente si los perfiles de configuración especifican este cambio, o un sintetizador de voz puede filtrar cierto texto de los mensajes hablados antes de verbalizarlos a los usuarios.

source: There are three extension point types:
es: Hay tres tipos de puntos de extensión:

source: * Action: a function can wait for something to happen, such as change of profiles, loading and saving settings and others, and act accordingly once an action takes place.
es: * Acción: una función puede esperar a que ocurra algo, como un cambio de perfiles, que se cargue o guarde la configuración y otros, y actuar en consecuencia cuando una de estas acciones tiene lugar.

source: * Decider: A data processor inside a script or a function can tell NVDA to continue processing data, such as passing a keystroke to remote system.
es: * Decisión: un procesador de datos dentro de un script o una función puede decirle a NVDA que continúe procesando datos, tales como enviar una pulsación de teclas a un sistema remoto.

source: * Filter: a speech processor can add, change, or remove texts before letting synthesizers announce the would-be spoken text.
es: * Filtro: un procesador de voz puede añadir, cambiar o eliminar textos antes de dejar que los sintetizadores verbalicen el texto que debería ser verbalizado.

source: In SPL add-on, actions are used to notify modules of some action such as when Studio exits, broadcast profile switches and so on. There are two actions defined (in splactions module):
es: En el complemento de SPL, las acciones se usan para notificar a los módulos de alguna acción, como cuando salimos de Studio, cambia el perfil de emisión y así sucesivamente. Hay dos acciones definidas (en el módulo splactions):

source: * Broadcast profile switch: notifies microphone alarm thread and metadata streaming configuration to switch streams or turn off the alarm (see below for details).
es: * Cambio de perfil de emisión: notifica al hilo de alarma del micrófono y a la configuración del flujo de metadatos para que cambie los flujos o apague la alarma (mira más abajo para más detalles).

source: * Studio exiting: tells add-on dialogs to close without saving settings.
es: * Saliendo de Studio: indica a los diálogos del complemento que se cierren sin guardar los ajustes.

source: ### Death: termination routines
es: ### Muerte: procedimientos de finalización

source: While using the add-on, you can stop using it in various ways, including exiting or restarting NVDA, turning off your computer or logging off or closing Studio or other SPL app. Just like initialization routines, the Studio app module has specific directions to follow when add-on is closed.
es: Mientras se usa el complemento de Studio, puedes dejar de usar este complemento de varias maneras, que incluyen salir o reiniciar NVDA, apagar tu ordenador o cerrar sesión, o cerrar Studio o una aplicación de SPL. Al igual que pasa con los procedimientos de inicialización, el módulo de aplicación de Studio tiene instrucciones que seguir cuando el complemento se cierra.
