Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/spladdoninternals.po
Languages: es

source: Another addition to SPL Assistant layer is ability to emulate layer commands provided by other screen readers. This is achieved by using gestures map for each screen reader (NVDA included), with the correct gestures map chosen when entering SPL Assistant layer. Currently, in addition to default NVDA layout, the add-on includes JAWS for Windows layer commands (Window-Eyes layer was removed in 2020).
es: Otro extra añadido a la capa del asistente de SPL es la capacidad de emular órdenes de capa proporcionadas por otros lectores de pantalla. Esto se consigue usando un mapa de gestos para cada lector de pantalla (incluido NVDA), con el mapa de gestos correcto elegido al entrar en la capa del asistente de SPL. Actualmente, además de la distribución por defecto de NVDA, el complemento tiene soporte para las órdenes de capa de Jaws for Windows (la capa de Window Eyes se eliminó en 2020).

source: ### Categorizing SPL Assistant commands
es: ### Categorización de las órdenes del asistente de SPL

source: Once you invoke SPL Assistant layer (a beep will be heard), you can perform one of the following operations:
es: Una vez que invoques a la capa del asistente de SPL (se escuchará un pitido), podrás hacer una de las siguientes operaciones:

source: * Status announcements (automation, microphone, etc.).
es: * Indicaciones de estado (automatización, micrófono, etc.).

source: * Tools (library scan, track time analysis, obtaining playlist snapshots and transcripts and so on).
es: * Herramientas (escaneo de biblioteca, análisis de tiempo de pista, obtención de instantáneas y transcripciones de listas de reproducción y demás).

source: * Configuration (switching broadcast profiles).
es: * Configuración (alternar perfiles de emisión).

source: * Ask for help (opening SPL Assistant help document or the online user guide).
es: * Pedir ayuda (abriendo el documento de ayuda del asistente de Spl o la guía de usuario en línea).

source: * Until 18.12, checking for add-on updates (manually).
es: * Hasta la versión 18.12, buscar actualizaciones del complemento (manualmente).

source: For the first two categories, they can be divided further into commands which uses studio API (via studioAPI function discussed in a previous section), ones using Windows API (Columns explorer) and those relying on object navigation (multiple components are involved and is sensitive to user interface changes). We'll go through each of these categories in turn.
es: Las primeras dos categorías pueden subdividirse en órdenes que usan la api de Studio (mediante la función studioAPI de la que hablamos en un artículo anterior), las que usan la api de Windows (explorador de columnas) y las que se apoyan en la navegación por objetos (varios componentes están implicados y son sensibles a los cambios en la interfaz de usuario). Vamos a ir recorriendo estas categorías de una en una.

source: #### SPL Assistant 1: status announcements
es: #### Asistente de SPL 1: indicaciones de estado

source: These commands allow you to obtain various status information such as title and duration of the next track, cart edit mode status and so on. These can be divided into those which uses object navigation (old style) and Studio API (new style) commands. In some cases, both methods are available and the appropriate version is chosen based on Studio version in use.
es: Estas órdenes te permiten obtener diversa información de estado como el título y duración de la próxima pista, el estado del modo de edición de carts y demás. Pueden dividirse en aquellos que usan la navegación por objetos (el viejo estilo) y órdenes que usan la api de Studio (el nuevo estilo). En algunos casos ambos métodos están disponibles, y se elige la versión apropiada basándose en la versión de Studio en uso.

source: The following commands (sorted alphabetically) utilize Studio API to perform needed functions:
es: Las siguientes órdenes (ordenadas alfabéticamente) utilizan la api de Studio para llevar a cabo las funciones necesarias:

source: * E: Announces if any metadata streaming URL's are defined.
es: * E: indica si se ha definido alguna URL de flujo de metadatos.

source: * H: Duration of tracks in the selected hour.
es: * H: duración de pistas en la hora seleccionada.

source: * Shift+H: Duration of the remaining tracks in the hour slot.
es: * Shift+h: duración de las pistas restantes en la hora.

source: * P: Playback status.
es: * P: estado de la reproducción.

source: * Shift+1 through Shift+4 and Shift+0: Checks metadata streaming status for each URL (0 is DSP encoder). See below for details.
es: * Shift+1 a shift+4 y shift+0: comprueba el estado de los metadatos del flujo de cada URL (0 es el codificador DSP). Mira debajo para más detalles.

source: Note that playlist remainder announcement (SPL Assistant, D) was part of this category until add-on 6.x. In add-on 7.0, due to refactoring work surrounding this command, it has been moved to tools category.
es: Ten en cuenta que la indicación del recordatorio de lista de reproducción (asistente de SPL, D) era parte de esta categoría hasta el complemento 6.x. En el complemento 7.0, debido a los trabajos de refactorización que afectaban a esta orden, se ha movido a la categoría de herramientas.

source: ##### A step sideways: Metadata streaming
es: ##### Un paso a un lado: flujo de metadatos

source: Studio can be told to stream track metadata to five URL's: the DSP encoder address and four additional URL's (Options/Now Playing). By default, DSP encoder address is used to send metadata information.
es: Se puede pedir a Studio que emita en tiempo real los metadatos de una pista a cinco URLS: la dirección del codificador DSP y cuatro URLS adicionales (Opciones / Reproducción en curso). Por defecto, se usa la dirección del codificador DSP para enviar información de metadatos.

source: One of the activities Studio app module performs when starting is to check if metadata streaming is enabled on any URL's. In addition, NVDA can tell you status of metadata streaming for all uRL's (SPL Assistant, E) or for individual addresses (SPL Assistant, Shift+1 through Shift+4 and Shift+0). This is done through a metadata management and announcement function (metadataAnnouncer) that gathers streaming flags for URL's and presents status messages and connects to predefined servers if you tell Studio to connect to streaming servers.
es: Una de las actividades que realiza el módulo de aplicación de Studio al iniciar es comprobar si la emisión de metadatos está activada en alguna URL. Además, NVDA te puede informar del estado del flujo de metadatos para todas las URLS (asistente de SPL, E) o para direcciones individuales (asistente de SPL, shift+1 a shift+4 y shift+0). Esto se hace mediante una función de indicación y administración de metadatos (metadataAnnouncer) que recopila indicadores de flujo de las URLS y presenta mensajes de estado y se conecta a los servidores por defecto si le pides a Studio que se conecte a servidores en tiempo real.

source: When the metadata announcer is called, NVDA does the following:
es: Cuando se llama al indicador de metadatos, NVDA hace lo siguiente:

source: 1. NVDA will look at connection flag (reminder = True, but in reality, this is mostly used as the connection flag), and if the flag is set, connects to a predefined set of streaming URL's.
es: 1. NVDA mirará el indicador de conexión (reminder=True, pero en realidad, esto se usa mayoritariamente como el indicador de conexión), y si el indicador está activo, se conecta a un conjunto predefinido de URLS de flujo.

source: 2. Gathers metadata streaming flags, starting with the DSP encoder.
es: 2. Recopila indicadores de emisión de metadatos, empezando por el codificador DSP.

source: 3. The announcer will count number of metadata enabled URL's used to format the status message.
es: 3. El anunciador contará el número de URLS de metadatos activas usadas para dar formato al mensaje de estado.

source: 4. announces the status message. This message isn't announced right away if this function is called when the app module starts - after a short pause, the status message will be announced and an alarm sound will be played. This is done to make sure this message is the last message to be announced when Studio starts.
es: 4. Se verbaliza el mensaje de estado. Este mensaje no se verbaliza en el momento si se llama a la función cuando el módulo de aplicación se inicia - se verbalizará el mensaje y se reproducirá un sonido de alarma tras una breve pausa. Esto se hace para asegurarse de que este mensaje es el último que se verbaliza cuando arranca Studio.

source: ##### Revisiting the past: object navigation
es: ##### Volviendo al pasado: navegación por objetos

source: Before the new style routines were written, all commands used object navigation. Typically, the command will use a helper function and an object map to locate the needed object and will announce what you are looking for (typically obj.name or an error message). The process was as follows:
es: Antes de escribir los procedimientos del nuevo estilo, todas las órdenes usaban navegación por objetos. Normalmente, el comando usará una función auxiliar y un mapa de objetos para ubicar el objeto que necesita y verbalizará lo que estás buscando (normalmente obj.name o un mensaje de error). El proceso era como se describe a continuación:

source: 1. The Studio app module contains a map of indecies where the object lives in relation to the foreground window. For example, for a given object, if index was 0, NVDA nows that the object is the first child of the foreground object. Technically, it is a dictionary of lists, with each list item (indecies) corresponding to the version of Studio the add-on supports.
es: 1. El módulo de aplicación de Studio contiene un mapa de índices donde el objeto reside en relación con la ventana en primer plano. Por ejemplo, para un objeto dado, si el índice es 0, NVDA sabe que el objeto es el primer hijo del objeto en primer plano. Técnicamente, es un diccionario de listas, correspondiendo cada elemento de lista (índice) con cada versión de Studio a la que el complemento da soporte.

source: 2. To fetch needed objects and to record the command type, a number of constants are defined in the app module (all integers, denoting what you wish to hear). These constants serve as keys to the object index map.
es: 2. Para recuperar los objetos necesarios y registrar el tipo de orden, se definen una serie de constantes en el módulo de aplicación (todas enteras, indicando lo que quieres oír). Estas constantes sirven como claves al mapa de índices de objeto.

source: 3. After entering SPL Assistant layer and once you press one of the commands below, NVDA will do the following:
es: 3. Después de entrar en la capa del asistente de SPL y una vez que pulses una de las siguientes órdenes, NVDA hará lo siguiente:

source: 1. Each command will obtain the object in question by calling object fetcher (status function) with the announcement type as the parameter (status(SPLConstant; for example, for cart edit mode, the signature is self.status(self.SPLPlayStatus), with the constant denoting a status bar).
es: 1. Cada orden obtendrá el objeto en cuestión llamando al recuperador de objetos (función de estado) pasando como parámetro el tipo de anuncio (estado (SPLConstant; por ejemplo, para el modo de edición de carts, la llamada sería self.status(self.SPLPlayStatus), con la constante indicando una barra de estado).

source: 2. The object fetcher (status function) will first consult an object cache (part of the Studio app module) hoping that the needed object is ready for use (for performance reasons; this is also performed in Playlist Editor for performance reasons as explained later).
es: 2. El recuperador de objetos (función de estado) consultará primero una caché de objetos (parte del módulo de aplicación de Studio) esperando que el objeto necesario esté listo para usarse (por razones de rendimiento; esto se hace también en el editor de listas de reproducción como se explica más adelante).

source: 3. If the object was not cached, the fetcher will first write down the foreground window, then use the directions specified in the object index map (the constant passed into the status function is the key to this map and different values are returned based on Studio version) to locate, cache and return the object in question (in that order).
es: 3. Si el objeto no está en la caché, el recuperador anotará primero la ventana en primer plano, luego usará las directrices especificadas en el mapa de índices de objeto (la constante pasada a la función de estado es la clave de este mapa y se devuelven valores diferentes según la versión de Studio) para ubicar, meter en caché y devolver el objeto en cuestión (en ese orden).

source: 4. Back at the routine for the command, it is up to the routine as to what to do with it (sometimes, the actual object is a child of the just returned object).
es: 4. De vuelta en el procedimiento para esa orden, se hará una cosa u otra con el objeto en función del procedimiento elegido (a veces, el objeto real es hijo del objeto devuelto).

source: The commands which utilizes object navigation steps above include:
es: Las órdenes que utilizan los pasos anteriores con navegación por objetos incluyen:

source: * A. Automation.
es: * A. Automatización.

source: * C: Title of the currently playing track.
es: * C: título de la pista actualmente en reproducción.

source: * I: Listener count (I have tried using Studio API to obtain this information, but after experimenting with it, object navigation routine was more stable).
es: * I: número de oyentes (he intentado usar la api de Studio para obtener esta información, pero después de experimentar con ella, el procedimiento de navegación por objetos resultó más estable).

source: * L: Line in.
es: * L: línea de entrada.

source: * M: Microphone.
es: * M: micrófono.

source: * N: Title and duration for the next track.
es: * N: título y duración de la siguiente pista.

source: * Shift+P: Track pitch.
es: * Shift+p: tono de pista.

source: * R: Record to file.
es: * R: grabar a archivo.

source: * S: Track scheduled for.
es: * S: pista programada.

source: * Shift+S: Duration of selected tracks in the current hour slot.
es: * Shift+s: duración de las pistas seleccionadas en la hora actual.

source: * T: Cart Edit Mode (I assigned T to this command for efficiency reasons).
es: * T: modo de edición de carts (asigné la t a esta orden por razones de eficiencia).

source: * U: Studio up time.
es: * U: tiempo de funcionamiento de Studio.

source: * W: Weather and temperature (if configured).
es: * W: tiempo atmosférico y temperatura (si se han configurado).

source: * Y: Playlist modification.
es: * Y: modificación de lista de reproducción.

source: Note that in Studio 5.20 and later, some of these (such as automation) uses Studio API.
es: Ten en cuenta que en Studio 5.20 y versiones posteriores, algunas de ellas (como la automatización) usan la api de Studio.

source: For example, if you press A to obtain automation status from Studio 5.10:
es: Por ejemplo, si pulsas la A para obtener el estado de la automatización en Studio 5.10:

source: 1. Invoke SPL Assistant, then press A.
es: 1. Se invoca al asistente de SPL, y luego se pulsa la A.

source: 2. The status function (object fetcher) is called, taking the status bar constant (SPLPlayStatus, which is 0) as the key to the index map.
es: 2. Se llama a la función de estado (recuperador de objetos), tomando la constante de la barra de estado (SPLPlayStatus, que es 0) como clave para el mapa de índices.

source: 3. Object fetcher will see if the status bar object (cache dictionary with the key of 0) has been cached. For this example, it isn't.
es: 3. El recuperador de objetos comprobará si el objeto de la barra de estado (diccionario de la caché, clave 0) está cacheado. En este ejemplo, no lo está.

source: 4. Seeing that the status bar isn't cached, object fetcher will now look at the index map and will decide which column to read (for this example, it is column 2 (index 1)). The column records the child position of the status bar relative to the foreground window (in our case, index is 6 or the seventh child).
es: 4. Al ver que la barra de estado no está en caché, el recuperador de objetos mirará ahora el mapa de índices y decidirá qué columna va a leer (en este ejemplo, es la columna 2 (índice 1)). La columna registra la posición de la barra de estado hija relativa a la ventana en primer plano (en nuestro caso, se trata del séptimo hijo con índice 6).

source: 5. Once the child object position index is obtained, object fetcher will locate the actual object and cache it (self._cachedStatusObjs[infoIndex] = fg.children[statusObj]), then returns the object to the automation announcement routine.
es: 5. Una vez se obtiene el índice de la posición del objeto hijo, el recuperador de objetos ubicará el objeto real y lo meterá en caché (self._cachedStatusObjs[infoIndex] = fg.children[statusObj]), y luego devolverá este objeto a la función de verbalización de automatización.

source: 6. Back at the script routine, NVDA will be reminded that it needs to look at one of the object's children (status bars can contain child objects if exposed by accessibility API's), then will announce one of it's contents (second child object, which records automation status).
es: 6. De vuelta en la función del script, se le recordará a NVDA que debe mirar uno de los objetos hijo (las barras de estado pueden contener objetos hijos si las apis de accesibilidad lo exponen así), y luego verbalizará uno de sus contenidos (segundo objeto hijo, que registra el estado de la automatización).

source: In Studio 5.20 and later:
es: En Studio 5.20 y posteriores:

source: 2. Calls Studio API to retrieve the given status flag (in this case, 1, which records automation status).
es: 2. Se llama a la api de Studio para recuperar el indicador de estado dado (en este caso es el 1, que registra el estado de automatización).

source: 3. A lookup table with possible status bar messages is then consulted, and the appropriate message based on status flag and value is retrieved and announced.
es: 3. Después, se consulta una tabla de búsqueda con posibles mensajes de la barra de estado, y se recupera y verbaliza el mensaje apropiado basándose en el indicador de estado y el valor.

source: Not all status bar messages will use Studio API and status messages table. The lone exception is cart mode status, which requires consulting two flag values returned by Studio to construct the actual announcement (cart edit mode on/off and whether cart insert mode is active).
es: No todos los mensajes de la barra de estado usarán la api de Studio y la tabla de mensajes de estado. Una excepción es el estado del modo de carts, para el que es necesario consultar dos valores devueltos por Studio para construir el mensaje verbalizado finalmente (modo de edición de carts activado o desactivado y si el modo de edición de carts está activado).

source: ##### Another side tour: Playlist Editor and object caching
es: ##### Otra visita complementaria: el editor de listas de reproducción y la caché de objetos

source: As noted above, part of object navigation commands in SPL Assistant involve object cache. This is necessary for performance reasons, as retrieving and navigating via objects is slow versus retrieving needed object from a cache, which is faster than manual object retrieval. This technique is frequently labeled "memoization" and is used to improve responsiveness if an important data is present somewhere for fast retrieval.
es: Como se ha observado antes, parte de las órdenes de navegación por objetos en el asistente de SPL involucran a la caché de objetos. Es necesaria por motivos de rendimiento, ya que recuperar los objetos y navegar por ellos es lento comparado con recuperar el objeto necesario de una caché, que es más rápido que una recuperación de objeto manual. Esta técnica se conoce frecuentemente como "memorización", y se usa para mejorar el rendimiento si hay datos importantes presentes en algún lugar y hay que recuperarlos deprisa.

source: Similar to SPL Assistant commands involving object navigation, Creator's Playlist Editor's status objects require caching because slowness of object navigation. Without caching, retrieving needed information will take seconds instead of fraction of a second. Just like Studio, cached information is cleared when Creator app module is terminated.
es: De forma similar a las órdenes del asistente de SPL que implican navegación por objetos, los objetos de estado del editor de listas de reproducción de Creator requieren una caché debido a la lentitud de la navegación por objetos. Sin caché, recuperar la información necesaria tomaría segundos en vez de fracciones de segundo. Al igual que en Studio, la información en caché se limpia cuando finaliza la ejecución del módulo de aplicación de Creator.

source: #### SPL Assistant 2: tools
es: #### Asistente de SPL 2: herramientas

source: These are miscellaneous commands in SPL Assistant, and three of them use Studio API:
es: Aquí hay órdenes varias del asistente de SPL, tres de ellas usan la api de Studio:

source: * D: Remaining time for the opened playlist.
es: * D: tiempo restante de la lista de reproducción abierta.

source: * K: Moves to a marked track. This was discussed in column routines and place marker sections.
es: * K: se mueve a una pista marcada. Ya se habló de esto en las secciones de procedimientos de columna y marcadores.

source: * Control+K: Sets track place marker. Consult the place marker section to learn how it works.
es: * Ctrl+k: sitúa un marcador de pista. Consulta la sección de marcadores para aprender cómo funciona.

source: * Shift+R: Library scan. This is a convenience function to start library scan in the background, useful if you have added new tracks from a number of folders via Studio Options dialog. Consult library scan section for details on library scan internals.
es: * Shift+r: escaneo de biblioteca. Esta es una función útil para iniciar un escaneo de biblioteca en segundo plano, viene bien si has añadido nuevas pistas desde una serie de carpetas mediante el diálogo de opciones de Studio. Consulta un artículo anterior sobre el escaneo de biblioteca para más detalles sobre el interior de esta característica.

source: * F8: Obtains playlist snapshot information for the currently loaded track, including track count, shortest and longest tracks and top artists. This feature uses a combination of Windows and Studio API's.
es: * F8: obtiene una instantánea con información de la lista de reproducción para la pista cargada actualmente, incluyendo la cantidad de pistas, pistas más cortas y más largas y artistas más populares. Esta función usa una combinación de las apis de Windows y Studio.

source: * Shift+F8: requests a playlist transcript (data about loaded playlist). Just like playlist snapshots, it uses a combination of object navigation and Windows API.
es: * Shift+f8: solicita una transcripción de lista de reproducción (datos sobre la lista de reproducción cargada). Al igual que las instantáneas de listas de reproducción, aquí se usa una combinación de la navegación de objetos y la API de Windows.

source: * F9: Marks the current position of the playlist as start of track time analysis (more on this feature below).
es: * F9: marca la posición actual de la lista de reproducción como inicio del análisis de tiempo de pista (se explica más sobre esto debajo).

source: * F10: Performs track time analysis (add-on 6.0).
es: * F10: realiza el análisis de tiempo de pista (complemento 6.0).
