Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/spladdoninternals.po
Languages: es

source: We'll learn how the alarm values are stored and retrieved in the configuration management section, and you'll get to meet how intro and outro alarms work in the next chapter.
es: Aprenderemos cómo se almacenan y recuperan los valores de la alarma en la sección de gestión de configuración, y sabrás cómo funcionan las alarmas de introducción y fin de pista en el próoximo capítulo.

source: #### Alarms Center
es: #### Centro de alarmas

source: Prior to introduction of Alarms category in SPL add-on settings, separate dialogs were used to configure various alarm settings. In reality, it was really one dialog class called Alarms Center that presented different settings based on an internal flag.
es: Antes de la introducción de la categoría de alarmas en las opciones del complemento SPL, se utilizaban diálogos separados para configurar diversas opciones de la alarma. En realidad, se trataba de una única clase de diálogo, llamada AlarmsCenter, que presentaba opciones diferentes en función de un indicador interno.

source: True to its name and function, Alarms Center not only housed end of track and track intro alarms, it included microphone alarm controls, and all that was needed to change its appearance was a single integer that specified which portion of the dialog was shown. In case of Alarms Center dialog presented from an older version of add-on settings (see a later chapter on add-on configuration), all alarm controls were shown (level = 0), with different levels controlling what controls were shown as follows:
es: Debido a su nombre y función, el centro de alarmas no sólo alojaba las alarmas de fin de pista e introducción de pista, incluía controles para la alarma del micrófono, y todo lo que hacía falta para modificar su apariencia era un único entero que especificaba qué partes del diálogo se mostraban. En el caso del diálogo del centro de alarmas presentado desde una versión antigua de las opciones del complemento (mira un capítulo posterior para más información sobre la configuración del complemento), se mostraban todos los controles de alarma (level=0), habiendo diferentes niveles que decidían que controles se mostraban de la siguiente forma:

source: * 0: Alarms Center, displays all controls.
es: * 0: centro de alarmas, muestra todos los controles.

source: * 1: End of track alarm.
es: * 1: alarma de fin de pista.

source: * 2: Track intro alarm.
es: * 2: alarma de introducción de pista.

source: * 3: Microphone alarm controls.
es: * 3: controles de la alarma del micrófono.

source: Alarms Center was removed in 2020 in favor of standardizing around alarm settings category.
es: El centro de alarmas se eliminó en 2020 en favor de una estandarización alrededor de la categoría de opciones de alarma.

source: ### Toggle settings
es: ### Conmutar ajustes

source: StationPlaylist add-on comes with some toggle settings that affect the operation of the app module. These include library scan announcement (Alt+NVDA+R) and braille timer (Control+Shift+X). For each setting script, NVDA will first check the current value, change the value and announce the new value.
es: El complemento StationPlaylist viene con algunos ajustes conmutables que afectan a la forma de operar del módulo de aplicación. Estos incluyen anuncio de escaneo de biblioteca (alt+NVDA+r) y temporizador braille (ctrl+shift+x). Para cada script de configuración, NVDA primero comprobará el valor actual, cambiará el valor y anunciará el nuevo valor.

source: ## Event handling: announcing status changes, activating alarms and more
es: ## Procesamiento de eventos: verbalización de cambios de estado, activación de alarmas y más

source: When you are producing a live show, it is important for your screen reader to announce various status changes and happenings such as number of listeners, outro notification, playback status, alerting you of listener requests and so on. NVDA is an expert when it comes to handling status changes, activating alarms and more. In this section, we'll learn the magic behind this expertise: handling events.
es: Cuando produces un programa en vivo, es importante que tu lector de pantalla verbalice diversos cambios de estado y sucesos como número de oyentes, notificación de fin de pista, estado de la reproducción, alertas sobre peticiones de oyentes y demás. NVDA es un experto cuando se trata de manejar cambios de estado, activar alarmas y más. En esta sección, conoceremos la magia que hay tras esta profesionalidad: el procesamiento de eventos.

source: ### NVDA is event-driven
es: ### NVDA está dirigido por eventos

source: Windows applications (especially those using Windows API) are event-driven programs. Somewhere in the application is an event loop that responds to various events, such as when a check box is clicked, computer is shutting down and so on. NVDA, being a Windows screen reader, does use events for various purposes, ranging from announcing new chat notification in Skype to ignoring it completely.
es: Las aplicaciones de Windows (especialmente aquellas que usan la api de Windows) son programas dirigidos por eventos. En algún lugar de la aplicación hay un bucle que responde a diversos eventos, tales como cuando se hace clic en una casilla de verificación, el ordenador se está apagando y demás. NVDA, al ser un lector de pantalla, usa los eventos con diversos propósitos, desde verbalizar una notificación de nuevo chat en Skype hasta ignorarlo completamente.

source: To handle various events, NVDA uses an event queue (queue handler) and an event handler for event processing. When an event is fired by itself or from other programs, NVDA first checks if the given event is worthy of its attention. Then it performs actions associated with the event, such as announcing changes to a control (name, value, etc.), playing beeps and sounds (progress bar updates) and so on. For add-ons (mostly global plugins and app modules), NVDA is eager to listen to certain events and let controls fire events.
es: Para manejar distintos eventos, NVDA usa una cola de eventos (queueHandler) y un manejador de eventos para procesarlos. Cuando un evento se dispara desde NVDA o desde otros programas, NVDA primero comprueba si dicho evento es digno de su atención. A continuación realiza acciones asociadas con el evento, como verbalizar los cambios de un control (nombre, valor, etc.), reproducir pitidos y sonidos (actualizaciones de una barra de progreso) y así sucesivamente. Para los complementos (mayoritariamente extensiones globales y módulos de aplicación), NVDA tiene ganas de escuchar ciertos eventos y dejar que los controles los disparen.

source: Typically, an event handling routine is declared like this:
es: Normalmente, un procedimiento para manejar un evento se declara de la siguiente manera:

source: event_eventname(module, object in question, next handler)
es: event_nombredeevento(módulo, objeto en cuestión, siguiente manejador)

source: For example, for Studio app module, one event handler declared is gain focus (you have moved to a different control), and is written as follows:
es: Por ejemplo, para el módulo de aplicación de Studio, un manejador de eventos declarado es gainFocus (te has movido a un control diferente), y está escrito así:

source: The routine is just like any other function (callable) except that the routine called nextHandler function at the end to allow other controls to respond to events.
es: El procedimiento es como cualquier otra función (llamable) salvo porque se llama al procedimiento nextHandler al final para permitir a otros controles responder a eventos.

source: ### What does events have to do with Studio app module?
es: ### ¿Qué tienen que hacer los eventos con el módulo de aplicación de Studio?

source: Events and event handlers are crucial to the operation of the Studio app module, described as "heartbeat" of the add-on. Events and their handlers are used to perform bulk of the work required to allow the app module to function. These include:
es: Los eventos y los manejadores de eventos son cruciales en el funcionamiento del módulo de aplicación de Studio, descrita como "los latidos del corazón" del complemento. Los eventos y sus manejadores se usan para hacer la mayoría del trabajo necesario para que el módulo de aplicación funcione. Entre ellos se incluyen:

source: * Announcing status changes such as when microphone is turned on or off.
es: * Verbalización de cambios de estado tales como cuando el micrófono se enciende o se apaga.

source: * Alarm notification, such as when end of intro is approaching.
es: * Notificación de alarma, como la que hay cuando se acerca el final de una pista.

source: * Activating certain announcement and background tasks such as activating microphone alarm, announcing library scan progress and more.
es: * Activación de ciertas verbalizaciones y tareas en segundo plano como la alarma del micrófono, el anunciado del progreso de escaneado de la biblioteca y más.

source: * Perform workarounds for issues such as focus problems when deleting a track.
es: * Aplicar solución a algunos problemas como los que da el foco al eliminar una pista.

source: Of all the event handlers declared, the most important one is name change event. It is declared as follows:
es: De todos los manejadores de eventos declarados, el más importante es el evento de cambio de nombre. Se declara de la siguiente manera:

source: When this event is fired by Studio, NVDA performs following operations:
es: Cuando Studio dispara este evento, NVDA hace las siguientes operaciones:

source: 1. Various checks are performed. These include, but are not limited to:
es: 1. Se realizan diversas comprobaciones. Estas incluyen, pero no se limitan a:

source: 1. Make sure there is something to announce.
es: 1. Asegurarse de que hay algo que verbalizar.

source: 2. If using another app, NVDA will ensure that background monitor flag is set (see the discussion on app module constructor in previous sections for more details).
es: 2. Si se está usando otra aplicación, NVDA se asegurará de que el indicador de monitorización en segundo plano esté establecido (mira la exposición en el constructor del módulo de aplicación en artículos anteriores para más detalles).

source: 3. If the status to be announced is a common one such as listener count, schedule and cart playback status, NVDA will check if it is permited to announce them.
es: 3. Si el estado a ser verbalizado es un estado común, como número de oyentes, estado de la programación y reproducción del cart, NVDA comprobará si tiene permitido verbalizarlo.

source: 2. Depending on the type of control (mostly window class name), NVDA performs different operations (see below).
es: 2. Dependiendo del tipo de control (mayoritariamente nombre de la clase de ventana), NVDA realiza distintas operaciones (mira más abajo).

source: 3. Lastly, NVDA calls nextHandler() to let other controls respond to name change event.
es: 3. Finalmente, NVDA llama a nextHandler() para dejar que otros controles respondan al evento de cambio de nombre.

source: ### Status announcements versus alarm notification
es: ### Anuncios de estado comparados con notificaciones de alarma

source: There are two groups of controls NVDA is interested in: status bar and status text with window class name of TStatusBar and TStaticText, respectively (Studio is a Delphi application). Depending on which control fired the event, NVDA will respond differently.
es: Hay dos grupos de controles en los que NVDA está interesado: la barra de estado y el texto de estado, con nombres de clase de ventana TStatusBar y TStaticText, respectivamente (Studio es una aplicación Delphy). Dependiendo del control que dispare el evento, NVDA reaccionará de forma diferente.

source: For status announcements (TStatusBar), NVDA:
es: Para anuncios de estado (TStatusBar), NVDA:

source: 1. Checks IAccessible child ID (position of the control relative to the parent control as exposed by MSAA (Microsoft Active Accessibility)/IAccessible).
es: 1. Comprueba el ID del hijo de IAccessible (posición del control relativa al control padre tal y como expone MSAA (Microsoft Active Accessibility) / IAccessible).

source: 2. If IAccessible child ID is 1, it either announces library scan progress or playback status.
es: 2. Si el identificador del hijo de IAccessible es 1, se verbaliza el progreso del escaneo de la biblioteca o bien el estado de la reproducción.

source: 3. For other status bar objects (controls or windows), NVDA first checks if it is a toggle change (ends with "On" or "Off"), and if so, it does the following:
es: 3. Para otros objetos de la barra de estado (controles o ventanas), NVDA primero comprueba si es un cambio de conmutación (acaba en "on" o "off"), y si es así, hace lo siguiente:

source: 1. If you set status announcement to words, NVDA announces toggle change notification via speech.
es: 1. Si estableces la verbalización de estado en palabras, NVDA verbaliza la notificación de cambio de conmutación mediante voz.

source: 2. If status announcement is set to beeps, an appropriate wave file is selected for playback via NVWave module (nvwave.playWaveFile; this is done via messageSound function).
es: 2. Si la verbalización de estado se ha establecido en pitidos, se selecciona un archivo wav adecuado y se reproduce mediante el módulo NVWave (nvwave.playWaveFile; esto se hace mediante la función messageSound).

source: 3. Braille output is not affected - it'll announce toggle changes.
es: 3. La salida braille no se ve afectada, se anunciarán los cambios de conmutación.

source: 4. For cart edit mode or microphone toggle, extra steps are performed, (by calling extraAction method with the status string as the argument) such as activating microphone alarm or announcing that you are using Cart Explorer (if this is the case). We'll come back to how this works in future installments.
es: 4. Para el modo de edición de cart o la conmutación del micrófono, se realizan pasos extra, (llamando al método extraAction con la cadena de estado como argumento), como activar la alarma del micrófono o indicar que estás usando el explorador cart (si es el caso). Volveremos a explicar cómo funciona esto en futuras entregas.

source: 4. For all other announcements, NVDA announces them. In case of schedule announcement, to prevent itself from repeating the same message, NVDA checks if a cached name is the same as the just changed name.
es: 4. Para todos los demás anuncios, NVDA los verbaliza. En el caso del anuncio de programación, para evitar que se repita el mismo mensaje, NVDA comprueba si el nombre cambiado es igual que un nombre guardado que ya tenía.

source: For static text controls (mostly used for alarm notifications):
es: Para controles de texto estático (mayormente usados para notificaciones de alarma):

source: 1. Checks whether NVDA is looking at remaining time for the intro or the whole track.
es: 1. Comprueba si NVDA está mirando el tiempo restante para la introducción o para la pista entera.

source: 2. For both cases, NVDA checks if it can braille this (braille timer is not off).
es: 2. En ambos casos, comprueba si NVDA puede emitirlo por braille (el temporizador braille no está apagado).

source: 3. If NVDA is told to play or announce alarms (for outro and intro), NVDA plays appropriate tones (middle A (440 hertz) for outro, an octave above middle C (512 hertz) for intro), or if told to do so, warns you that end of track or intro is approaching (add-on 6.0 and later).
es: 3. Si NVDA está configurado para verbalizar o reproducir alarmas (para introducción y fin), NVDA reproduce los tonos apropiados (la mitad de (440 hz) para fin de pista, y una octava por encima de la mitad (512 hz) para la introducción), o si se le pide hacerlo, te avisa de que el fin de pista o la introducción está llegando (complemento 6.0 y posteriores).

source: The structure of event_nameChange function defined in the Studio app module is such that it can be extended to handle name change event for other controls (it is a tree structure, with the root being the event and two subtrees, one for the status bar and another for static text). Just like other add-ons that define event handling routines, name change event calls nextHandler().
es: La estructura de la función event_nameChange definida en el módulo de aplicación de Studio está hecha de tal manera que puede extenderse para manejar el evento de cambio de nombre para otros controles (es una estructura en árbol, siendo la raíz el evento y dos subárboles, uno para la barra de estado y otro para el texto estático). Al igual que en otros complementos que definen procedimientos para manejar eventos, el evento de cambio de nombre llama a nextHandler().

source: ### Other events defined in the Studio app module
es: ### Otros eventos definidos en el módulo de aplicación de Studio

source: There are five more events defined in the Studio app module. They are:
es: Hay cinco eventos más definidos en el módulo de aplicación de Studio. Son los siguientes:

source: * Gain focus: performs focus-related routines such as checking if you are in Insert Tracks dialog in order to turn off background library scanning (more on background library scan in a future installment).
es: * gainFocus: realiza procedimientos relacionados con el foco, tales como comprobar si estás en el diálogo de inserción de pistas para apagar el escaneo en segundo plano de la biblioteca (más sobre el escaneo de la biblioteca en segundo plano en una entrega futura).

source: * App module gain focus: Used to handle touchscreens (yes, Studio app module has a dedicated SPL touch mode) such as assigning additional commands.
es: * gainFocus del módulo de aplicación: usado para procesar pantallas táctiles (sí, el módulo de aplicación de Studio tiene un modo táctil dedicado para SPL) que permite añadir órdenes adicionales.

source: * App module lose focus: opposite of the event above.
es: * loseFocus (pérdida de foco) del módulo de aplicación: el opuesto al evento anterior.

source: * Show: this event is specifically designed to respond to listener requests, discussed below.
es: * Show (mostrar): este evento está diseñado específicamente para reaccionar a peticiones de oyentes, de las que hablaremos más abajo.

source: * Foreground: this is used to coordinate status bar content announcement when Studio starts.
es: * Foreground (primer plano): se usa para coordinar el anuncio del contenido de la barra de estado cuando se inicia Studio.

source: #### Listener requests
es: #### Peticiones de los oyentes

source: A seldom talked about component of StationPlaylist Studio is the ability to host a website with a PHP script to allow listeners to request tracks to be played by a broadcaster. When a request is made, Studio pops up a listener request dialog that lists requested tracks.
es: Un componente raro del que se habla en StationPlaylist Studio es la capacidad de alojar un sitio web con un script php para permitir a los oyentes pedir pistas para que el locutor las reproduzca. Cuando se hace una petición, Studio muestra un diálogo de petición del oyente que lista las pistas solicitadas.

source: Due to limitations of old NVDA releases, Studio app module did not have an easy way to detect the appearance of this dialog and notify you of listener requests. This is no longer the case, as NVDA allows show events to be registered for background event tracking. However, because anything can fire show events, tracking show events is not recommended. Knowing this, the Studio app module keeps an eye on show events for one and only one window: listener requests, represented by window class name of TRequests, with the only job assigned for this event handler being playing a sound when requests arrive provided that the requests pop-up option is set in Studio.
es: Debido a las limitaciones que había en antiguas versiones de NVDA, el módulo de aplicación de Studio no lo tenía fácil para detectar la aparición de este diálogo y notificarte las peticiones de los oyentes. Este ya no será más el caso, ya que NVDA permite registrar eventos de mostrar para rastrearlos en segundo plano. Sin embargo, ya que cualquier cosa puede disparar eventos de mostrar, rastrearlos no se recomienda. Sabiendo esto, el módulo de aplicación de Studio vigila los eventos de mostrar de una y sólo una ventana: peticiones de los oyentes, representada por el nombre de clase de ventana TRequests, siendo el único trabajo asignado para este manejador de eventos reproducir un sonido cuando las peticiones llegan, asumiendo que la opción de mostrar un globo cuando lleguen solicitudes esté activada en Studio.

source: So far, we have covered things that the app module performs wherever you are in Studio. the next few sections will cover how the app module handles specific situations, such as working with items in the playlist viewer, finding tracks, library scans and so on.
es: Hasta ahora, hemos cubierto cosas que realiza el módulo de aplicación independientemente de dónde estés en Studio. Las siguientes secciones cubrirán cómo el módulo de aplicación maneja situaciones específicas tales como trabajar con elementos en el visor de listas de reproducción, buscar pistas, escanear la biblioteca y mucho más.

source: ## Track items, overlay classes and Track Finder
es: ## Elementos de pista, clases de superposición y buscador de pistas

source: While using the add-on, you may have noticed that you can perform certain commands while focused on track items, and that the command to find tracks is same as that of find command in web browsers. If you are curious about these, then this section will let you see how it works. But first, we need to go over some more facts about NVDA screen reader, this time we'll talk about objects.
es: Al usar el complemento, te habrás dado cuenta de que puedes ejecutar ciertas órdenes al tener el foco en los elementos de pista, y que la orden para buscar pistas es la misma que la de buscar en navegadores web. Si tienes curiosidad sobre todo esto, esta sección te permitirá ver cómo funciona. Pero primero, debemos hablar de algunos hechos más sobre el lector de pantalla NVDA, en esta ocasión hablaremos de objetos.

source: ### Important facts about NVDA's use of objects
es: ### Consideraciones importantes sobre el uso que hace NVDA de los objetos

source: One of the questions I and other add-on authors and NVDA developers received was, "what exactly are objects and how are they used in NVDA?" In programming, an object is instance of the object definition coming to life (this definition, called a "class", defines how certain things behave and how information can be retrieved from this object by other parts of the program; the programming paradigm that uses classes and related concepts is termed "object-oriented programming"). For example, someone may say, "build me a phone book", and a programmer will think about how phone book entries are stored and come up with a "phone book" (an array of phone entries), all done via objects.
es: Una de las preguntas que hemos recibido tanto yo como otros programadores de complementos y desarrolladores de NVDA es, "¿Qué son exactamente los objetos y cómo se usan en NVDA?". En programación, un objeto es una instancia de la definición del objeto en tiempo de ejecución (esta definición, que se conoce como "clase", define cómo se comportan ciertas cosas y cómo recuperan la información de este objeto otras partes del programa; el paradigma de programación que usa clases y otros conceptos se llama "programación orientada a objetos"). Por ejemplo, alguien puede decir "Constrúyeme una guía telefónica", y un programador pensará cómo se almacenan las entradas de una guía de teléfonos y entregará una "guía telefónica" (un array de entradas de teléfono), toda ella hecha con objetos.
