Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/spladdoninternals.po
Languages: es

source: Ever since implementing Track Dial, some broadcasters requested adding support for moving through tracks vertically (as in reading specific columns just like moving to a different row in a table). This also resolved an issue where pressing Control+Alt+up/down arrow keys caused the monitor to flip upside down. This is achieved by asking SPLTrackItem.reportFocus to announce just the column the user wants when Control+Alt+up/down arrow is pressed, all controlled by a hidden class variable. This feature not only works for vertical column navigation - it is also used when a broadcaster requests only one column be announced, and the column to be announced can be customized (not to be confused with column announcement order routine discussed above).
es: Desde que se implementó el dial de pista, algunos locutores solicitaron añadir soporte para moverse verticalmente por las pistas (como leer columnas específicas pero moviéndose a una fila diferente como en una tabla). Esto también resolvió un problema por el que al pulsar las teclas ctrl+alt+flechas arriba y abajo causaba que el monitor diera vueltas. Esto se hace pidiéndole a SPLTrackItem.reportFocus que verbalice la columna que el usuario quiere al pulsar ctrl+alt+flechas arriba y abajo, todo controlado por una variable de clase oculta. Esta característica no sólo funciona con la navegación vertical de columnas - también se usa cuando un locutor solicita que sólo se anuncie una columna, y la columna a ser verbalizada puede personalizarse (no hay que confundirse con el procedimiento de orden de verbalización de columnas expuesto arriba).

source: Vertical column navigation was simplified in 2020 by using routines found in SysListView32 list item class directly. Prior to 2020, custom vertical navigation routines were used, and for places other than playlist viewer, vertical column navigation was impossible. In 2020, vertical column navigation routines from SysListView32 are used, which also introduced vertical navigation to places such as Track Tool.
es: La navegación vertical por columnas se simplificó en 2020 utilizando procedimientos localizados en la clase de elemento de lista SysListView32 directamente. Antes de 2020 se usaban procedimientos personalizados para la navegación vertical por columnas, y en lugares distintos al visor de listas de reproducción la navegación vertical por columnas era imposible. En 2020, se usan los procedimientos de navegación vertical por columnas de SysListView32, lo que hizo posible que la navegación vertical por columnas llegara a lugares como la herramienta de pista.

source: #### Track Tool and Creator: one routine, multiple app modules
es: #### Herramienta de pista y Creator: un procedimiento, múltiples módulos de aplicación

source: Column retriever routine is not only employed by Studio app module, but is also used in Track Tool and Creator app modules (part of the add-on). These app modules (specifically, track item classes) uses column retriever for reviewing column data via table navigation commands and announcing column information (Control+NVDA+1 through 0, now termed Columns Explorer for Track Tool/SPL Creator).
es: El procedimiento de recuperación de columnas no sólo se emplea en el módulo de aplicación de Studio, sino que también se usa en los módulos de aplicación de la herramienta de pista y de Creator (parte de este complemento). Estos módulos de aplicación (específicamente, las clases de elemento de pista) usan el recuperador de columnas para revisar los datos de columna mediante órdenes de navegación por tablas y anunciar la información de columna (ctrl+NVDA+números del 1 al 0, ahora llamado explorador de columnas en la herramienta de pista y en SPL Creator).

source: #### Playlist editor: column navigation keeps expanding
es: #### Editor de listas de reproducción: la navegación por columnas continúa expandiéndose

source: Creator comes with Playlist Editor, a tool to manage locally generated playlists. Remote VT client also comes with a dedicated playlist editor but is designed to edit playlists stored remotely. Track items shown on the playlist editor window are indeed SPL track items, and as such they support column navigation. Because they only come with up to 8 columns, there is no need to provide custom Columns Explorer feature for these items. Other than that, it supports other column announcement and navigation features found in other track items.
es: Creator viene con el editor de listas de reproducción, una herramienta para gestionar listas de reproducción generadas localmente. Remote VT también viene con un editor de listas de reproducción dedicado, pero está diseñado para editar listas de reproducción almacenadas en remoto. Los elementos de pista mostrados en la ventana del editor de listas de reproducción son elementos de pista de SPL, y por tanto soportan la navegación por columnas. Ya que sólo vienen con hasta 8 columnas, no hay necesidad de proporcionar la función personalizada de explorador de columnas en estos elementos. Aparte de eso, soporta otras características de anuncio y navegación por columnas disponibles en los demás elementos de pista.

source: ### Few remarks
es: ### Unas pocas notas

source: Of all the features in the StationPlaylist add-on, column navigation is one of my favorites (besides Cart Explorer and encoder support and others). I enjoyed working with this routine and learned a few things about Windows API, as well as open possibilities not previously explorered before, such as Track Tool and Column Search. I hope that you'll find column navigation commands to be useful in your broadcasts.
es: De todas las características del complemento de StationPlaylist, la navegación por columnas es una de mis favoritas (además del explorador cart, y el soporte para el codificador, y otras). Disfruté trabajando con este procedimiento y aprendí unas pocas cosas sobre la api de Windows, así como abrí posibilidades que no se habían explorado antes, como la herramienta de pista o la búsqueda por columnas. Espero que encuentres útiles las órdenes de navegación por columnas en tus emisiones.

source: I would like to take this time to answer a question posed by some users and developers: Can NVDA be ported to other operating systems? No. The above column retriever routine is a prime example why this cannot be done easily: different operating systems use different API's, and porting NonVisual Desktop Access to other operating systems will involve significant architectural changes to use the new API's. In case of ReactOS, this isn't possible, as there are no stable foundation from which NVDA screen reader can exercise its full rights: accessibility API's are needed, stable driver development framework is needed, ability to run a program as a service must be ready and so on. Add to the fact that we have several add-ons relying on Windows API (including this add-on) and you'll see the huge work involved in an attempt to port NVDA to other operating systems.
es: Me gustaría aprovechar para responder una pregunta realizada por algunos usuarios y desarrolladores: ¿puede llevarse NVDA a otros sistemas operativos? No. El procedimiento de recuperación de columnas de arriba es un buen ejemplo de por qué no puede hacerse esto fácilmente: los diferentes sistemas operativos usan apis distintas, y llevar NVDA a otros sistemas operativos implicaría cambios significativos de la arquitectura para usar las nuevas apis. En el caso de ReactOS, no es posible, ya que no hay una base estable sobre la que NVDA pueda ejercer completamente todos sus derechos: hacen falta apis de accesibilidad, hace falta un marco de trabajo estable para el desarrollo de controladores, debe estar lista la capacidad de ejecutar un programa como servicio y muchas otras cosas. A eso añadimos el hecho de que tenemos varios complementos que se apoyan en la api de Windows (incluyendo este). Te imaginarás el enorme trabajo que implica intentar llevar NVDA a otros sistemas operativos.

source: ## Microphone alarm and library scan: threads, threads and more threads
es: ## Alarma del micrófono y escaneo de biblioteca: hilos, hilos y más hilos

source: Of all the work done on this add-on, one of them stands out the most: background tasks. I spent many hours and months perfecting this concept, read documentation on this feature and learned a lot through this experience. Today, this work is used in various parts of the Studio app module and beyond, and we'll take a look at two most important results of this work: library scan and microphone alarm.
es: De todos los trabajos hechos en este complemento, uno de ellos destaca sobre los demás: las tareas en segundo plano. Invertí muchas horas y meses perfeccionando este concepto, leí documentación sobre esta característica y aprendí un montón a través de esta experiencia. Hoy, se emplea este trabajo en diversas partes del módulo de aplicación de Studio y más allá, y echaremos un vistazo a dos resultados de los más importantes de este trabajo: el escaneo de biblioteca y la alarma del micrófono.

source: ### Brief feature overview
es: ### Breve descripción de las características

source: When you are producing a live show, you may forget that your microphone is active. The microphone alarm feature lets NVDA notify you if microphone has been active for a while. This happens even if you are using another program.
es: Cuando estás haciendo un programa en directo, puedes olvidarte de que el micrófono está activo. La característica de alarma de micrófono hace que NVDA pueda notificarte si el micrófono ha estado activado durante un rato. Esto sucede incluso si estás utilizando otro programa.

source: Library scan comes in handy when you want to see the progress of a background library scan. Typically, you would initiate library scans from Insert Tracks dialog (press Control+Shift+R). NVDA will then tell you how the scan is going, and if you close Insert Tracks dialog, NVDA will continue to monitor library scans in the background.
es: El escaneo de biblioteca viene bien cuando quieres ver el progreso de un escaneo de biblioteca en segundo plano. Normalmente, iniciarías los escaneos de biblioteca desde el diálogo de inserción de pistas (pulsa ctrl+shift+r). NVDA te dirá entonces cómo va el escaneo, y si cierras el diálogo de inserción de pistas, NVDA continuará monitorizando el escaneo de la biblioteca en segundo plano.

source: But there's more to it than a simple description when it comes to looking at internals of these features. As you'll see, these features use a concept that is gaining traction: running multiple tasks at once, or at least try to emulate it. We'll visit this concept first before returning to our regularly scheduled program of describing the internals of the two features above.
es: Pero hay mucho más que una simple descripción cuando llega el momento de mirar en el interior de estas características. Como verás, estas funciones usan un concepto que está ganando fuerza: ejecutar múltiples tareas a la vez, o al menos intentar emularlo. Visitaremos este concepto primero antes de volver a nuestro programa original de describir el interior de las dos características de arriba.

source: ### Recent trends in computing: more and more processors in a single computer
es: ### Tendencias recientes en computación: más y más procesadores en un único ordenador

source: Years ago, people thought a single core CPU was enough to run multiple programs. This involved the processor spending small fraction of a second devoted to each program. Nowadays, it has become common to see desktops, laptops, smartphones and other small devices using at least two cores (termed multi-core; two cores is dubbed "dual core"). As of 2020, many computers use processors with four cores (dubbed "quad core"), while enthusiasts prefer more cores (it is common nowadays to see PC's and servers boasting upwards of ten cores or more).
es: Hace años, la gente pensaba que una CPU de un único núcleo era suficiente para ejecutar múltiples programas. Esto implicaba que el procesador invertía una pequeña fracción de segundo exclusivamente a cada programa. Hoy en día, es común ver ordenadores de sobremesa, portátiles, smartphones y otros pequeños dispositivos que tienen al menos dos núcleos (llamados multi-core; con dos núcleos se llama "dual core"). En 2020, muchos ordenadores disponen de procesadores con cuatro núcleos (llamados "quad core"), mientras que los entusiastas prefieren más núcleos (es común hoy en día ver ordenadores y servidores que tienen diez núcleos o más).

source: Despite the fact that many computers come equipped with multi-core processors, not all programs take advantage of this. Python interpreter is one of those programs, and since NVDA is a Python-based screen reader and due to its operational architecture, many of its operations cannot take advantage of multiple processors. Fortunately, Python provides a way to simulate this - run certain tasks in the background, and this is utilized by NVDA and some of its add-ons as you'll see in this section on library scan and microphone alarm.
es: A pesar del hecho de que muchos ordenadores vienen equipados con procesadores de múltiples núcleos, no todos los programas aprovechan las ventajas de esto. El intérprete Python es uno de esos programas, y ya que NVDA es un lector de pantalla basado en Python y debido a su arquitectura operativa, muchas operaciones no pueden aprovechar la ventaja de tener múltiples procesadores. Por suerte, Python proporciona una manera de simular esto - ejecutar ciertas tareas en segundo plano, que tanto NVDA como algunos complementos utilizan como podrás comprobar en este artículo sobre el escaneo de la biblioteca y la alarma del micrófono.

source: ### A gentle introduction to threads: multiple tasks at once
es: ### Una introducción suave a los hilos: varias tareas a la vez

source: During normal business hours, a program will run from beginning to end with some interuptions (keyboard input, switching to a different part of the program and so on). However, there are times when the program will need to work with many things simultaneously, such as calculating distance between many points, adding multiple numbers at once, comparing many pairs of strings and so on. Fortunately, a mechanism called threads allow a program to do multiple things simultaneously.
es: Durante las horas laborables, un programa se ejecutará de principio a fin con algunas interrupciones (entrada por teclado, cambiar a una zona diferente del programa y demás). Sin embargo, hay veces en las que el programa necesitará trabajar con muchas cosas simultáneamente, como calcular la distancia entre muchos puntos, sumar varios números a la vez, comparar muchos pares de cadenas y demás. Por suerte, un mecanismo llamado hilos permite que un programa haga muchas cosas simultáneamente.

source: A thread is a procedure independent of other tasks. If one thread is busy with something, other threads can work on other tasks. The best analogy is multiple bank tellers in a bank: customers can talk to different tellers, with one teller working on updating customer records for a customer while another customer discusses fraudulent credit card charges with a different teller.
es: Un hilo es un procedimiento independiente de otras tareas. Si un hilo está ocupado con algo, otros hilos pueden trabajar en otras tareas. La mejor analogía es varios banqueros en un banco: los clientes pueden hablar con diferentes banqueros, con un banquero actualizando los registros de un cliente mientras otro cliente discute sobre cargos en la tarjeta de crédito fraudulentos con otro banquero.

source: A thread can be involved with parts of a task, devoted to a single task or multiple tasks. For example, an antivirus program could have multiple threads (workers) working independently of each other. One worker can display the overall progress of a scan, while other threads can scan multiple drives at once, with each thread devoted to scanning files and folders on separate drives. In NVDA world, multiple workers are involved to perform various tasks, including making sure NVDA is responsive, handling browse mode in different web browsers and so on.
es: Un hilo puede implicarse en partes de una tarea, dedicarse a una tarea única o varias tareas. Por ejemplo, un programa antivirus podría tener varios hilos (trabajadores) trabajando independientemente unos de otros. Un trabajador puede mostrar el progreso general de un análisis, mientras que otros hilos pueden analizar varias unidades a la vez, donde cada hilo se dedica a analizar exclusivamente los archivos y carpetas de una unidad. En el mundo de NVDA, varios trabajadores están implicados en llevar a cabo diversas tareas, incluyendo asegurarse de que NVDA está adaptado, procesar el modo exploración en distintos navegadores web y demás.

source: ### Threads: a more geeky introduction
es: ### Hilos: una introducción más jeek

source: A thread (sometimes termed "thread of execution) is an independent path of execution. A single process (app) can have as many threads as it desires (minimum is one for the main thread). Each thread can be asked to perform certain operations with other threads in parallel, which can range from a single, repetitive task (part of a function) to being responsible for an entire module or a significant part of the program. In case of antivirus example above, each scanner thread is responsible for scanning an entire drive, with each of them reporting its progress to a manager thread which displays overall progress of a virus scan.
es: Un hilo (a veces llamado "hilo de ejecución") es un camino independiente de ejecución. Un único proceso (aplicación) puede tener tantos hilos como desee (el mínimo es uno para el hilo principal). Se puede pedir a cada hilo que haga ciertas operaciones con otros hilos en paralelo, que pueden variar desde una única tarea repetitiva (parte de una función) hasta ser responsables de un módulo entero o una parte significativa del programa. En el ejemplo anterior del antivirus, cada hilo del analizador es responsable de analizar una unidad entera, y cada uno informa su progreso a un hilo administrador que muestra el progreso total del análisis de virus.

source: Using threads means each thread can execute on a processor core on a multi-core system. Because of this, many people would want many programs to take advantage of this and finish their jobs faster. However, threads introduce disadvantages, namely many days spent designing careful coordination routines between threads, preventing attempts by multiple threads to change a critical value that a manager thread depends on (called race condition) and so forth.
es: Usar hilos significa que cada hilo puede ejecutarse en un núcleo del procesador en un sistema multinúcleo. Por este motivo, mucha gente querría que muchos programas aprovecharan las ventajas de esta tecnología y finalizaran sus trabajos más rápido. Sin embargo, los hilos presentan desventajas, normalmente muchos días invertidos en diseñar cuidadosamente procedimientos de coordinación entre hilos, evitar intentos de múltiples hilos para que no intenten cambiar un valor crítico del que depende un hilo gestor (fallo conocido como condición de carrera) y demás.

source: ### Python's way of managing threads and the threading module
es: ### El módulo threading y la forma que tiene Python de gestionar los hilos

source: Python interpreter (and programs which uses them, including NVDA) is not exactly multithreaded. Because of internal issues, Python uses so-called global interpreter lock to prevent multiple threads from messing with each other. One way to bring true parallelism in Python is use of multiprocessing module (multiple Python interpreters, each one devoted to a single task), which has its own advantages and drawbacks (NVDA does not ship with multiprocessing module in the first place).
es: El intérprete Python (y los programas que lo usan, incluido NVDA) no es exactamente multihilo. Debido a problemas internos, Python usa algo llamado bloqueo global del intérprete para evitar que varios hilos tengan conflictos entre sí. Una forma de traer el paralelismo real a Python es usar el módulo multiprocessing (varios intérpretes Python, cada uno dedicado a una tarea), que tiene sus propias ventajas y desventajas (la primera, que NVDA no viene con el módulo multiprocessing integrado).

source: To manage threads, Python programs (including NVDA) use Python's threading module. This library includes various ways of managing threads, including defining which function can execute in a separate thread, coordinating sharing of information between threads (locks, semaphores (resource access counter) and so on), and letting a thread run its task after waiting for a while (called timers). Even with multiple threads defined, NVDA is mostly single-threaded (serial execution).
es: Para gestionar hilos, los programas en Python (incluido NVDA) usan el módulo threading de Python. Esta biblioteca incluye varias formas de gestionar hilos, incluida la de definir qué función se ejecutará en un hilo separado, coordinación de la información compartida entre hilos (cerrojos, semáforos (contador de accesos al recurso) y demás), y dejar que un hilo ejecute su tarea tras esperar un rato (temporizadores). Incluso con varios hilos definidos, NVDA es mayoritariamente de un solo hilo (ejecución en serie).

source: To use threads, a programmer will define the thread type (regular thread, timer and so on), define some properties and tell the thread which routine to execute. Once the thread is defined, the start (thread.start) method is called to let the thread do its work.
es: Para usar hilos, un programador definirá el tipo de hilo (hilo regular, temporizador y demás), definirá algunas propiedades e indicará al hilo qué procedimiento debe ejecutar. Una vez el hilo está definido, se llama al método de inicio (thread.start) para hacer que el hilo haga su trabajo.

source: ### Threads in Studio app module
es: ### Hilos en el módulo de aplicación de Studio

source: For the most part, Studio app module uses only one thread (NVDA's main thread) to do its job. However, there are times when multiple threads are used - up to three can be active at a time: NVDA's main thread (announcing status changes, alarms, Cart Explorer and others), microphone alarm (a timer) and library scan (a background thread). Another situation threads are used is when background encoder monitoring is enabled (see the encoder routines section for details and use of threads there).
es: La mayoría del módulo de aplicación de Studio usa sólo un hilo (el hilo principal de NVDA) para hacer su trabajo. Sin embargo, hay veces en que se usan varios hilos - puede haber hasta tres hilos activos al mismo tiempo: el hilo principal de NVDA (anunciando cambios de estado, alarmas, explorador cart y otras funciones), la alarma del micrófono (un temporizador) y el escaneo de biblioteca (un hilo en segundo plano). Otra situación en la que se usan hilos es cuando está activada la monitorización en segundo plano del codificador (mira el artículo de procedimientos del codificador para más detalles y uso de hilos allí).
