Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/spladdoninternals.po
Languages: es

source: * 21.06: compatibility with newer NVDA releases, type annotations and more robust source code. This is the last version with planned new features and bug fixes from me.
es: * 21.06: compatibilidad con versiones recientes de NVDA, anotaciones de tipos y código fuente más robusto. Esta es mi última versión planeada con nuevas funciones y fallos corregidos.

source: * 22.01: control types refactor, internal refinements to configuration management, remove profile caching mechanism as SSD technology has matured. This is the last release from me.
es: * 22.01: refactorización de controlTypes, refinamiento interno de gestión de la configuración, se elimina el mecanismo de caché de perfiles al encontrarse más madura la tecnología SSD. Esta es la última versión por mi parte.

source: Throughout this article, you'll get a chance to see how the add-on works, design philosophy and how the add-on is being developed, with glimpses into the past and future. My hope is that this add-on internals article would be a valuable reference for users and developers - for users to see the inner workings of this add-on, and for developers to use this add-on as an example of how an add-on is planned, implemented, tested, released and maintained.
es: A lo largo de este artículo, tendrás una oportunidad para ver cómo funciona el complemento, la filosofía de diseño y cómo se desarrolla el complemento, con vistas al pasado y al futuro. Espero que este artículo de complementos vistos por dentro sea una referencia valiosa para usuarios y desarrolladores - para los usuarios, que vean los trabajos internos de este complemento, y para los desarrolladores, que usen este complemento como un ejemplo a la hora de planear, implementar, probar, publicar y mantener un complemento.

source: To download the add-on, go to https://addons.nvda-project.org/addons/StationPlaylist.en.html.
es: Para descargar el complemento, ve a la sección de complementos que se encuentra en nuestra web.

source: ## Design, code layout, layer sets and importance of Studio API and Studio window handle
es: ## Diseño, estructura del código, conjuntos de capas e importancia de la api de Studio y el manejador de ventana de Studio

source: ### Overall design and source code layout
es: ### Diseño general y del código fuente

source: StationPlaylist add-on for NVDA consists of seven app modules (including two app module packages) and a global plugin. Because Studio and Creator come with Track Tool for managing tracks, the add-on includes an app module for Track Tool in addition to the main app module package for Studio, as well as an app module for StationPlaylist Creator. A fourth app module for Voice Track Recorder is present which is used for event tracking purposes. Remote VT client is the fifth app module and is mainly used to support remote playlist editor. The other two app modules deal with Streamer and SPL DSP Engine, with SPL Engine being an app module package due to inclusion of encoders support module which is also used by Streamer.
es: El complemento de NVDA para StationPlaylist consta de siete módulos de aplicación (incluyendo dos de ellos en forma de paquete) y una extensión global. Ya que Studio y Creator vienen con la herramienta de pista para gestionar pistas, el complemento incluye un módulo de aplicación para la herramienta de pista además del módulo de aplicación principal para Studio, así como un módulo de aplicación para StationPlaylist Creator. Se encuentra presente un cuarto módulo de aplicación para la grabadora de pistas de voz, usado con propósitos de seguimiento de eventos. El cliente Remote VT es el quinto módulo de aplicación, y se usa principalmente para dar soporte al editor remoto de listas de reproducción. Los otros dos módulos de aplicación tratan con el motor DSP de SPL y Streamer, siendo el módulo de aplicación del motor SPL un paquete debido a la inclusión del módulo de soporte de codificadores, que también utiliza Streamer.

source: The overall design is that of a partnership between the main Studio app module and the Studio Utilities (SPLUtils) global plugin. Studio app module performs things expected from scripts such as responding to key presses, announcing status information, configuration management and so forth, while the global plugin is responsible for running Studio commands from anywhere, and in older add-on releases, for encoder support (the add-on supports SAM, SPL, and AltaCast encoders). In reality, the global plugin is subordinate to the app module, as the app module controls overall functionality of the add-on and because the global plugin requires Studio to be running to unlock some features (here, unlock means using layer commands and parts of encoder support).
es: El diseño general es una relación entre el módulo de aplicación principal de Studio y la extensión global de utilidades de Studio (SPLUtils). El módulo de aplicación de Studio hace cosas que se esperan de los scripts, como reaccionar a pulsaciones de teclado, anunciar información de estado, gestión de configuración y todo eso, mientras que la extensión global es responsable de ejecutar órdenes de Studio desde cualquier sitio y, en versiones anteriores del complemento, del soporte de los codificadores (el complemento soporta los codificadores SAM, SPL y AltaCast). En realidad, la extensión global es subordinada del módulo de aplicación, ya que el módulo de aplicación controla la funcionalidad general del complemento y la extensión global necesita que Studio esté en funcionamiento para desbloquear algunas funciones (aquí, desbloquear significa usar la capa de órdenes y partes del soporte de codificadoresÇ).

source: When it comes to hierarchy of app modules, Studio app module package is ranked highest. This is because Studio app module is the oldest part of the add-on, and it provides base services and blueprints for other app modules. For instance, Creator and Track Tool rely on configuration facility provided by Studio app module package for Columns Explorer (explained later), and Voice Track (VT) Recorder app module cannot function properly without Studio app module running. Even though SPL Engine and Streamer are independent of Studio app module, they still require Studio app module to function (this is especially the case with SPL Engine, as Studio loads splengine.exe, the DSP Engine executable).
es: Si nos centramos en la jerarquía de los módulos de aplicación, el paquete del módulo de aplicación de Studio se encuentra en lo más alto. Esto se debe a que el módulo de aplicación de Studio constituye la parte más antigua del complemento, y proporciona servicios básicos y utilidades para otros módulos. Por ejemplo, Creator y la herramienta de pista se apoyan en las funciones de configuración proporcionadas por el paquete de módulo de aplicación de Studio para el explorador de columnas (explicado más tarde), y el módulo de aplicación de la grabadora de pistas de voz (vt) no puede funcionar adecuadamente si el módulo de aplicación de Studio no está en ejecución. Incluso aunque el motor de SPL y Streamer son independientes del módulo de aplicación de Studio, aún necesitan que el módulo de aplicación de Studio funcione (este es especialmente el caso del motor de SPL, ya que Studio carga splengine.exe, el ejecutable del motor DSP).

source: In short, all components of StationPlaylist add-on emphasize studio app module - although many components are independent of Studio, they still reference it for various reasons. Thus, Studio serves as the bridge that connects various add-on features together.
es: En resumen, todos los módulos del complemento de StationPlaylist enfatizan el módulo de aplicación de Studio - aunque muchos componentes son independientes de Studio, aún hacen referencia a él por diversas razones. Por tanto, Studio sirve como el puente que conecta diversas características del complemento entre sí.

source: The source code consists of:
es: El código fuente consta de:

source: * appModules: This folder contains the main splstudio (app module) package and the app modules for Track Tool, Creator, VT Recorder, Remote VT client, SPL DSP Engine (package), and Streamer.
es: * appModules: esta carpeta contiene el paquete (módulo de aplicación) principal splstudio y los módulos de aplicación para la herramienta de pista, Creator, la grabadora de pistas de voz, el cliente Remote VT, el motor DSP (paquete) y Streamer.

source: * The SPL Studio package consists of various modules, which include __init__ (main app module and track item classes), configuration manager and user interfaces (splconfig and splconfui) and miscellaneous services (splmisc) as well as support modules and various wave files used by the add-on.
es: * El paquete SPL Studio consta de varios módulos, en los que se incluyen __init__ (módulo de aplicación principal y clases de elemento de pista), el gestor de configuraciones y las interfaces de usuario (splconfig y splconfui) y servicios misceláneos (splmisc), así como módulos de soporte y diversos archivos wav usados por el complemento.

source: * The SPL Engine package consists of main Engine module and encoder support module.
es: * El paquete del motor de SPL consta del módulo del motor principal y el módulo de soporte del codificador.

source: * The main app module file is divided into sections. First, the overlay classes for track items are defined, then comes the app module, further divided into four sections: fundamental methods (constructor, events and others), time commands (end of track, broadcaster time, etc.), other commands (track Finder, cart explorer and others) and SPL Assistant layer. This allows me to identify where a bug is coming from and to add features in appropriate sections.
es: * El archivo del módulo de aplicación principal está dividido en secciones. Primero, se definen las clases de superposición para elementos de pista, después viene el módulo de aplicación, dividido en cuatro secciones: métodos fundamentales (constructor, eventos y otros), órdenes de tiempo (fin de pista, tiempo del locutor, etc.), otras órdenes (buscador de pista, explorador Cart y otros) y la capa de SPL Assistant. Esto me permite identificar de dónde viene un fallo y añadir características en las secciones apropiadas.

source: * globalPlugins: This folder contains SPLUtils module, consisting of main global plugin code and SPL Controller layer.
es: * globalPlugins: esta carpeta contiene el paquete SPLUtils, que consta del código de la extensión principal y la capa del controlador de SPL.

source: Note: until 2019, encoder support was part of SPL Utils. In 2020, it is part of SPL DSP Engine app module package.
es: Nota: hasta 2019, el soporte de codificadores era parte de las utilidades de SPL. En 2020, es parte del paquete del módulo de aplicación del motor DSP de SPL.

source: ### Design philosophy
es: ### Filosofía del diseño

source: When I set out to write the add-on in 2013, I put forth certain things the add-on should adhere to, including:
es: Cuando me puse a escribir el complemento en 2013, Puse en marcha ciertas cosas que el complemento debe cumplir, incluyendo:

source: * Consistency: The add-on should have a consistent interface and command structure. Interface includes various GUI's such as add-on configuration dialog. For layer commands, I tried using native Studio command assignments.
es: * Consistencia: el complemento debería tener una interfaz y estructura de órdenes consistente. La interfaz incluye varias GUI's como el diálogo de configuración del complemento. Para las órdenes de capa, intenté usar la asignación de órdenes nativa de Studio.

source: * Extensibility: The add-on should be organized and written in such a way that permits easy extensibility, hence the app module and the global plugin were divided into submodules, with each of them being a specialist of some kind (such as configuration management).
es: * Extensibilidad: el complemento debería estar organizado y escrito de tal manera que permita una fácil extensibilidad, y por esto el módulo de aplicación y la extensión global se dividieron en submódulos, cada uno de ellos especializado en una cosa concreta (como la gestión de la configuración).

source: * Separation of concerns: Coupled with extensibility, this allowed me to provide just needed commands at the right time, which resulted in two layer command sets (explained below).
es: * Separación de conceptos: junto con la extensibilidad, esto me permitió proporcionar las órdenes necesarias en el momento adecuado, lo que resultó en dos capas de conjuntos de órdenes (se explica más abajo).

source: * Easy to follow source code: Although some may say excessive documentation is a noise, I believe it is important for a developer to understand how a function or a module came about. Also, I have used and read user guides for other screen reader scripts to better understand how a feature worked and come up with some enhancements to a point where I found some major bugs with JAWS scripts (one of them, which I hope Brian patched by now is microphone alarm where the alarm would go off despite the fact that microphone was turned off before alarm timeout has expired).
es: * Código fuente fácil de seguir: aunque algunos puedan decir que la documentación excesiva es ruido, creo que para un desarrollador es importante entender cómo y por qué vino una función o módulo. También he usado y leído guías de usuario de scripts para otros lectores de pantalla para entender mejor cómo funcionaba una característica y hacerle algunas mejoras en puntos donde encontraba fallos graves, como con los scripts para JAWS (uno de ellos, que espero que Bryan haya parcheado por ahora, es la alarma de micrófono, donde la alarma se apagaría a pesar del hecho que el micrófono ya estaba apagado antes de que acabara la cuenta atrás de la alarma).

source: * Unique feature labels: One way to stand out was to give features interesting names. For instance, during add-on 3.0 development, I decided to give cart learn mode a name that better reflects what the feature does: Cart Explorer to explore cart assignments. Same could be set about NVDA's implementation of enhanced arrow keys (called Track Dial, as the feature is similar to flipping a dial on a remote control).
es: * Etiquetas únicas de características: una manera de destacar el complemento fue dar nombres interesantes a las características. Por ejemplo, durante el desarrollo del complemento 3.0, decidí dar al modo de aprendizaje de cart un nombre que reflejara mejor lo que hace esa función: explorador Cart para explorar las asignaciones de Cart. Lo mismo podría hacerse con la implementación de NVDA de las teclas de flecha mejoradas (llamada dial de pista, ya que esta función es similar a girar una ruleta en un mando a distancia).

source: * Extensive collaboration and feedback cycle between users and developers: I believed that the real stars of the show were not the add-on code files, but broadcasters who'll use various add-on features. Because of this, I worked with users early on, and their continued feedback shapes future add-on releases. This collaboration and feedback cycle also helped me (the add-on author) understand how the add-on was used and to plan future features to meet the needs of broadcasters who may use this add-on in various scenarios (a good example is broadcast profiles, as you'll see in add-on configuration section).
es: * Extenso ciclo de colaboración y retroalimentación entre usuarios y desarrolladores: yo creía que las auténticas estrellas del espectáculo no eran los archivos de código del complemento, sino los locutores que usarían diversas características del complemento. Por ello, trabajé con los usuarios desde bien temprano, y sus comentarios continuos dan forma a las versiones futuras del complemento. Este ciclo de colaboración y retroalimentación también me ayudó a mí (el autor del complemento) a entender cómo se usaba el complemento y a planear futuras características para satisfacer las necesidades de los locutores que pueden usar este complemento en diversos escenarios (un buen ejemplo son los perfiles de emisión, como verás en la sección de configuración del complemento).

source: ### Why two layer sets?
es: ### ¿Por qué dos capas de conjuntos?

source: When I first sat down to design the add-on, I knew I had to write both an app module and a global plugin (to perform Studio commands from anywhere), which led to defining two layer command sets for specific purposes:
es: Cuando al principio me senté a diseñar el complemento, ya sabía que tendría que escribir un módulo de aplicación y una extensión global (para ejecutar órdenes de Studio desde cualquier sitio), lo que llevó a definir dos capas de conjuntos de órdenes con propósitos específicos:

source: * SPL Assistant: This layer command set is available in the app module and is intended to obtain status information and to manage app module features. I called this Assistant because this layer serves as an assistant to a broadcaster in reading various status information. More details can be found later in this article.
es: * Asistente de SPL: esta capa de conjunto de órdenes está disponible en el módulo de aplicación y está pensada para obtener información de estado y para gestionar las características del módulo de aplicación. La llamé asistente porque esta carpa sirve como el asistente de un locutor al leer diversa información de estado. Se pueden encontrar más detalles más adelante en este artículo.

source: * SPL Controller: This layer is for the global plugin and performs Studio commands from anywhere. I called this "controller" because it controls various functions of Studio from other programs. More details will be provided below.
es: * Controlador de SPL: esta capa es para la extensión global y ejecuta órdenes de Studio desde cualquier parte. La llamé "controlador" porque controla varias funciones de Studio desde otros programas. Más abajo se darán más detalles.

source: In the early days, I enforced this separation, but in add-on 6.0, it is possible to invoke SPL Assistant layer by pressing the command used to invoke SPL Controller. In add-on 7.0, it is possible for SPL Assistant to emulate commands from other screen reader scripts, and the mechanics of it is covered later in this article.
es: En los primeros días reforcé esta separación, pero en el complemento 6.0 es posible invocar la capa del asistente de SPL pulsando la orden que se usa para invocar al controlador de SPL. En el complemento 7.0, es posible para el asistente de SPL emular órdenes de scripts para otros lectores de pantalla, y los mecanismos que lo permiten se cubren más adelante en este artículo.

source: ### The "magic" behind layer commands
es: ### La "magia" tras las órdenes de capa

source: In order for layer commands to work, I borrowed code from another add-on: Toggle and ToggleX by Tyler Spivey. Toggle/ToggleX allows one to toggle various formatting announcement settings via a layer command set. It works like this:
es: Para que las órdenes de capa funcionaran, tomé prestado código de otro complemento: Toggle y ToggleX, de Tyler Spivey. Toggle / ToggleX permite alternar varios ajustes de verbalización de formato a través de un conjunto de capa de órdenes. Trabaja de la siguiente manera:

source: * Dynamic Command:script binding and removal: It is possible to bind gestures dynamically via bindGesture/bindGestures method for an app module or a global plugin (bindGesture binds a single command to a script, whereas bindGestures binds commands to scripts from a gestures map or another container). To remove gesture map dynamically, the main/layer gestures combo was cleared, then the main gestures were bound.
es: * Orden dinámica: asociación y eliminación de script: es posible asociar gestos dinámicamente a través del método bindGesture / bindGestures para un módulo de aplicación o una extensión global (bindGesture asocia una única orden a un script, mientras que bindGestures asocia órdenes a scripts desde un mapa de gestos u otro contenedor). Para eliminar el mapa de gestos dinámicamente, se limpiaba la combinación de gestos principales / de capa, y después se asociaban los gestos principales.

source: * Defining extra gesture maps in the app module/global plugin: Normally, an app module or a global plugin that accepts keyboard input uses a single gestures map (called __gestures; a map is another term for dictionaries or associative array where there is a value tied to a key). But in order for layers to work, a second gestures map was provided to store layer commands (command and the bound script of the form "command":"script"). In recent nVDA releases, script decorator is used for main commands while gestures map is used for layer commands.
es: * Definición de mapas extra de gestos en el módulo de aplicación / extensión global: normalmente, un módulo de aplicación o extensión global que acepta entrada por teclado usa un mapa de gestos único (llamado __gestures; un mapa es otro término para diccionarios o arrays asociativos donde hay un valor asociado a una clave). Pero para que las capas funcionen, se ofrecía un segundo mapa de gestos para almacenar las órdenes de capa (la orden y el script asociado de la forma "orden":"script"). En versiones recientes de NVDA, se usa el decorador script para las órdenes principales, mientras que se usa un mapa de gestos para las órdenes de capa.

source: * Wrapped functions: Tyler used "wraps" decorator from functools to wrap how "finally" function is called from within the layer set (this was needed to remove bindings for layer commands after they are done). Also, a custom implementation of getScript function (app module/global plugin) was used to return either the main script of the layer version depending on context.
es: * Funciones envueltas: Tyler usaba el decorador "wraps" de functools para encapsular cómo se llama a la función "finalmente" en el conjunto de capa (esto era necesario para eliminar asociaciones de órdenes de capa después de ejecutarse). Además, se usó una implementación personalizada de la función getScript (módulo de aplicación / extensión global) para devolver el script principal de la versión de la capa dependiendo del contexto.

source: A typical layer command execution is as follows:
es: La ejecución típica de las órdenes de capa es como sigue:

source: 1. First, assign a command to a layer (entry) command (add-on 2.0 and later; add-on 1.x used NVDA+Grave for SPL Controller and Control+NVDA+Grave for the Assistant layer; removed in 2.0 to prevent conflicts with language-specific gestures).
es: 1. Primero, se asigna una orden a una capa (entrada) orden (complemento 2.0 y posterior; el complemento 1.x usaba NVDA+` para el controlador de SPL y ctrl+NVDA+` para la capa del asistente; se eliminó en la 2.0 para prevenir conflictos con gestos específicos del idioma).

source: 2. You press the layer entry command. This causes the app module/global plugin to perform the following:
es: 2. Pulsas la orden de entrada de la capa. Esto causa que el módulo de aplicación o extensión global haga lo siguiente:

source: 1. Layer conditions are checked. Until add-on 6.x, the app module wanted to see if you are in the Playlist Viewer (relaxed in add-on 7.0), and for the global plugin, checks if Studio is running.
es: 1. Se comprueban las condiciones de capa. Hasta el complemento 6.x, el módulo de aplicación quería ver si estabas en el visor de listas de reproducción (se relajó en el complemento 7.0), y para la extensión global, comprueba si Studio está en ejecución.

source: 2. Sets a flag telling NVDA that the Assistant/Controller layer is active.
es: 2. Se establece un indicador para decirle a NVDA que la capa del asistente / controlador está activa.
