Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/spladdoninternals.po
Languages: es

source: * Updates encoder label and flags position when told to do so (via a dialog, activated by pressing Control+F12). This is needed if encoders were removed, as you may hear label for an encoder that no longer exists. This is implemented as a variation of find predecessor algorithm.
es: * Actualiza la etiqueta del codificador e indica su posición a petición (mediante un diálogo, que se activa pulsando ctrl+f12). Esto es necesario si se han eliminado codificadores, ya que puedes oír la etiqueta de un codificador que ya no existe. Esto se implementa como una variación del algoritmo de búsqueda anterior.

source: * Announces encoder columns. The base class can announce encoder position (Control+NVDA+1) and label (Control+NVDA+2), while SAM can announce encoder format, status and description and SPL and AltaCast allows one to hear encoder format and transfer rate/connection status.
es: * Anuncia las columnas del codificador. La clase base puede verbalizar la posición del codificador (ctrl+NVDA+1) y su etiqueta (ctrl+NVDA+2), mientras que SAM puede verbalizar el formato del codificador, estado y descripción. SPL y AltaCast permiten oír el formato del codificador y la velocidad de transferencia / el estado de la conexión.

source: * In add-on 7.0, a central configuration dialog for configuring encoder settings for the selected encoder has been added. Press Alt+NVDA+0 or F12 to open this dialog.
es: * En el complemento 7.0, se ha añadido un diálogo de configuración central para configurar los ajustes del codificador seleccionado. Pulsa alt+NVDA+0 o f12 para abrir este diálogo.

source: ### More and more threads: connection messages and background encoder monitoring
es: ### Más y más hilos: mensajes de conexión y monitorización del codificador en segundo plano

source: As we saw in a previous chapter, threads allow developers to let programs perform certain tasks in the background. Even in encoder support, threads are employed for various tasks, including connection message announcement and background encoder monitoring.
es: Como vimos en un capítulo anterior, los hilos permiten a los desarrolladores hacer que los programas realicen ciertas tareas en segundo plano. Incluso en el soporte de codificadores, los hilos se emplean para diversas tareas, incluyendo la verbalización del mensaje de conexión y la monitorización del codificador en segundo plano.

source: Each encoder overlay class (not the base encoder) includes dedicated connection handling routines (reportConnectionStatus). Depending on how you invoke this, it starts up as follows:
es: Cada clase de superposición para cada codificador (y no el codificador base) incluye procedimientos dedicados para la gestión de conexión (reportConnectionStatus). Dependiendo de cómo los invoques, se pueden iniciar como sigue:

source: * If background encoder monitoring is off and you press F9 to connect, NVDA will run this routine in a separate thread. For SAM, this is checked right after sending F9 to the application, and for SPL, this is done after clicking "connect" from the encoder context menu (manipulates focus in the process).
es: * Si la monitorización del codificador en segundo plano está desactivada y pulsas f9 para conectar, NVDA ejecutará este procedimiento en un hilo separado. En SAM, se hace la comprobación justo después de enviar f9 a la aplicación, y en SPL se hace después de hacer click en "Connect" desde el menú de contexto del codificador (se manipula el foco en el proceso).

source: * If background encoder monitoring is on before pressing F9, the routine will run from another thread when this setting is switched on. Then when you press F9, NVDA knows that the background monitoring thread is active, thus skipping the above step.
es: * Si la monitorización del codificador en segundo plano está activada antes de pulsar f9, el procedimiento se ejecutará desde otro hilo cuando este ajuste se active. Cuando pulses f9, NVDA ya sabe que el hilo de monitorización en segundo plano está activo, por lo que se saltará el paso de arriba.

source: The connection handling routine performs the following:
es: El procedimiento encargado de gestionar la conexión hace lo siguiente:

source: 1. Locates status message for the encoder entry. For SAM, status message is spread over two columns (child objects), and for SPL, transfer rate column is consulted. This will be done as long as Studio and/or NVDA is live (that is, if the thread is running).
es: 1. Ubica el mensaje de estado para la entrada del codificador. En Sam, el mensaje de estado se reparte en dos columnas (objetos hijo), y en SPL se consulta la columna de velocidad de transferencia. Esto se hará mientras Studio y / o NVDA estén en ejecución (o lo que es lo mismo, si el hilo está en ejecución).

source: 2. Announces error messages if any and will try again after waiting a little while (fraction of a second). If NVDA is told to not announce connection status until the encoder in question is connected, connection reporter thread will stop when an error message is seen.
es: 2. Anuncia mensajes de error, si los hay, y prueba de nuevo tras esperar un rato (fracciones de segundo). Si se indica a NVDA que no anuncie el estado de conexión hasta que el codificador en cuestión esté conectado, el hilo informador de conexión se detendrá cuando se vea un mensaje de error.

source: 3. If connected, NVDA will play a tone, then:
es: 3. Si está conectado, NVDA reproducirá un tono, y entonces:

source: * Do nothing if not told to focus to studio nor play the next track.
es: * No hará nada si no se le indica que lleve el foco a Studio o reproduzca la siguiente pista.

source: * Focuses to studio and/or plays the next track if no tracks are playing by calling onConnect method.
es: * Lleva el foco a Studio y / o reproduce la siguiente pista si no hay pistas reproduciéndose llamando al método onConnect.

source: 4. For other messages, NVDA will periodically play a progress tone and announce connection status so far as reported by the encoder (progress tones will not be played if suppressed from encoder settings dialog).
es: 4. Para otros mensajes, NVDA reproducirá periódicamente un tono de progreso y verbalizará el estado de la conexión tan pronto como lo informe el codificador (los tonos de progreso no se reproducirán si se suprimen en el diálogo de ajustes del codificador).

source: 5. This loop repeats as long as this encoder is being monitored in the background.
es: 5. Este bucle se repite mientras el codificador esté siendo monitorizado en segundo plano.

source: #### Monitoring multiple encoders with encoder registry
es: #### Vigilancia de varios codificadores con el registro de codificadores

source: Sometimes it becomes necessary to monitor multiple encoders at once, particularly if streaming to multiple servers or files. To handle this, encoder connection monitoring threads are housed inside an encoders registry, a dictionary that maps encoder ID's to connection reporter threads. This is useful to direct NVDA to announce connection status for multiple encoders one encoder at a time, and if this happens, NVDA will prefix encoder status with the ID associated with the encoder in question.
es: A veces se hace necesario vigilar varios codificadores a la vez, particularmente si se emite a distintos servidores o archivos. Para manejar esto, los hilos de vigilancia de los codificadores se alojan en un registro de codificadores, un diccionario que relaciona identificadores de codificadores con hilos informantes de conexión. Esto es útil para hacer que NVDA anuncie el estado de conexión de varios codificadores, uno cada vez, y si esto sucede, NVDA prefijará el estado del codificador con el identificador asociado del codificador en cuestión.

source: ### Encoder-specific routines
es: ### Procedimientos específicos del codificador

source: In addition to basic services, each encoder routine has its own goodies, including:
es: Además de los servicios básicos, cada procedimiento de codificación tiene sus propias ventajas, incluyendo:

source: For SAM encoders:
es: Para los codificadores SAM:

source: * To disconnect, press F10.
es: * Para desconectar, pulsa f10.

source: * You can press Control+F9 or Control+F10 to connect or disconnect all encoders (does not work well in recent SAM releases, according to my tests). A workaround was developed to fix this problem (opens context menu and activates the correct item on its own).
es: * Puedes pulsar ctrl+f9 o ctrl+f10 para conectar y desconectar todos los codificadores (no funciona bien en versiones recientes de SAM, según mis pruebas). Se desarrolló un parche para solucionar este problema (abre el menú contextual y activa el elemento correspondiente por sí mismo).

source: For SPL encoder family (including AltaCast):
es: Para la familia de codificadores de SPL (incluyendo AltaCast):

source: * When you press Control+F9 to connect all encoders, NVDA does the following:
es: * Cuando pulsas control+f9 para conectar todos los codificadores, NVDA hace lo siguiente:

source: 1. Locates "connect" button, and if it says "Connect", clicks it (obj.doAction).
es: 1. Ubica el botón conectar, y si está etiquetado como "connect", hace clic en él (obj.doAction).

source: 2. Moves focus back to the entry (self.SetFocus).
es: 2. Mueve el foco de vuelta a la entrada (self.setFocus).

source: * To disconnect, press TAB until you arrive at "Disconnect" button and press SPACE.
es: * Para desconectar, pulsa tabulador hasta que llegues al botón "Desconectar" y pulsa la barra espaciadora.

source: ## Final notes and add-on development process overview
es: ## Notas finales y descripción del proceso de desarrollo de un complemento

source: Now that we've visited internals of StationPlaylist add-on, I'd like to give you a tour of my lab where I develop this add-on. Along the way you'll learn how an add-on is born, coded, tested, released and maintained.
es: Ahora que hemos visitado el interior del complemento StationPlaylist, me gustaría hacerte un recorrido por mi laboratorio, donde desarrollo este complemento. Durante el camino aprenderás cómo nace un complemento, se codifica, se prueba, se publica y se mantiene.

source: ### Lab setup, development equipment and software
es: ### Preparación del laboratorio, equipamiento de desarrollo y software

source: For all my software development, I use two computers: a touchscreen laptop and a desktop, both running Windows 10 and latest NVDA alpha snapshots. Both also run Cygwin and/or Windows Subsystem for Linux (WSL, otherwise known as BASH on Ubuntu on Windows)to run various command-line tools (Git, SCons, etc.), and in case I need to compile NVDA from source code, installed Visual Studio 2017 with latest update and other dependencies.
es: Para todos mis desarrollos de software, yo uso dos ordenadores: un portátil con pantalla táctil y un sobremesa, ambos ejecutando Windows 10 y las últimas versiones de desarrollo alpha de NVDA. Ambos también tienen Cygwin y / o el subsistema de Windows para Linux (WSL, conocido de otra manera como BASH en Ubuntu en Windows) para ejecutar varias herramientas de la línea de órdenes (git, SCons, etc.), y en caso que necesite compilar NVDA desde el código fuente, tengo instalado Visual Studio 2017 con la última actualización y otras dependencias.

source: In case of SPL add-on, I have different Studio versions installed: 5.11 on my laptop and 5.20 on the desktop. This allows me to work on both versions at once (both computers have the full source code of the add-on, though I tend to write bug fixes on my laptop and experiment with new things on my desktop).
es: En el caso del complemento SPL, tengo diferentes versiones de Studio instaladas: 5.11 en mi portátil y 5.20 en el sobremesa. Esto me permite trabajar en ambas versiones de una vez (ambos ordenadores tienen el código fuente completo del complemento, aunque tiendo a solucionar fallos en mi portátil y experimentar con cosas nuevas en mi sobremesa).

source: ### Git: a "smart" source code manager
es: ### Git: un gestor de código fuente inteligente

source: Like other NVDA developers and many add-on writers, I use Git for source code management (contrary to its slogan, Git is very smart). This is a distributed system, meaning a local repository contains the complete record of how the source code is managed (no need to connect to a server to commit and fetch updates). For example, using just my local copy of the SPL add-on source code, I can view commit history and generate older add-on releases.
es: Al igual que los desarrolladores de NVDA y muchos creadores de complementos, uso Git para gestionar el código fuente (contrariamente a su lema, Git es muy inteligente). Se trata de un sistema distribuido, lo que significa que un repositorio local contiene el registro completo de cómo se gestiona el código fuente (sin necesidad de conectarse a un servidor para confirmar y obtener actualizaciones). Por ejemplo, si uso simplemente mi copia local del código fuente del complemento de SPL, puedo ver el historial de commits y generar versiones antiguas del complemento.

source: Another advantage of Git is extensive support for branches. A branch is a development workflow separate from other branches. For example, NVDA screen reader uses at least three branches for its workflow: alpha (master branch), beta (beta branch) and rc (release candidate, used to build official releases). SPL add-on uses this approach as well: there are at least two branches in use, called master (renamed to main in 2021) and stable used for ongoing development or release and maintenance, respectively (we'll come back to branches in a second). With the advent of Test Drive program (see below), a third branch named "staging" or "next" is used to gather all work done on branches under one roof for testing purposes (in 2018, this has changed significantly).
es: Otra ventaja de Git es su extenso soporte para ramas. Una rama es un flujo de desarrollo separado de otras ramas. Por ejemplo, el lector de pantalla NVDA usa al menos tres ramas para su flujo de trabajo: alfa (rama master), beta (rama beta) y rc (candidata a liberación, usada para construir versiones oficiales). El complemento de SPL usa este enfoque así: hay al menos dos ramas en uso, llamadas master (renombrada a main en 2021) y stable, usadas para desarrollo activo y publicación y mantenimiento, respectivamente (volveremos a las ramas en un segundo). Con la llegada del programa de unidad de pruebas (mira debajo), se usa una tercera rama llamada "staging" o "next" para recopilar todo el trabajo hecho en ramas bajo un techo con propósitos de prueba (en 2018, esto ha cambiado significativamente).

source: ### How an add-on feature is born
es: ### Cómo nace una característica de un complemento

source: Let's go through a typical development process for an add-on feature by looking at how broadcast profiles was developed (for more information on broadcast profiles, refer to configuration management section above).
es: Recorramos el proceso típico de desarrollo de una característica de un complemento viendo cómo se desarrollaron los perfiles de emisión (para más información sobre los perfiles de emisión, consulta la sección de gestión de la configuración de arriba).

source: I started working on broadcast profiles in March 2015 while developing add-on 5.0. This was a natural extension of add-on settings dialog: whereas this dialog (and the configuration database it uses) only dealt with a single profile, I thought it might be a good idea to allow multiple profiles to be defined and to let the settings dialog respond to profile changes.
es: Comencé a trabajar en los perfiles de emisión en marzo de 2015 mientras desarrollaba el complemento 5.0. Se trataba de una extensión natural del diálogo de configuración del complemento: mientras que este cuadro de diálogo (y la base de datos de configuración que usa) sólo se ocupa de un único perfil, pensé que sería una buena idea permitir que se definan varios perfiles y hacer que el diálogo de configuración reaccione ante el cambio de perfiles.

source: There was an important reason for writing this feature: Since NVDA supports multiple configuration profiles and since some broadcasters were hosting multiple shows, I thought it would be a good idea to implement a similar feature in the SPL add-on. Thus, I envisioned broadcast profiles to be used primarily by people hosting multiple shows, with each show defined as a profile.
es: Había una razón importante para crear esta característica: ya que NVDA soporta varios perfiles de configuración y ya que algunos locutores presentan varios programas, pensé que sería una buena idea implementar una característica similar en el complemento. Por lo tanto, preví que los perfiles de emisión serían usados principalmente por gente que tuviera varios programas, definiendo un perfil para cada programa.

source: In March and April 2015, I started rewriting certain parts of add-on configuration manager (splstudio.splconfig) in preparation for developing broadcast profiles (now included as part of add-on 6.0). I started by writing todo comments (where appropriate) describing what the future feature should be like. I then modified initConfig and saveConfig (discussed in app module sections), initially telling them to work with the default profile (the one and only configuration map then), then I left it alone until add-on 5.0 was released in June 2015.
es: En marzo y abril de 2015, comencé a reescribir ciertas partes del gestor de configuración del complemento (splstudio.splconfig) como preparación para desarrollar los perfiles de emisión (incluidos ahora como parte del complemento 6.0). Comencé anotando algunas tareas (donde correspondía) describiendo cómo debería ser la característica futura. Después modifiqué initConfig y saveConfig (expuestas en los artículos del módulo de aplicación), diciéndoles inicialmente que trabajaran con el perfil predeterminado (el único mapa de configuración por entonces), luego las dejé solas hasta que se publicó el complemento 5.0 en junio de 2015.

source: In June 2015, I opened a new branch (initially using the codename "starfish") to house code related to broadcast profiles. Before any "real" code was written, I studied NVDA source code dealing with configuration profiles to learn more about how Jamie (James Teh from NV Access, now Mozilla) implemented this feature. Once I understood how it worked, I copied, pasted and changed the code to match the overall add-on code base (giving nV Access the credit they deserve).
es: En junio de 2015, abrí una nueva rama (usando inicialmente el nombre "starfish") para alojar el código relacionado con los perfiles de emisión. Antes de escribir cualquier código "real", estudié el código fuente de NVDA relacionado con los perfiles de configuración para aprender más sobre cómo Jamie (James Teh de NV Access, ahora en Mozilla) implementó esta característica. Una vez entendí cómo funcionaba, copié, pegué y modifiqué el código para que encajara con el del complemento (dando a NV Access el crédito que merece).

source: One of the first things I had to decide was how to store profiles. I experimented with using ConfigObj sections, one per profile, but this proved to be problematic (a profile could be given the name of an existing configuration map key). I then went back to NVDA source code to find out how NV Access solved this problem (using separate ini files), implemented it, and was met with another problem: transfering values between profiles. This was resolved by specifying whether a setting was "global" (applies to all profiles) or specific to a profile. Next came profile controls in the add-on settings dialog and using choice events to set alarm values using values from the selected profile.
es: Una de las primeras cosas que tenía que decidir era cómo almacenar los perfiles. Experimenté usando secciones de ConfigOBJ, una por perfil, pero resultó que daba problemas (se podía dar a un perfil el nombre de la clave de un mapa existente). Entonces fui de vuelta al código fuente de NVDA para saber cómo resolvió NV Access este problema (usando archivos ini separados), lo implementé, y me encontré con otro problema: la transferencia de valores entre perfiles. Esto lo resolví especificando si un ajuste era "global" (se aplica a todos los perfiles) o específico de un perfil. Lo siguiente que vino fueron los controles en el diálogo de configuración del complemento y usar eventos de elección para establecer valores para la alarma usando los valores del perfil seleccionado.

source: The last thing I did before merging the broadcast profiles branch to master branch in July was revising configuration error dialog and writing documentation for broadcast profiles. Once the documentation was ready and small issues were fixed after going through many rounds of testing (on my own computer and from the profiles branch itself), broadcast profiles branch was merged into master. But the development didn't stop there: thanks to provisions I made, it was quite simple to implement instant switch profiles (again it had issues which are now largely resolved).
es: Lo último que hice antes de mezclar la rama de perfiles de emisión en la rama master en julio fue revisar el diálogo de error de configuración y escribir documentación para los perfiles de emisión. Una vez la documentación estuvo lista y se solucionaron pequeños errores después de hacer muchas rondas de pruebas (en mi propio ordenador y desde la rama de perfiles), se mezcló la rama de perfiles de emisión en master. Pero el desarrollo no se detuvo ahí: gracias a las previsiones que hice, fue bastante simple implementar los perfiles de cambio instantáneo (de nuevo hubo problemas que ya están de sobra resueltos).

source: ### Dealing with threaded code: headaches during development of background encoder monitoring feature
es: ### Trato con código en hilos: dolores de cabeza durante el desarrollo de la característica de monitorización del codificador en segundo plano

source: You may recall our discussion of Cart Explorer and how it went through extensive testing to arrive at the current state (this was a difficult code segment). When it comes to difficulty, nothing beats multithreaded code, especially if it involves multiple threads working in parallel (rather, almost parallel), and I tasted this when writing background encoder monitor (add-on 5.0). This involved tracking how many threads were running to make sure no unnecessary threads were running, catching suttle errors and race conditions (a connection attempt could run a thread without checking if the encoder is being monitored) and so on. Thankfully, I went through a similar set of problems a few months earlier when I struggled with library scan (add-on 4.0), and that experience taught me to be careful with threads (and to experience fewer headaches).
es: Puedes recordar nuestra exposición sobre el explorador cart y cómo pasó unas extensas pruebas hasta llegar a su estado actual (fue un segmento de código difícil). Cuando hablamos de dificultad, nada supera al código multihilo, especialmente si implica varios hilos trabajando en paralelo (bueno, casi en paralelo). Yo saboreé esto al programar el monitor del codificador en segundo plano (complemento 5.0). Esto implicó rastrear cuántos hilos estaban ejecutándose para asegurarse de que no había hilos innecesarios, capturar errores y condiciones de carrera (un intento de conexión podía lanzar un hilo sin comprobar si el codificador estaba siendo monitorizado) y demás. Afortunadamente, pasé por unos problemas similares unos meses atrás cuando desarrollé el escaneo de biblioteca (complemento 4.0), y esa experiencia me enseñó a tener cuidado con los hilos (y experimentar menos dolores de cabeza).
