Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/spladdoninternals.po
Languages: es

source: ##### Track time analysis: Duration of "selected" tracks
es: ##### Análisis de tiempo de pista: duración de las pistas seleccionadas

source: A few months ago, during a Skype chat with a number of add-on users, someone suggested a feature where NVDA will tell you how long it'll take to play selected tracks. Since I was familiar with this concept from JAWS scripts, I decided to work on it as part of add-on 6.0.
es: Hace unos meses, mientras conversaba en un chat de Skype con algunos usuarios del complemento, alguien sugirió una característica que permitiera a NVDA decir cuánto tiempo llevaría reproducir las pistas seleccionadas. Ya que este concepto era familiar para mí porque lo conocía de los scripts de Jaws, decidí trabajar en ello como parte del complemento 6.0.

source: The resulting routine (which is available if you are focused on the main playlist viewer with the playlist loaded) is as follows:
es: El procedimiento resultante (que está disponible si tienes el foco en el visor principal de la lista de reproducción con la lista de reproducción cargada) es el siguiente:

source: 1. Move to the position in a playlist to mark as start of track time analysis.
es: 1. Te mueves a una posición en la lista de reproducción para marcarla como punto de inicio del análisis de tiempo de pista.

source: 2. Enter SPL assistant, then press F9.
es: 2. Entras al asistente de SPL y pulsas f9.

source: 3. Move to another track in the playlist, open SPL Assistant then press F10. NVDA will then:
es: 3. Te mueves a otra pista en la lista de reproducción, abres el asistente de SPL y pulsas f10. A partir de ahí, NVDA:

source: 1. Determine analysis range. For most cases, it'll be top to bottom analysis, but in some cases, it could be reverse (bottom to top). Also, a variable to hold total duration will be prepared.
es: 1. Determina el rango del análisis. En la mayoría de casos será un análisis de arriba a abajo, pero en otros casos podría invertirse (de abajo a arriba). Además, se preparará una variable para almacenar la duración total.

source: 2. For each track in the analysis range, NVDA will obtain file name and track duration (in reality, segue) via Studio API. Once the track duration is received, it is then added to the total duration variable.
es: 2. Para cada pista en el rango de análisis, NVDA obtendrá el nombre de archivo y la duración de la pista (en realidad, sesgo) mediante la api de Studio. Una vez se reciba la duración de la pista, se añadirá a la variable con la duración total.

source: 3. Once time analysis (calculating total duration) is done, NVDA will announce number of tracks selected and the total duration using mm:ss format.
es: 3. Una vez se hace el análisis de tiempo (cálculo de la duración total), NVDA verbalizará el número de pistas seleccionadas y la duración total usando el formato mm:ss.

source: If you are a seasoned NVDA user, you may have noticed a familiar pattern: the command to set a marker to copy review cursor text is NVDA+F9, and you would move to a different location and press NVDA+F10 to copy the selected text to the clipboard. Replacing the NVDA modifier key with SPL Assistant produces the commands above: F9 to mark current position for time analysis, and F10 to perform the actual calculation. I intentionally chose these two function keys to provide consistent experience and to reenforce concepts used in NVDA screen reader: review cursor.
es: Si eres un usuario experto de NVDA, puedes haberte dado cuenta de un patrón familiar: la orden para situar un marcador para copiar texto del cursor de revisión es NVDA+f9, y te moverías a una ubicación diferente y pulsarías NVDA+f10 para copiar el texto seleccionado al portapapeles. Reemplazando la tecla modificadora de NVDA con el asistente de SPL produce un resultado parecido: f9 marca la posición inicial del análisis de tiempo, y f10 realiza el cálculo. Elegí estas dos teclas de función intencionadamente para proporcionar una experiencia consistente y reforzar conceptos usados en el lector de pantalla NVDA: el cursor de revisión.

source: ##### Playlist remainder announcement
es: ##### Anuncio de tiempo restante de la lista de reproducción

source: Until add-on 6.x, playlist remainder announcement was based on Studio API. However, it was found that this "remainder" was actually the remaining time within the selected hour slot. To get around this, in add-on 7.0, this routine was rewritten to take advantage of Track Dial introduced in add-on 5.0 (see Track Dial section above).
es: Hasta el complemento 6.x, el anuncio de tiempo restante de la lista de reproducción estaba basado en la api de Studio. Sin embargo, nos dimos cuenta de que este "tiempo restante" era el de la hora actual. Para solucionarlo, en el complemento 7.0 se reescribió este procedimiento para aprovechar la ventaja que daba el dial de pista introducido en el complemento 5.0 (mira la sección de más arriba sobre el dial de pista).

source: Technically, a combination of column content fetching and track navigation routines are used to accomplish this. When SPL Assistant, D is pressed, NVDA will write down the focused track and will move down the playlist (starting from the focused track), recording the segue (total track duration minus crossfade). Once playlist navigation is complete, the total duration is then sent to time announcement routine (see above) for processing (converted to hours, minutes and seconds format).
es: Técnicamente, se aplica una combinación de recuperación de contenido de columnas y procedimientos de navegación por pistas para solucionar el problema. Al pulsar asistente de SPL, D, NVDA anotará la pista con el foco y se moverá hacia abajo en la lista de reproducción (empezando desde la pista con el foco), registrando la secuencia (duración total de pista menos transición). En cuanto se completa la navegación por la lista de reproducción, se envía la duración total al procedimiento de verbalización de tiempo (mira arriba) para su procesamiento (conversión al formato de horas, minutos y segundos).

source: ##### Playlist snapshots and transcripts
es: ##### Instantáneas y transcripciones de lista de reproducción

source: Although similar in appearance, playlist snapshots and transcripts are two different things. Both uses a combination of object navigation and Windows API, work by retrieving and analyzing column content for tracks, and involve SPL Assistant followed by F8 with or without modifiers. Whereas a snapshot is used to gather statistics about the loaded playlist, a transcript is the entire playlist formatted in different ways. Also, after invoking SPL Assistant layer, just pressing F8 will launch snapshots, whereas you need to press Shift+F8 to obtain a playlist transcript and choose appropriate action such as transcript range, output format and so on via the dialog that appears afterwards.
es: Aunque en apariencia son similares, las transcripciones y las instantáneas en listas de reproducción son dos cosas diferentes. Ambas usan una combinación de navegación por objetos y la API de Windows, funcionan recuperando y analizando el contenido de las columnas en las pistas, e implican al asistente de SPL seguido de f8 con o sin modificadores. Mientras que una instantánea se usa para obtener estadísticas sobre la lista de reproducción cargada, una transcripción es la lista de reproducción entera formateada de diversas maneras. Además, después de invocar a la capa del asistente de SPL, simplemente pulsando f8 se tomará la instantánea, mientras que es necesario pulsar shift+f8 para obtener una transcripción de la lista de reproducción y elegir la acción apropiada, como el rango de transcripción, formato de salida y demás, mediante el diálogo que aparece después.

source: A playlist snapshot presents statistics about the currently loaded playlist (or parts of it). Information gathered include how many items (including hour markers) are loaded, longest and shortest tracks, and average track duration. Also, if asked to do so, up to top ten artists, categories, and/or track genres are recorded. This information is presented either via speech and braille, or if the command is pressed twice, in a browse mode window.
es: Una instantánea de lista de reproducción presenta estadísticas sobre la lista de reproducción cargada (o partes de ella). Entre la información recopilada se incluye cuántos elementos hay cargados (también marcadores de hora), pistas más largas y más cortas, y duración media de la pista. También, si se pide, se registran hasta diez artistas, categorías y/o géneros de pista. Esta información se representa bien mediante voz o braille, o si se pulsa la orden dos veces, en una ventana del modo exploración.

source: In contrast, a playlist transcript is the complete overview of the loaded playlist (or parts of it) presented in various formats. This complete overview includes data from all columns (not just the ones examined by playlist snapshots). Once data from all columns are gathered for a track, NVDA will convert this information into various formats, including plain text, HTML table, comma-separated values (CSV) and so on for viewing in a browse mode window, copying to clipboard (for some formats), or saving to a file.
es: En contraste, una transcripción de lista de reproducción es una descripción completa de la lista de reproducción cargada (o partes de ella) presentada en diversos formatos. Esta descripción completa incluye datos de todas las columnas (y no simplemente las que se examinan en la instantánea de lista de reproducción). Una vez se recuperan todos los datos de las columnas en una pista, NVDA convierte esta información a diversos formatos, incluidos texto plano, una tabla HTML, valores separados por comas (CSV) y demás para que se pueda ver en una ventana del modo exploración, copiar al portapapeles (en algunos formatos) oo guardarla en un archivo.

source: #### SPL Assistant 3: configuration
es: #### Asistente de SPL 3: configuración

source: There is another function key assigned to SPL Assistant: pressing F12 will switch to an instant switch profile (if defined). We'll come back to what is meant by "instant switch profile" and the mechanics of it (and internals of SPL Assistant, F12) in the next section.
es: Hay otra tecla de función asignada al asistente de SPL: pulsar f12 cambiará a un perfil de cambio instantáneo (si está definido). Volveremos a explicar qué se entiende por "perfil de cambio instantáneo" y sus mecanismos (y el interior del asistente de SPL, f12) en la próxima sección.

source: #### SPL Assistant 4: getting help
es: #### Asistente de SPL 4: conseguir ayuda

source: I believe that a product isn't complete without a good quality documentation. For this reason, SPL Assistant provides two commands to help you use the layer commands or the add-on itself. They are:
es: Yo creo que un producto no está completo sin una buena documentación de calidad. Por esta razón, el asistente de SPL proporciona dos órdenes para ayudarte a usar la capa de órdenes o el complemento en sí. Son las siguientes:

source: * F1: Opens a browse mode document presenting a list of SPL Assistant layer commands.
es: * F1: muestra un documento en modo exploración que presenta una lista de órdenes de la capa del asistente de SPL.

source: * Shift+F1: Opens the online user guide (os.startfile).
es: * Shift+f1: abre la guía de usuario en línea (os.startfile).

source: #### SPL Assistant 5: Checking for add-on updates
es: #### Asistente de SPL 5: búsqueda de actualizaciones

source: If using add-on 18.12 and earlier, pressing Control+Shift+U after entering SPL Assistant layer will cause the add-on to check for add-on updates. Unlike the automatic update check process described earlier, this one is a manual check, thus it'll perform additional actions such as stopping the automatic update check timer before actually checking for updates. Another difference is that this command will display a results dialog if there are no updates or other errors are encountered, whereas in automatic check mode, they are not shown.
es: Al usar el complemento 18.12 o anterior, si pulsas ctrl+shift+u después de entrar en la capa del asistente de SPL hará que el complemento busque actualizaciones de sí mismo. A diferencia del proceso automático de búsqueda de actualizaciones descrito anteriormente, esta es una búsqueda manual, y por tanto llevará a cabo acciones adicionales como detener el temporizador de búsqueda automática de actualizaciones antes de buscar actualizaciones realmente. Otra diferencia es que esta orden mostrará un diálogo de resultados si no hay actualizaciones o se encuentran otros errores, mientras que en el modo de búsqueda automática, no se muestran.

source: ### A surprise: some Assistant layer commands can be invoked without entering the layer first
es: ### Una sorpresa: pueden invocarse algunas órdenes de la capa del asistente sin entrar a ella primero

source: There are times when a broadcaster will need to obtain certain information quickly. So the question becomes, "is there a way to announce something without first invoking Assistant layer?" Yes, you can assign a custom command for the following Assistant commands:
es: Hay veces en las que un locutor querrá obtener cierta información rápidamente. Por eso nos hacemos la siguiente pregunta: "¿Hay forma de verbalizar algo sin tener que invocar primero la capa del asistente?". Sí, se puede asignar una orden personalizada a las siguientes funciones del asistente:

source: * Name of the next track.
es: * Nombre de la próxima pista.

source: * Name of the current track.
es: * Nombre de la pista actual.

source: * Weather and temperature.
es: * Tiempo y temperatura.

source: * Playlist snapshots.
es: * Instantáneas de lista de reproducción.

source: * Track time analysis marker.
es: * Marcador de análisis de tiempo de pista.

source: * Track time analysis.
es: * Análisis de tiempo de pista.

source: For these routines, an extra step is performed to make sure that SPL Assistant flag is turned off automatically after the shortcut for these routines are pressed. Without this step, you might end up with a situation like the following:
es: En estos procedimientos, se lleva a cabo un paso adicional para asegurarse de que el indicador del asistente de SPL se apaga automáticamente tras pulsar el atajo de teclado en cuestión. Sin este paso, podrías acabar en una situación como la siguiente:

source: 1. You invoke Assistant layer.
es: 1. Invocas la capa del asistente.

source: 2. You then press the shortcut key (not the layer counterpart) for the layer command you wish to use.
es: 2. Después pulsas la tecla rápida para la orden de capa que quieras usar (sin activar la capa antes).

source: 3. You press another key which may announce something else, or you hear the same thing twice if you do press the layer command counterpart to the command you have pressed. In effect, you have invoked two layer commands in one sitting (the purpose of the layer set is to let you hear one announcement at a time).
es: 3. Pulsas otra tecla que puede verbalizar algo más, o incluso oyes lo mismo dos veces si pulsas el atajo de la capa homólogo a la orden que has pulsado. En efecto, has invocado dos órdenes de capa de una vez (el propósito del conjunto de capas es dejarte oír un mensaje a la vez).

source: ## Introducing configuration facilities: add-on settings dialog and broadcast profiles
es: ## Presentación de las funciones de configuración: diálogo de ajustes del complemento y perfiles de emisión

source: We have arrived at our last station stop for Studio app module internals: configuration management. This facility allows a broadcaster to configure various options such as alarms, column announcement order and so on, as well as package settings for a show as a broadcast profile to be invoked during the show. Along the way you'll learn how NVDA screen reader stores various settings, what happens if something goes wrong and get into internals of how broadcast profiles work.
es: Hemos llegado a nuestra última parada del módulo de aplicación de Studio visto por dentro: gestión de la configuración. Esta característica permite que un locutor configure diversas opciones, como alarmas, orden de verbalización de columnas y demás, así como empaquetar ajustes para un programa como un perfil de emisión para invocarlo durante el programa. Durante el camino aprenderás cómo almacena el lector de pantalla NVDA diversos ajustes, qué pasa si algo va mal y verás cómo están hechos por dentro los perfiles de emisión.

source: ### ConfigObj: NVDA's configuration manager assistant
es: ### ConfigObj: asistente de gestión de la configuración de NVDA

source: NVDA uses ConfigObj library to manage settings. This Python module, inspired by Python's own Config Parser, allows developers to store settings in a text file, read and interpret settings and validate options against default configuration options.
es: NVDA usa la biblioteca ConfigObj para gestionar sus ajustes. Este módulo Python, inspirado en el propio intérprete de configuración de Python, permite que los desarrolladores almacenen ajustes en un fichero de texto, leer e interpretar ajustes y validar opciones basándose en opciones de configuración por defecto.

source: NVDA comes with a collection of default options. They live in source/config/__init__ and are used for various things, including presenting preferences, validating user configuration and so on. The config management module also includes facilities to handle profiles (a package of user settings to be used in an app, during say all or reserved for manual activation).
es: NVDA viene con una colección de opciones por defecto. Estas residen en source/config/__init__ y se emplean para varias cosas, incluyendo la presentación de preferencias, validación de configuración de usuario y demás. El módulo de gestión de configuración también incluye funciones para gestionar perfiles (un paquete de ajustes de usuario que se emplea en una aplicación, al verbalizar todo o se reserva para activación manual).

source: ### NVDA configuration profiles: multiple configuration files, one online database
es: ### Perfiles de configuración de NVDA: varios archivos de configuración, una única base de datos en línea

source: A number of users asked NV Access if it would be possible to have profiles where certain settings can take effect while one is using apps or during say all. NV Access listened and introduced configuration profiles in late 2013. As of August 2015, one can create a manual or an automated (triggered) profile, with the latter further divided into say all profile and app-specific one.
es: Muchos usuarios preguntaron a NV Access si sería posible perfiles donde ciertos ajustes tengan efecto mientras se esté usando una aplicación o la función de verbalizar todo. NV Access escuchó e introdujo los perfiles de configuración ya entrado 2013. Desde agosto de 2015, se pueden crear perfil manual o automático (disparado), con estos últimos divididos en perfiles de verbalizar todo y específicos de una aplicación.

source: Configuration profiles involve a few support routines and a careful coordination between configuration files. In essence, each configuration profile (stored in profiles folder in user configuration folder) is a snapshot of differences between the profile and the main user configuration file (named nvda.ini). When a profile becomes active, NVDA will load the profile file associated with the given profile and modify user settings according to values stored in the newly activated profile, and wwill record the name of the profile file to remind itself as to which profile is active (the default user configuration profile is named "normal configuration" with the file name of nvda.ini).
es: Los perfiles de configuración implican unos cuantos procedimientos de soporte y una cuidadosa coordinación entre archivos de configuración. En esencia, cada perfil de configuración (almacenado en la carpeta profiles en el directorio de configuración de usuario) es una instantánea de diferencias entre el perfil y el archivo de configuración principal del usuario (llamado nvda.ini). Cuando un perfil se activa, NVDA cargará el archivo de perfil asociado con el perfil dado y modificará los ajustes del usuario en función de los valores almacenados en el perfil recién activado. También registrará el nombre del archivo de perfil para recordarse a sí mismo qué perfil está activo (el perfil de configuración por defecto del usuario se llama "Configuración normal" y tiene como nombre de archivo nvda.ini).

source: What if settings had errors? As part of the startup routine (portions of main function (source/core.py) prior to entering the main loop), NVDA will display a configuration error dialog if it detects serious issues with configuration values (in reality, ConfigObj notifies NVDA of this problem). You'll see this is also implemented in the Studio app module to deal with add-on configuration issues.
es: ¿Y si los ajustes tuvieran errores? Como parte del procedimiento de inicialización (partes de la función principal (source/core.py) antes de entrar en el bucle principal), NVDA mostrará un diálogo de error de configuración si detecta problemas serios con los valores de configuración (en realidad, ConfigObj notifica a NVDA de este problema). Verás que esto también está implementado en el módulo de aplicación de Studio para tratar con los problemas de configuración del complemento.

source: ### All about StationPlaylist add-on Configuration Manager
es: ### Todo sobre el gestor de configuración del complemento StationPlaylist

source: Until recently, Studio app module handled all add-on configuration routines. With the advent of add-on 5.0 which introduced add-on settings dialog, configuration management routines were split into a dedicated Configuration Manager (splstudio.splconfig). The new module takes care of configuration routines, including validating the user configuration, presenting add-on settings dialog and other dialogs inside it, handling broadcast profiles and more. In add-on 7.0, routines pertaining to configuration dialog were split into splconfui module, with the main add-on settings listed under NVDA preferences menu.
es: Hasta hace poco, el módulo de aplicación de Studio se encargaba de la gestión de la configuración del complemento. Con la llegada del complemento 5.0 y el diálogo de ajustes del complemento, los procedimientos de gestión de configuración se movieron a un gestor de configuración dedicado (splstudio.splconfig). El nuevo módulo se encarga de las funciones de configuración, incluida su validación, la presentación del diálogo de ajustes del complemento y otros diálogos dentro de él, la gestión de perfiles de emisión y más. En el complemento 7.0, los procedimientos pertenecientes al diálogo de configuración se movieron al módulo splconfui, estando los ajustes principales del complemento listados en el menú de preferencias de NVDA.

source: ### How settings are loaded, used and saved
es: ### Cómo se cargan, se usan y se guardan los ajustes
