Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/spladdoninternals.po
Languages: es

source: # NVDA Add-on internals: StationPlaylist
es: # Complementos de NVDA vistos por dentro: StationPlaylist

source: Author: Joseph Lee
es: Autor: Joseph Lee

source: Based on StationPlaylist Add-on for NVDA 21.10
es: Basado en el complemento StationPlaylist para NVDA 21.10

source: ## 2021 Preface and notes
es: ## Prólogo y notas de 2021

source: This guide has gone through many revisions, style changes, and updated to include features in latest add-on releases. When first published in 2015, it was done as a series of blog posts. Now in 2021, edits were made to remove traces of old style and update this guide to reflect add-on features as of 2021 and beyond.
es: Esta guía ha pasado por muchas revisiones, cambios de estilo, y se ha actualizado para incluir características de las últimas versiones del complemento. Cuando se publicó por primera vez en 2015, se elaboró como una serie de entradas de blog. Ahora en 2021, se está editando para eliminar las huellas del estilo anterior y actualizándose para reflejar las últimas características del 2021 y más allá.

source: In 2018, the scope of the add-on has expanded to cover StationPlaylist Creator and Track Tool. For the most part, this guide will still cover StationPlaylist Studio alone, but there are important changes made in recent releases that'll ask us to consider other programs in StationPlaylist suite. In particular, trakc item class inheritance hierarchy has changed so many column navigation commands are available when dealing with tracks across SPL apps. As a result, the add-on itself was renamed in 2019 to just "StationPlaylist".
es: En 2018 también se expandió el ámbito del complemento para cubrir StationPlaylist Creator y la herramienta de pista. En su mayor parte, esta guía todavía cubrirá StationPlaylist Studio únicamente, pero hay cambios importantes que se han hecho en las versiones más recientes que nos harán plantearnos añadir otros programas de la suite StationPlaylist. En particular, la jerarquía de herencia de la clase de elemento de pista ha cambiado, por lo que muchas órdenes de navegación por columnas están disponibles al tratar con pistas en las aplicaciones de SPL. Como resultado, el propio complemento se renombró en 2019 a "StationPlaylist".

source: Later in 2018, add-on update feature was removed in favor of Add-on Updater add-on. Although the source code for this feature is gone, information pertaining to it will be documented here for sake of completeness (after all, Add-on Updater's update checking mechanism can trace its roots to Studio add-on).
es: Más tarde en 2018, la función de búsqueda de actualizaciones se eliminó en favor del complemento Add-on Updater. Aunque el código fuente de esta función ya se ha ido, la información relacionada con él permanecerá aquí con motivos de completitud (a fin de cuentas, el complemento Add-on Updater tiene sus raíces en el complemento de Studio).

source: Then came 2019, and so did Python 3, abstract classes, and new encoder types. The old days of just dealing with SAM and SPL encoders is over, and encoder support has been redesigned from ground up in 2020. Compared to old add-on releases, the scope of SPL Utilities global plugin has been reduced in favor of giving more autonomy to encoder support app modules (mostly SPL Engine). Along with this, the add-on has been updated to be powered strictly by Python 3.
es: Después vino 2019, y con él llegaron Python 3, las clases abstractas, y nuevos tipos de codificadores. Aquellos días de tratar sólo con los codificadores SAM y SPL se acabaron, y se ha rediseñado el soporte de codificadores de arriba a abajo en 2020. En comparación con versiones antiguas del complemento, el ámbito de la extensión global de utilidades de SPL se ha reducido en favor de una mayor autonomía para los módulos de aplicación de soporte del codificador (mayoritariamente el motor de SPL). Aparte de esto, se ha actualizado el complemento para apoyarse estrictamente en Python 3.

source: In 2020, the add-on has gone through another major change: removal of unnecessary features and splitting broadcast profiles management from add-on settings dialog. In the old days, add-on settings management was intimately tied to broadcast profiles, and that was the reason why broadcast profiles panel was an integral part of add-on settings dialog. In early 2020, several bugs stemming from design decisions years ago came to light such as applying settings changes to wrong profile. Together with a need to make add-on settings panels independent of each other in order to allow users to open alarms panel from anywhere (described later), it was decided to split broadcast profiles panel into its own dialog.
es: En 2020, el complemento ha sufrido otro cambio importante: eliminación de características innecesarias y separación de la gestión de perfiles de emisión y las opciones del complemento. Antes, la gestión de ajustes del complemento se encontraba íntimamente relacionada con los perfiles de emisión, y esa era la razón por la que el panel de perfiles de emisión era parte integral del diálogo de opciones del complemento. A principios de 2020, salieron a la luz varios fallos causados por decisiones de diseño de hace años, tales como la aplicación de los ajustes en el perfil equivocado. Junto a la necesidad de hacer los paneles de opciones del complemento independientes entre sí para permitir a los usuarios abrir el panel de alarmas desde cualquier parte (descrito más adelante), se decidió separar el panel de perfiles de emisión y ponerlo en su propio diálogo.

source: Another big change in 2020 was removing unnecessary and problematic features. For years, Window-Eyes users were supported by having a dedicated command layout in SPL Assistant layer. As Window-Eyes usage has declined, the dedicated command layout was removed. Another removed feature is time-based (triggered) broadcast profiles as it became clear that defining instant switch profiles were enough, coupled with design problems in the feature itself that showed up in recent years. Just like add-on update feature, time-based profiles feature will be described to provide historical overview.
es: Otro gran cambio de 2020 fue la eliminación de características innecesarias y problemáticas. Durante años, los usuarios de Window Eyes recibían soporte mediante un diseño de órdenes dedicado en la capa del asistente de SPL. Según ha ido decayendo el uso de Window Eyes, el diseño de órdenes dedicadas se ha eliminado. Otra función eliminada es la de perfiles de emisión basados en tiempo (disparados), ya que quedó claro que definir perfiles de cambio instantáneo es suficiente, y la característica en sí tiene problemas de diseño que se han descubierto en los últimos años. Al igual que la función de actualización del complemento, la función de perfiles basados en tiempo se describirá para proporcionar una visión general histórica.

source: 2021 may turn out to be a turning point for the add-on. I (Joseph Lee) will be stepping down from maintaining this add-on. My hope is that new maintainers (whoever might be) will step up and improve this add-on greatly.
es: 2021 puede convertirse en un punto de inflexión para el complemento. Yo (Joseph Lee) dejaré de mantener este complemento. Tengo la esperanza de que los nuevos encargados de su mantenimiento (quienes quiera que sean) sigan adelante y hagan fantásticas mejoras a este complemento.

source: ## Introduction
es: ## Introducción

source: If you are a radio broadcaster, you might be accustomed to activities involved when producing a show. This may include playlist selection, scheduling break notes, responding to requests, monitoring listener count and encoding status and so on. To assist a broadcaster, a broadcast automation program is used, and one of the popular apps is called StationPlaylist Studio.
es: Si eres locutor de radio, podrías estar acostumbrado a las actividades involucradas al producir un programa. Aquí se pueden incluir la selección de la lista de reproducción, programación de notas de interrupción, respuesta a peticiones, monitorización del número de oyentes y estado de la codificación, entre otras. Para asistir a un locutor, se usa un programa de automatización de la emisión, y uno de los más populares se llama StationPlaylist Studio.

source: In NVDA Add-on Internals: StationPlaylist, we'll learn about what StationPlaylist Studio (and other StationPlaylist (SPL) suite of apps) is and how the NVDA add-on works. You don't have to install or use the NVDA add-on to understand the ins and outs of this powerful add-on (using the add-on might help you better appreciate the defth of this material; for fuller experience, it is handy to have the add-on source code in front of you as you navigate this article). So let's get started by learning more about SPL suite of applications.
es: En Complementos de NVDA vistos por dentro: StationPlaylist, aprenderemos qué es Studio (y la suite de aplicaciones de SPL) y cómo funciona este complemento de NVDA. No tienes que instalar o utilizar este potente complemento para entender sus peculiaridades, (usar el complemento podría ayudarte a apreciar la importancia de este material; para una experiencia más completa, es útil que tengas el código fuente del complemento ante ti mientras navegas por este artículo). Ahora, empecemos aprendiendo más sobre la suite de aplicaciones SPL.

source: Note: throughout this guide, unless specified otherwise, the terms "StationPlaylist", "SPL", and "Studio" refer to the same thing.
es: Nota: a lo largo de esta guía, a menos que se especifique lo contrario, los términos "StationPlaylist", "SPL" y "Studio" hacen referencia a la misma cosa.

source: ### Introducing StationPlaylist app suite and the NVDA add-on
es: ### Presentación de la suite de aplicaciones de StationPlaylist y el complemento para NVDA

source: [StationPlaylist suite](www.stationplaylist.com) is a collection of programs to help broadcasters plan, run, and do related activities around broadcasting. The apps consist of Studio, Creator, Track Tool, Streamer and others.
es: [La suite de StationPlaylist](www.stationplaylist.com) es una colección de programas para ayudar a los locutores a planear, ejecutar y hacer actividades relacionadas con la emisión. Las aplicaciones constan de Studio, Creator, la herramienta de pista, Streamer y otras.

source: StationPlaylist Studio is a broadcast automation software that helps broadcasters schedule trakcs, play jingles and more. It includes support for break notes, hourly playlist, track tagging and comes with tools to manage track playback such as setting track intros. In studio 5.00 and later, it includes its own stream encoder.
es: StationPlaylist Studio es un software de automatización de emisiones que ayuda a los locutores a planificar pistas, reproducir jingles y más. Incluye soporte para notas de interrupción, listas de reproducción por cada hora, etiquetado de pistas y viene con herramientas para gestionar la reproducción de pistas, como establecer la introducción de pista. En Studio 5.00 y posteriores, se incluye un codificador de flujos propio.

source: StationPlaylist Creator and Remote Voice Track (VT) are mostly used for planning a show and designing playlists to be used by Studio. It can be used to define spot groups, custom track categories and more. Whereas Creator is limited to local playlists, Remote VT is used to manage playlists stored on a remote computer.
es: StationPlaylist Creator y Remote Voice Track (VT) se usan mayoritariamente para planificar un programa y diseñar listas de reproducción para que las use Studio. Pueden usarse para definir grupos de spots, categorías personalizadas de pista y más. Mientras que Creator se limita sólo a listas de reproducción locales, Remote VT se usa para gestionar listas de reproducción almacenadas en un ordenador remoto.

source: StationPlaylist Track Tool is mainly used for managing tracks. It is often employed to define introductions, cue points and other properties of tracks.
es: La herramienta de pista de StationPlaylist se usa principalmente para gestionar pistas. Con frecuencia se emplea para definir introducciones, puntos clave y otras propiedades de las pistas.

source: StationPlaylist Streamer is useful for broadcasting a show with something other than Studio. As such, it comes with support for various encoders and digital signal processing (DSP) modules.
es: StationPlaylist Streamer es útil para emitir un programa con algo diferente a Studio. Por tanto, viene con soporte para diversos codificadores y módulos procesadores de señal digital (DSP).

source: In addition to the components above, StationPlaylist suite includes additional tools such as VT Recorder, and a host of internal support modules such as SPL Engine used for DSP processing and other tasks.
es: Además de los componentes anteriores, la suite de StationPlaylist incluye herramientas adicionales como el grabador de pistas de voz, y un conjunto de módulos internos de soporte como el motor SPL para procesar DSP y otras tareas.

source: Is Studio suite accessible? Surprisingly, yes. It is possible to use app features without using screen reader scripts and add-ons. However, there are times when a broadcaster would use scripts, such as announcing status changes, monitoring track intros and endings, enhanced support for encoders and so on, and NVDA add-on for StationPlaylist (usually refered to as SPL) accomplishes this well.
es: ¿Es la suite de Studio accesible? Sorprendentemente, sí. Es posible utilizar las funciones de Studio sin usar scripts para lectores de pantalla y complementos. Sin embargo, hay veces en las que un locutor usaría scripts, como el anunciado de cambios de estado, monitorización de inicio y fin de pistas, soporte mejorado para codificadores y demás, y el complemento de NVDA para StationPlaylist (al que nos referiremos normalmente como SPL) resuelve todo esto bien.

source: ### StationPlaylist add-on: a history
es: ### Complemento StationPlaylist: una historia

source: In 2011, Geoff Shang, a seasoned blind broadcaster, started working on SPL Studio add-on. This early version (numbered 0.01) was developed to let NVDA announce various status changes such as automation toggle and so on. This initial version, co-developed by James Teh (a former lead developer of NVDA screen reader) was considered a quick project, and further development ceased until 2013.
es: En 2011, Geoff Shang, un locutor ciego experimentado, comenzó a trabajar en el complemento para SPL Studio. Esta versión temprana (numerada como 0.01) fue desarrollada para hacer que NVDA verbalizara diversos cambios de estado, como la alternancia de automatización y así. Esta versión inicial, co-desarrollada con James Teh (uno de los principales desarrolladores del lector de pantalla NVDA) se consideró como un proyecto rápido, y el desarrollo cesó hasta 2013.

source: In 2013, I (Joseph Lee) received several emails regarding NVDA's support for SPL Studio with a request for someone to write an add-on for it. As I was still new to add-on development then (this was after I developed Control Usage Assistant and GoldWave), I decided to take on this challenge in order to learn more Python and to practice what I learned in computer science labs at UC Riverside. I first downloaded the existing add-on (0.01) and installed Studio 5.01 on my computer to learn more about this program and to gather suggestions from SPL users. After little over a month of development and preview releases, I released Studio add-on 1.0 in January 2014.
es: En 2013, yo (Joseph Lee) recibí varios correos relacionados con el soporte de NVDA para SPL Studio con una petición de que alguien escribiera un complemento para él. Como todavía era nuevo en el desarrollo de complementos (esto vino después de que desarrollara Control Usage Assistant y GoldWave), decidí aceptar este reto para aprender más sobre Python y practicar lo aprendido en los laboratorios de ciencias de la computación en UC Riverside. Primero descargué el complemento existente (0.01) e instalé Studio 5.01 en mi ordenador para aprender más sobre este programa y recopilar sugerencias de otros usuarios de SPL. Después de un mes de desarrollo y versiones de prueba, liberé el complemento para Studio 1.0 en enero de 2014.

source: Most of the early versions (1.x, 2.x, 3.x, released throughout 2014) were mostly quick projects that bridged the gap between NVDA and other screen readers (Brian Hartgen's JAWS scripts were my inspiration and have studied documentation for Jeff Bishop's Window-Eyes scripts). These early versions, supporting Studio 4.33 and later, were also used to fix bugs encountered by Studio users - for instance, a broadcaster posted a YouTube video explaining how NVDA was not reading edit fields, which was fixed early on. Later releases (4.x, 5.x, 6.x, released throughout 2015), further bridged the gap with other screen readers and introduced unique features (for instance, add-on 5.0 introduced a configuration dialog, and 6.0 introduced concept of a broadcast profile). In late 2016, seeing that some of my add-ons were using year.month scheme for versioning, I decided to switch SPL to follow this model after receiving comments from the NVDA community. As of time of writing, another significant shift took place in 20.x and 21.x releases.
es: La mayoría de las primeras versiones (1.x, 2.x, 3.x, publicadas a lo largo de 2014) fueron principalmente proyectos rápidos que reducían la brecha entre NVDA y otros lectores de pantalla (los scripts para JAWS de Brian Hartgen fueron mi fuente de inspiración y he estudiado la documentación de los scripts para Window Eyes creados por Jeff Bishop). Estas primeras versiones, que daban soporte a Studio 4.33 y versiones posteriores, se utilizaron también para solucionar fallos encontrados por usuarios de Studio - por ejemplo, un locutor subió un vídeo a YouTube explicando que NVDA no estaba leyendo los cuadros de edición, cosa que se solucionó rápidamente. Las siguientes versiones (4.x, 5.x, 6.x, publicadas a lo largo de 2015), profundizaron en reducir las diferencias con otros lectores de pantalla e introdujeron características únicas (por ejemplo, el complemento 5.0 vino con un diálogo de configuración, y el 6.0 introdujo el concepto de perfil de emisión). Ya avanzado 2016, viendo que algunos de mis complementos estaban adoptando el esquema año.mes para las versiones, decidí cambiar SPL para que siguiera este modelo tras recibir comentarios de la comunidad de NVDA. En el momento en que escribo este artículo, se está llevando a cabo otra transformación significativa en las versiones 20.x y 21.x.

source: Highlights of past major releases and subsequent maintenance releases include:
es: Lo reseñable de las versiones pasadas principales y de mantenimiento es lo siguiente:

source: * 1.x: Initial release, added end of track alarm and other features.
es: * 1.x: versión inicial, añadida alarma de fin de pista y otras características.

source: * 2.x: Track Finder and better routines to recognize Studio versions.
es: * 2.x: buscador de pista y procedimientos mejores para reconocer versiones de Studio.

source: * 3.x: first long-term support (LTS) release, Cart Explorer, support for SAM Encoder and no need to stay on the encoder window during connection attempts. This was the last version to support Studio 4.33.
es: * 3.x: primera versión de soporte extendido (lts), explorador de Cart, soporte para el codificador SAM y eliminación de la necesidad de permanecer en la ventana del codificador durante los intentos de conexión. Esta fue la última versión que dio soporte a Studio 4.33.

source: * 4.x: Library scan, support for SPL encoder and studio 5.10.
es: * 4.x: escaneo de biblioteca, soporte para el codificador de SPL y Studio 5.10.

source: * 5.x: Track Dial, dedicated configuration dialog.
es: * 5.x: dial de pista, diálogo de configuración dedicado.

source: * 6.x: Broadcast profiles, metadata streaming, column search and announcement reordering.
es: * 6.x: perfiles de emisión, flujo de metadatos, búsqueda de columnas y reordenado de verbalizaciones.

source: * 7.x: second LTS release, add-on updates, time-based profile switching, Track Columns Explorer and others. This is the last version to support Studio 5.01. Renamed to 15.x in late 2016.
es: * 7.x: segunda versión lts, actualizaciones del complemento, cambio de perfiles basado en tiempo, explorador de columnas de pista y otros. Esta es la última versión que da soporte a Studio 5.01. Se renombró a 15.x ya entrado el 2016.

source: * 16.10 (formerly 8.0): Columns explorer for Track Tool, selective data resets.
es: * 16.10 (también conocida como 8.0): explorador de columnas para la herramienta de pista, restablecimientos selectivos de datos.

source: * 17.04 (formerly 9.0: vertical column navigation, playlist snapshots, support for Studio 5.20.
es: * 17.04 (conocida como 9.0): navegación vertical por columnas, instantáneas de listas de reproducción, soporte para Studio 5.20.

source: * 17.08 (10.0: listener request notification, column header announcement suppression. This is the last major version, with subsequent versions using continuous delivery.
es: * 17.08 (10.0): notificación de solicitud de oyente, supresión de la verbalización de cabeceras de columna. Esta es la última versión principal, con las siguientes versiones usando entrega continua.

source: * 17.12: end of support for old Windows releases, add-on settings reorganization, extension points.
es: * 17.12: fin de soporte para versiones antiguas de Windows, reorganización de los ajustes del complemento, puntos de extensión.

source: * 18.06: responding to recent NVDA features, playlist transcripts, wxPython 4 support, partial playlist snapshots, expanding the scope of the add-on.
es: * 18.06: respuesta ante nuevas características de NVDA, transcripción de listas de reproducción, soporte para WXPython 4, instantáneas parciales de la lista de reproducción, expansión del ámbito del complemento.

source: * 18.09: third LTS release, add-on settings panels, checkable list, wxPython 4.
es: * 18.09: tercera versión LTS, paneles de configuración del complemento, lista con casillas de verificación, WXPython 4.

source: * 19.01: add-on update feature removed, compatibility flags with future NVDA releases.
es: * 19.01: función de actualización del complemento eliminada, indicadores de compatibilidad para versiones futuras de NVDA.

source: * 19.07: renaming the add-on, settings reload/reset.
es: * 19.07: se renombra el complemento, recarga / restablecimiento de configuración.

source: * 20.02: Python 3, restructured encoders support and new encoders, Creator's Playlist Editor support.
es: * 20.02: Python 3, soporte reestructurado de codificadores y nuevos codificadores, soporte del editor de listas de reproducción de Creator.

source: * 20.06: removed Window-Eyes support, time-based broadcast profiles facility removed, support for Remote VT client.
es: * 20.06: se eliminaron el soporte para Window Eyes y la función de perfiles de emisión basados en tiempo, soporte para el cliente Remote VT.

source: * 20.09: fourth LTS release, pilot features removed, connecting to individual encoders in SPL encoders, background encoder monitor registry.
es: * 20.09: cuarta versión de soporte extendido, se eliminan las características piloto, conexión individual a codificadores en los codificadores SPL, registro de monitorización del codificador en segundo plano.

source: * 21.01: track property announcement changes, more lint fixes.
es: * 21.01: cambios en el anuncio de la propiedad de la pista, más correcciones de estilo.
