Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/spladdoninternals.po
Languages: es

source: For add-on writers looking for quality add-on documentation, I hope this series gave you an inspiration as to how to write amazing documentation in your future projects. For people new to add-on writing or for those interested in writing an add-on, I hope this Add-ons Internals series served as a handy resource for your projects, and in extension, gave you an idea as to how certain NVDA functions work. If you'd like to reference this documentation or use it as a blueprint, you are more than welcome to do so. Thank you community add-on reviewers for your continued support and reviews.
es: Para creadores de complementos que buscan documentación de calidad, espero que este artículo os haya inspirado para escribir buena documentación en vuestros proyectos futuros. Para la gente nueva en el desarrollo de complementos o para aquellos interesados en desarrollar un complemento, espero que este artículo de complementos de NVDA vistos por dentro haya servido como un recurso útil para vuestros proyectos, y extensión, os haya dado una idea de cómo funcionan ciertas funciones de NVDA. Si queréis hacer referencia a esta documentación o usarla como un modelo, os invito a hacerlo. Gracias a los revisores de la comunidad de complementos por vuestro soporte continuo y vuestras revisiones.

source: ### Important notices and credits
es: ### Avisos importantes y créditos

source: I'd like to thank StationPlaylist staff for continued collaboration with screen reader users in regards to accessibility of Studio. A special thanks goes to Jamie Teh from NV Access and Geoff Shang (original add-on author) for giving me and others a foundation for future goodies. As always, the biggest thanks goes to you, the users of SPL add-on for your continued feedback and teaching me new things about studio.
es: Me gustaría dar las gracias al personal de StationPlaylist Studio por su colaboración continua con usuarios de lectores de pantalla en cuanto a la accesibilidad de Studio. Va un agradecimiento especial para Jamie Teh de NV Access y Geoff Shang (el autor original del complemento) por darme a mí y a otros una base de la que partir. Y como siempre, el mayor agradecimiento es para vosotros, los usuarios del complemento para SPL, por vuestros continuos comentarios y por enseñarme cosas nuevas sobre Studio.

source: Source code notice: to protect copyrights, parts of Studio API has not been documented. Also, source code discussed throughout this series may change as future add-on versions are developed.
es: Aviso del código fuente: para proteger los derechos de copia, no se han documentado algunas partes de la api de Studio. Además, el código fuente expuesto a lo largo de este artículo puede cambiar según se desarrollen versiones futuras del complemento.

source: Copyrights: StationPlaylist Studio, Track Tool and StationPlaylist Encoders are copyright StationPlaylist.com. NonVisual Desktop Access is copyright 2006-2021 NV access Limited (released under GPL). SAM Encoders is copyright Spatial Audio. Microsoft Windows and Windows API are copyright Microsoft Corporation. Python is copyright Python Software Foundation. StationPlaylist add-on for NVDA is copyright 2011, 2013-2021 Geoff Shang, Joseph Lee and others (released under GPL). Other products mentioned are copyrighted by owners of these products (licenses vary).
es: Derechos de copia: StationPlaylist Studio, la herramienta de pista y los codificadores de StationPlaylist tienen copyright de StationPlaylist.com. NonVisual Desktop Access tiene copyright 2006-2021 de NV access Limited (liberado bajo la GPL). Los codificadores SAM tienen copyright de Spatial Audio. Microsoft Windows y la API de Windows tienen copyright de Microsoft Corporation. Python tiene copyright de la Python Software Foundation. El complemento StationPlaylist Studio para NVDA tiene copyright 2011, 2013-2021 de Geoff Shang, Joseph Lee y otros (liberado bajo la GPL). Otros productos mencionados tienen copyright de sus respectivos propietarios (las licencias varían).

source: ## References
es: ## Referencias

source: 1. JAWS scripts for StationPlaylist Studio (Hartgen Consultancy): http://www.hartgen.org/studio.html
es: 1. Scripts de JAWS para StationPlaylist Studio (Hartgen Consultancy): http://www.hartgen.org/studio.html

source: 2. Window-Eyes app for StationPlaylist (Jeff Bishop/AI Squared): https://www.gwmicro.com/App_Central/Apps/App_Details/index.php?scriptid=1268&readMore&media=print
es: 2. Aplicación de Window-Eyes para StationPlaylist (Jeff Bishop/AI Squared): https://www.gwmicro.com/App_Central/Apps/App_Details/index.php?scriptid=1268&readMore&media=print

source: 5. Python 2.7.13 documentation overview (Python Software Foundation): https://docs.python.org/2/
es: 5. Descripción de la documentación de Python 2.7.13 (Python Software Foundation): https://docs.python.org/2/

source: 7. What is a Windows handle (Stack Overflow): http://stackoverflow.com/questions/902967/what-is-a-windows-handle
es: 7. Qué es un manejador de Windows (Stack Overflow): http://stackoverflow.com/questions/902967/what-is-a-windows-handle

source: 8. FindWindow (user32.dll) reference (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/ms633499(v=vs.85).aspx
es: 8. Referencia de FindWindow (user32.dll) (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/ms633499(v=vs.85).aspx

source: 9. SendMessage (user32.dll) reference (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/ms644950(v=vs.85).aspx
es: 9. Referencia de SendMessage (user32.dll) (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/ms644950(v=vs.85).aspx

source: 10. NVDA Developer Guide (NV Access): http://www.nvaccess.org/files/nvda/documentation/developerGuide.html
es: 10. Guía del desarrollador de NVDA (NV Access): http://www.nvaccess.org/files/nvda/documentation/developerGuide.html

source: 11. OpenProcess (kernel32.dll) reference (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/ms684320(v=vs.85).aspx
es: 11. Referencia de OpenProcess (kernel32.dll) (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/ms684320(v=vs.85).aspx

source: 12. wxPython online docs: http://www.wxpython.org/onlinedocs.php
es: 12. Documentación en línea de wxPython: http://www.wxpython.org/onlinedocs.php

source: 13. Higher order functions (How do you make a higher order function): http://effbot.org/pyfaq/how-do-you-make-a-higher-order-function-in-python.htm
es: 13. Funciones de alto nivel (cómo hacer una función de alto nivel): http://effbot.org/pyfaq/how-do-you-make-a-higher-order-function-in-python.htm

source: 14. Time (Python documentation, Python Software Foundation): https://docs.python.org/2/library/time.html
es: 14. Time (Documentación de Python, Python Software Foundation): https://docs.python.org/2/library/time.html

source: 15. GetTimeFormat (kernel32.dll) reference (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/dd318130(v=vs.85).aspx
es: 15. Referencia de GetTimeFormat (kernel32.dll) (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/dd318130(v=vs.85).aspx

source: 16. Event loop (Wikipedia): https://en.wikipedia.org/wiki/Event_loop
es: 16. Bucle de eventos (Wikipedia): https://en.wikipedia.org/wiki/Event_loop

source: 17. Event-driven programming (Wikipedia): https://en.wikipedia.org/wiki/Event-driven_programming
es: 17. Programación dirigida por eventos (Wikipedia): https://en.wikipedia.org/wiki/Event-driven_programming

source: 18. Sinclair, Rob. Microsoft Active Accessibility architecture, Microsoft Developer Network, August 2000. https://msdn.microsoft.com/en-us/library/ms971310.aspx
es: 18. Sinclair, Rob. Arquitectura de Microsoft Active Accessibility, Microsoft Developer Network, Agosto del 2000. https://msdn.microsoft.com/en-us/library/ms971310.aspx

source: 19. UI Automation Overview, Microsoft Developer Network. https://msdn.microsoft.com/en-us/library/ms747327(v=vs.110).aspx
es: 19. Descripción de UI Automation, Microsoft Developer Network. https://msdn.microsoft.com/en-us/library/ms747327(v=vs.110).aspx

source: 20. Java Access Bridge overview, Java SE Desktop Accessibility, Oracle. http://www.oracle.com/technetwork/articles/javase/index-jsp-136191.html
es: 20. Descripción de Java Access Bridge, Java SE Desktop Accessibility, Oracle. http://www.oracle.com/technetwork/articles/javase/index-jsp-136191.html

source: 21. Introduction to OOP (Object-Oriented Programming) with Python, Voidspace. http://www.voidspace.org.uk/python/articles/OOP.shtml
es: 21. Introducción a la POO (programación orientada a objetos) con Python, Voidspace. http://www.voidspace.org.uk/python/articles/OOP.shtml

source: 22. Non-Programmer's Tutorial for Python 3/Intro to Object Oriented Programming in Python 3 - Wikibooks. https://en.wikibooks.org/wiki/Non-Programmer%27s_Tutorial_for_Python_3/Intro_to_Object_Oriented_Programming_in_Python_3
es: 22. Tutorial de no programadores para Python 3/Introducción a la programación orientada a objetos en Python 3 - Wikibooks. https://en.wikibooks.org/wiki/Non-Programmer%27s_Tutorial_for_Python_3/Intro_to_Object_Oriented_Programming_in_Python_3

source: 23. Method Resolution Order, The History of Python, june 23, 2010. http://python-history.blogspot.com/2010/06/method-resolution-order.html
es: 23. Orden de resolución de métodos, la historia de Python, 23 de junio de 2010. http://python-history.blogspot.com/2010/06/method-resolution-order.html

source: 24. List View, Microsoft Developer Network: https://msdn.microsoft.com/en-us/library/windows/desktop/bb774737(v=vs.85).aspx
es: 24. Vista de lista, Microsoft Developer Network: https://msdn.microsoft.com/en-us/library/windows/desktop/bb774737(v=vs.85).aspx

source: 25. List View Messages, Microsoft Developer Network: https://msdn.microsoft.com/en-us/library/windows/desktop/ff485961(v=vs.85).aspx
es: 25. Mensajes de vista de lista, Microsoft Developer Network: https://msdn.microsoft.com/en-us/library/windows/desktop/ff485961(v=vs.85).aspx

source: 26. List View Item structure, Microsoft Developer Network: https://msdn.microsoft.com/en-us/library/windows/desktop/bb774760(v=vs.85).aspx
es: 26. Estructura de un elemento de una vista de lista, Microsoft Developer Network: https://msdn.microsoft.com/en-us/library/windows/desktop/bb774760(v=vs.85).aspx

source: 27. VirtualAllocEx (kernel32.dll) reference (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/aa366890(v=vs.85).aspx
es: 27. Referencia de VirtualAllocEx (kernel32.dll) (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/aa366890(v=vs.85).aspx

source: 28. VirtualFreeEx (kernel32.dll) reference (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/aa366894(v=vs.85).aspx
es: 28. Referencia de VirtualFreeEx (kernel32.dll) (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/aa366894(v=vs.85).aspx

source: 29. WriteProcessMemory (kernel32.dll) reference (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/ms681674(v=vs.85).aspx
es: 29. Referencia de WriteProcessMemory (kernel32.dll) (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/ms681674(v=vs.85).aspx

source: 30. ReadProcessMemory (kernel32.dll) reference (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/ms680553(v=vs.85).aspx
es: 30. Referencia de ReadProcessMemory (kernel32.dll) (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/ms680553(v=vs.85).aspx

source: 31. Ctypes (Python documentation, Python Software Foundation): https://docs.python.org/2/library/ctypes.html
es: 31. Ctypes (Documentación de Python, Python Software Foundation): https://docs.python.org/2/library/ctypes.html

source: 33. Multi-core processor (wikipedia): https://en.wikipedia.org/wiki/Multi-core_processor
es: 33. Procesadores de múltiples núcleos (wikipedia): https://en.wikipedia.org/wiki/Multi-core_processor

source: 34. Multi-core introduction, Intel Developer Zone, March 5, 2012: https://software.intel.com/en-us/articles/multi-core-introduction
es: 34. Introducción al multinúcleo, zona de desarrolladores de Intel, 5 de marzo de 2012: https://software.intel.com/en-us/articles/multi-core-introduction

source: 35. Intel Core I7-5960X specifications (Intel ARK): http://ark.intel.com/products/82930/Intel-Core-i7-5960X-Processor-Extreme-Edition-20M-Cache-up-to-3_50-GHz
es: 35. Especificaciones de Intel Core I7-5960X (Intel ARK): http://ark.intel.com/products/82930/Intel-Core-i7-5960X-Processor-Extreme-Edition-20M-Cache-up-to-3_50-GHz

source: 36. Intel Xeon E7-8895V3 specifications (Intel ARK): http://ark.intel.com/products/84689/Intel-Xeon-Processor-E7-8895-v3-45M-Cache-2_60-GHz
es: 36. Especificaciones de Intel Xeon E7-8895V3 (Intel ARK): http://ark.intel.com/products/84689/Intel-Xeon-Processor-E7-8895-v3-45M-Cache-2_60-GHz

source: 38. Threading (Python documentation, Python Software Foundation): https://docs.python.org/2/library/threading.html
es: 38. Threading (Documentación de Python, Python Software Foundation): https://docs.python.org/2/library/threading.html

source: 39. Multiprocessing (Python documentation, Python Software Foundation): https://docs.python.org/2/library/multiprocessing.html#module-multiprocessing
es: 39. Multiprocessing (Documentación de Python, Python Software Foundation): https://docs.python.org/2/library/multiprocessing.html#module-multiprocessing

source: 40. Comma-separated values (Wikipedia): https://en.wikipedia.org/wiki/Comma-separated_values
es: 40. Valores separados por coma (Wikipedia): https://en.wikipedia.org/wiki/Comma-separated_values

source: 41. RFC 4180 (Common Format and MIME Type for Comma-Separated Values (CSV) Files), Internet Engineering Task Force: https://tools.ietf.org/html/rfc4180
es: 41. RFC 4180 (formato común y tipo MIME para archivos de valores separados por coma (CSV)), Internet Engineering Task Force: https://tools.ietf.org/html/rfc4180

source: 42. Import or export text (.txt or .csv) files, Microsoft Office Support for Microsoft Excel: https://support.office.com/en-za/article/Import-or-export-text-txt-or-csv-files-5250ac4c-663c-47ce-937b-339e391393ba
es: 42. Importar o exportar texto (archivos .txt or .csv), soporte de Microsoft Office para Microsoft Excel: https://support.office.com/en-za/article/Import-or-export-text-txt-or-csv-files-5250ac4c-663c-47ce-937b-339e391393ba

source: 43. CSV (Python documentation, Python Software Foundation): https://docs.python.org/2/library/csv.html
es: 43. CSV (Documentación de Python, Python Software Foundation): https://docs.python.org/2/library/csv.html

source: 44. Cache (Wikipedia): https://en.wikipedia.org/wiki/Cache_(computing)
es: 44. Caché (Wikipedia): https://en.wikipedia.org/wiki/Cache_(computing)

source: 45. Os (Python documentation, Python Software Foundation): https://docs.python.org/2/library/os.html
es: 45. Os (Documentación de Python, Python Software Foundation): https://docs.python.org/2/library/os.html

source: 46. Configparser (Python documentation, Python Software Foundation): https://docs.python.org/2/library/configparser.html
es: 46. Configparser (Documentación de Python, Python Software Foundation): https://docs.python.org/2/library/configparser.html

source: 47. ConfigObj documentation: http://www.voidspace.org.uk/python/configobj.html
es: 47. Documentación de ConfigObj: http://www.voidspace.org.uk/python/configobj.html

source: 48. Validate module documentation: http://www.voidspace.org.uk/python/validate.html
es: 48. Documentación del módulo Validate: http://www.voidspace.org.uk/python/validate.html

source: 49. Spin control (wx.SpinCtrl) documentation (WXPython): http://wxpython.org/Phoenix/docs/html/SpinCtrl.html
es: 49. Documentación de Spin control (wx.SpinCtrl) (WXPython): http://wxpython.org/Phoenix/docs/html/SpinCtrl.html

source: 50. SetForegroundWindow (user32.dll) reference (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/ms633539(v=vs.85).aspx
es: 50. Referencia de SetForegroundWindow (user32.dll) (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/ms633539(v=vs.85).aspx
