Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/spladdoninternals.po
Languages: es

source: As you are broadcasting a show with Studio, you may find yourself in a situation where you need to switch to Studio quickly to take care of automation, insert new tracks and so on. An ideal situation is to switch to Studio when you press Alt+TAB (this isn't the case if you have more than two programs opened). For this reason, screen reader scripts for Studio includes a command to switch to Studio upon request (unassigned in NVDA).
es: Según estás emitiendo un programa en Studio, puedes encontrarte en una situación donde necesitas pasar rápidamente a Studio para cambiar la automatización, insertar nuevas pistas y demás. Una situación ideal es pasar a Studio al pulsar alt+tab (no es el caso si tienes más de dos programas abiertos). Por esta razón, los scripts de lectores de pantalla para Studio incluyen una orden para pasar a Studio a petición (sin asignar en NVDA).

source: Until 2016, this was accomplished with a function in the SPL Utilities module (SPLStudioUtils.fetchSPLForegroundWindow). This was employed not only by the main global plugin module (called from a script to focus to Studio window), but also used in encoders for various functions. The routine was as follows:
es: Hasta 2016, esto se llevaba a cabo con una función en el módulo de utilidades de SPL (SPLStudioUtils.fetchSPLForegroundWindow). No sólo la empleaba el módulo principal de la extensión global (llamada desde un script para llevar el foco a la ventana de Studio), sino que se usaba en los codificadores para diversos propósitos. El procedimiento era el siguiente:

source: 1. The focus to Studio script will check if Studio is running, and if so, it'll call the fetch window function, which in turn locates the desktop (shell) window to serve as the starting point for locating Studio window.
es: 1. El script que lleva el foco a Studio comprobará si Studio está en ejecución, y si es así, llamará a la función de recuperación de ventana, que primero localiza la ventana del escritorio (shell) para usarla como punto de partida para encontrar la ventana de Studio.

source: 2. NVDA will scan top-level windows (children of desktop object) until a Studio window (where the window's app module is the Studio app module) is found, and if found, NVDA will increment a Studio window candidate counter.
es: 2. NVDA escaneará las ventanas de nivel superior (hijas del objeto del escritorio) hasta que se encuentre la ventana de Studio (donde el módulo de aplicación de la ventana sea el de Studio), y si la encuentra, incrementará un contador de ventanas de Studio candidatas.

source: 3. Once top-level window scanning is complete, NVDA will take action based on what the Studio window candidate counter says before passing the foreground object back to the main script. It can do one of the following:
es: 3. Una vez se haya completado el escaneo de ventanas de alto nivel, NVDA tomará acciones en base a lo que diga el contador de ventanas candidatas de Studio antes de devolver el objeto en primer plano al script principal. Puede hacer una de las siguientes cosas:

source: 1. If counter is 0 (fg is None), NVDA will know that you have minimized Studio, so it'll tell you that Studio is minimized.
es: 1. Si el contador es 0 (fg es None), NVDA sabrá que has minimizado Studio, por lo que te lo dirá.

source: 2. If counter is 1, NVDA will locate the Studio window by looking for the main Studio window (user32.dll is involved).
es: 2. Si el contador es 1, NVDA localizará la ventana de Studio buscándola (user32.dll está implicada).

source: 3. For all other values, NVDA will assume the last window found is the Studio window (held in fg variable) and return it.
es: 3. Para el resto de valores, NVDA asumirá que la última ventana que ha encontrado es la ventana de Studio (contenida en la variable fg) y la devolverá.

source: 4. Back at the focus to Studio script, NVDA will either announce if Studio is minimized or switch to the foreground window returned by the fetch window function (fg.SetFocus).
es: 4. De vuelta al script que lleva el foco a Studio, NVDA indicará que Studio está minimizado o pasará a la ventana en primer plano devuelta por la función de recuperación de ventana (fg.SetFocus).

source: In 2017, this has been simplified to use SetForegroundWindow Windows API function with the handle to the Studio window being the only required parameter. Not only this simplified this routine significantly, it also improved performance of this command.
es: En 2017, eso se ha simplificado para usar la función SetForegroundWindow de la api de Windows, siendo el manejador de la ventana de Studio el único parámetro necesario que se pasaba. Esto no sólo simplificó la función significativamente, sino que también aumentó el rendimiento de esta orden.

source: One side effect was difficulty in determining if Studio window is minimized, hence the clue was seeing if NVDA says "unavailable". In 2020, focus to Studio routine was refined to look for visibility of Studio window, and if not visible, present an error message. One can then go to system tray and restore Studio window.
es: Un efecto colateral es que ya no es posible detectar Studio cuando está minimizado, pero nos podemos hacer una idea de ello cuando NVDA dice "No disponible" al intentar cambiar a Studio. En 2020, el procedimiento para llevar el foco a Studio se refinó para comprobar la visibilidad de la ventana de Studio, y si no se veía, presentaba un mensaje de error. De esa forma, el usuario puede ir a la bandeja del sistema y restaurar la ventana de Studio.

source: ## Encoder support
es: ## Soporte del codificador

source: We have now arrived at the penultimate chapter in this Add-on Internals article for StationPlaylist add-on: encoder support. We'll talk about how encoder support is implemented, how NVDA can detect encoder labels and a behind the scenes overview of what happens when you connect to a streaming server.
es: Ahora hemos llegado al penúltimo capítulo en este artículo de complementos vistos por dentro para el complemento de StationPlaylist: soporte del codificador. Hablaremos sobre cómo ha sido implementado el soporte del codificador, cómo puede NVDA detectar las etiquetas del codificador y una descripción tras el escenario de lo que pasa cuando te conectas a un servidor de emisión.

source: ### Encoder support: From suggestion to implementation
es: ### Soporte del codificador: de la sugerencia a la implementación

source: Originally, I wasn't planning on including encoder support into the SPL add-on. However, after talking to some Studio users who were using SAM encoders and seeing how other screen readers supported it, I decided to investigate SAM encoder support in summer 2014, resulting in encoders support becoming a part of SPL Utilities global plugin in add-on 3.0.
es: Originalmente, no tenía planeado incluir soporte para el codificador en el complemento de SPL. Sin embargo, tras hablar con varios usuarios de Studio que utilizaban los codificadores SAM y viendo cómo les daban soporte otros lectores de pantalla, decidí investigar el soporte para el codificador SAM en verano del 2014, dando como resultado el soporte para los codificadores como parte de la extensión global de utilidades de SPL en el complemento 3.0.

source: The first issue I had to solve was making NVDA recognize the encoder entries themselves. Once that was solved, the next task was announcing connection error messages, which led to figuring out how SAM encoders react when connected to a streaming server.
es: El primer problema que tenía que resolver era hacer que NVDA reconociera las entradas de codificador en sí mismas. Una vez estuvo resuelto, la siguiente tarea era verbalizar los mensajes de error de conexión, lo que llevó a averiguar cómo reaccionaban los codificadores SAM al conectarse a un servidor de emisión.

source: Originally, I manipulated text written to the screen to obtain needed status messages (via text infos). This routine caused some to experience screen flickering issues when connecting to a streaming server. This was resolved by using encoder description (obj.description), which opened up a possibility to monitor changes to this text via a background thread (more on this routine below), which also eliminated a need to stay on the encoders window until connected.
es: Originalmente, manipulaba el texto escrito en pantalla para obtener los mensajes de estado necesarios (mediante text infos). Este procedimiento causaba que algunos usuarios experimentaran problemas de parpadeo al conectarse a un servidor de emisión. Esto se resolvió usando la descripción del codificador (obj.description), que abría una posibilidad de monitorizar cambios en el texto mediante un hilo en segundo plano (más sobre este procedimiento debajo), lo que también eliminó la necesidad de permanecer en la ventana de codificadores hasta estar conectado.

source: While I was resolving problems with SAM encoders, I also worked on refactoring encoder support code to support StationPlaylist encoders (add-on 4.0). Initially, encoder support code was optimized for SAM encoders, but the current code structure (explained below) was written to extend basic encoder support easily, and as a result, both SAM and SPL encoder entries (and other encoder types) present similar interfaces and commands, including a common encoder configuration dialog (add-on 7.0).
es: Mientras estaba resolviendo problemas con los codificadores SAM, trabajé también en refactorizar el código de soporte del codificador para dar compatibilidad con los codificadores de StationPlaylist (complemento 4.0). Inicialmente, el código de soporte para el codificador se optimizó para los codificadores SAM, pero la estructura actual del código (explicada debajo) se escribió para extender fácilmente el soporte básico de codificadores, y como resultado, las entradas del codificador de SAM y SPL (y otros codificadores) presentan interfaces y órdenes similares, incluyendo un diálogo común de configuración del codificador (complemento 7.0).

source: Few years later, encoder support became a hot topic when I was asked by a broadcaster to add support for Edcast in 2019. Edcast, while free, was end of life, and Altacast took its place. Thankfully, adding support for AltaCast encoder (Winamp plugin which must be recognized by Studio and Streamer) was a breeze because its user interface is similar to SPL encoders. Thus, AltaCast encoder support is similar to SPL encoders, thus for purposes of this section, AltaCast is synonymous with SPL encoder.
es: Pocos años después, el tema del soporte para codificadores se puso sobre la mesa cuando un locutor me pidió que añadiera soporte para Edcast en 2019. Edcast, aunque era gratis, llegaba al final de su vida, y AltaCast ocupó su lugar. Por suerte, añadir soporte para el codificador AltaCast (plugin de Winamp que debe ser reconocido por Studio y Streamer) fue sencillo, ya que su interfaz de usuario es similar a la de los codificadores de SPL. Por lo tanto, el soporte del codificador AltaCast es similar al de los codificadores de SPL, así que para los propósitos de esta sección, AltaCast es un sinónimo del codificador SPL.

source: At the same time, encoder support was reorganized. In 2014, with limited knowledge on encoder engines, I felt it was best to house encoder support module inside SPL Utilities. In the course of time, two encoder engines were found: SPL Engine (splengine) and Streamer (splstreamer). After learning that encoder engines were housed inside these apps, it was decided in 2020 to separate encoder support module into its own app module, transfering encoder support from the global plugin to SPL Engine app module package with Streamer deriving most of its power from the former.
es: Al mismo tiempo, se reorganizó el soporte del codificador. En 2014, con conocimientos limitados en motores de codificación, sentí que era mejor alojar el módulo de soporte del codificador dentro de las utilidades de SPL. Con el paso del tiempo, se encontraron dos motores de codificación: el motor SPL (splengine) y Streamer (splstreamer). Tras aprender que los motores de codificación estaban alojados dentro de estas aplicaciones, decidí en 2020 separar el módulo de soporte del codificador en su propio módulo de aplicación, transfiriendo el soporte del codificador de la extensión global al paquete del módulo de aplicación del motor SPL y derivando la mayoría de funciones de Streamer del paquete del motor de SPL.

source: ### Encoder support structure
es: ### Estructura del soporte del codificador

source: Encoder support is part of two app modules: SPL Engine and StationPlaylist Streamer, the former being an app module package similar to SPL Studio package. The complete picture is thus:
es: El soporte del codificador es parte de dos módulos de aplicación: SPL Engine y StationPlaylist Streamer, siendo el primero un módulo de aplicación similar al paquete SPL Studio. Por tanto, el cuadro al completo queda así:

source: * SPL Engine app module (splengine/__init__.py), providing base app module services for use by both SPL Engine and Streamer such as encoder detection.
es: * Módulo de aplicación del motor de SPL (splengine/__init__.py), que proporciona servicios básicos de módulo de aplicación usados tanto por el motor SPL como por Streamer, como por ejemplo la detección de codificadores.

source: * Encoder support (splengine/encoders.py), outlining NVDA's support for various encoders and is the focus of this section.
es: * Soporte del codificador (splengine/encoders.py), describiendo el soporte de NVDA para diversos codificadores y que constituye el tema principal de esta sección.

source: * Streamer app module (splstreamer.py), which simply imports everything from SPL Engine app module package and adds overlay class management for Streamer user interface.
es: * Módulo de aplicación de Streamer (splstreamer.py), que simplemente importa todo del paquete del módulo de aplicación del motor de SPL y añade gestión de envoltura de clases para la interfaz de usuario de Streamer.

source: ### Encoder entries: Yet another overlay class family
es: ### Entradas del codificador: otra familia más de clases de superposición

source: Just like Studio track items (see the section on track items), encoder entries are overlay classes. Each encoder type (SAM, SPL, AltaCast and future encoders) inherit from a single encoder object (splengine.encoders.Encoder) that provides basic services such as settings commands, announcing encoder labels and so on. Then each encoder type adds encoder-specific routines such as different connection detection routines, ways of obtaining encoder labels and so on. Speaking of encoder labels and settings, the base encoder class is helped by some friends from the encoder module itself, including a configuration map to store encoder labels and basic settings, a routine to obtain encoder ID (encoder string and the IAccessible child ID) and so on.
es: Al igual que los elementos de pista de Studio (mira la sección de elementos de pista), las entradas del codificador son clases de superposición. Cada tipo de codificador (SAM, SPL, AltaCast y los codificadores futuros) hereda de un único objeto codificador (splengine.encoders.Encoder), que proporciona servicios básicos como órdenes de ajustes, verbalización de etiquetas del codificador y demás. Cada tipo de codificador agrega procedimientos específicos del codificador como diferentes funciones de detección de conexión, formas de obtener etiquetas del codificador y demás. Hablando de etiquetas del codificador y ajustes, la clase base del codificador recibe ayuda de algunos amigos del módulo del codificador en sí, incluido un mapa de configuración para almacenar etiquetas de flujo y ajustes básicos, una función para obtener el identificador del codificador (cadena del codificador e identificador del hijo de IAccessible) y demás.

source: On top of the base encoder class are three encoder classes, representing entries from SAM, SPL, and AltaCast. SAM encoder entries (splengine.encoders.SAMEncoder) are laid out just like Studio's track items with parts deriving from SysListView32 objects, whereas SPL encoder list (splengine.encoders.SPLEncoder) is a typical SysListView32 control (see the section on column routines for more information). Being similar in appearance to SPL encoder, AltaCast encoder (splengine.encoders.AltaCastEncoder) derives from SPL encoder class with encoder specific differences. All encoder classes provide similar routines, with differences being how connection messages are handled and obtaining encoder specific data such as encoder type identifier used for looking up encoder settings with help from encoder ID's.
es: Construidas sobre la clase base del codificador hay tres clases de codificadores, representando las entradas de SAM, SPL y AltaCast. Las entradas del codificador SAM (splengine.encoders.SAMEncoder) se presentan como los elementos de pista de Studio con partes que derivan de objetos SysListView32, mientras que las entradas del codificador SPL (splengine.encoders.SPLEncoder) es un control SysListView32 típico (mira el artículo sobre procedimientos de columna para más información). Siendo similar en apariencia al codificador SPL, las entradas del codificador AltaCast (splengine.encoders.AltaCastEncoder) derivan de la clase del codificador SPL con diferencias específicas del codificador. Todas las clases proporcionan procedimientos similares, diferenciándose en cómo se capturan los mensajes de conexión y cómo se obtienen datos específicos del codificador, como el identificador de tipo de codificador usado para acceder a las opciones del codificador con la ayuda de sus identificadores.

source: ### Encoder ID's
es: ### Identificadores de codificador

source: An encoder ID is a string which uniquely identifies an encoder. This consists of a string denoting the encoder type (SAM for SAM encoder, for instance), followed by the encoder position (separated by a space). For instance, the first SAM encoder is given the ID "SAM 1". The ID's are used to retrieve and configure encoder settings, as well as identifying encoders when monitoring them in the background.
es: Un identificador de codificador es una cadena que identifica unívocamente un codificador. Consta de una cadena que indica el tipo de codificador (SAM para el codificador SAM, por ejemplo), seguida de la posición del codificador (separada por un espacio). Por ejemplo, el primer codificador SAM tiene el identificador "SAM 1". Los identificadores se usan para recuperar y configurar ajustes e identificar codificadores monitorizados en segundo plano.

source: ### Common services: basic settings, encoder labels and related methods
es: ### Servicios comunes: ajustes básicos, etiquetas del codificador y métodos relacionados

source: All encoder classes provide the following common services:
es: Todas las clases de codificadores proporcionan los siguientes servicios comunes:

source: * Configuring settings: six settings can be configured:
es: * Configuración de ajustes: se pueden configurar seis ajustes:

source: * A custom encoder label can be defined for ease of identification.
es: * Se puede definir una etiqueta personalizada del codificador para facilitar su identificación.

source: * Pressing F11 will tell NVDA if NVDA should switch to Studio when the encoder is connected.
es: * Al pulsar f11 indicaremos a NVDA si este debería pasar a Studio cuando el codificador esté conectado.

source: *Pressing Shift+F11 will tell NVDA if NVDA should ask Studio to play the next track when connected.
es: * Al pulsar shift+f11 se dirá a NVDA que pida a Studio que reproduzca la siguiente pista al conectarse.

source: * Pressing Control+F11 will enable background encoder monitoring (more on this in a second).
es: * Al pulsar ctrl+f11 se activará la monitorización del codificador en segundo plano (más sobre esto en un segundo).

source: * Enabling or disabling connection progress tones (add-on 7.0, configurable from encoder settings dialog described below).
es: * Activar o desactivar la reproducción de tonos que indiquen el progreso de la conexión (complemento 7.0, configurable desde el diálogo de ajustes del codificador que se describe más abajo).

source: * Announcing connection status until the selected encoder is connected (add-on 20.03), also configurable from encoder settings dialog.
es: * Anunciar el estado de conexión hasta que el codificador seleccionado se conecte (complemento 20.03), configurable también desde el diálogo de opciones del codificador.

source: * Once these settings are changed, the new values will be stored in appropriate flag in the encoder entry, which in turn are saved in the configuration map.
es: * Una vez se cambien estos ajustes, los nuevos valores se almacenarán en el indicador apropiado de la entrada del codificador, que eventualmente se guarda en el mapa de configuración.

source: * Apart from encoder labels, retrieves settings. This is done by various property methods - once called, these methods will look up various settings for the encoder from the configuration map (key is the setting flag, value is the encoder ID). Encoder labels are organized differently (see below).
es: * Además de las etiquetas del codificador, recupera ajustes. Esto se hace con diversos métodos de propiedad - una vez llamados, estos métodos recuperarán diversos ajustes para el codificador desde el mapa de configuración (la clave es el indicador del ajuste, y el valor es el identificador del codificador). Las etiquetas del codificador se organizan de forma diferente (mira más abajo).

source: * Monitors and responds to connection status changes. The response routine (onConnection method) attempts to set focus to Studio and/or play the first checked track if configured to do so.
es: * Monitorización y reacción ante cambios de estado de la conexión. El procedimiento de respuesta (método onConnection) intenta llevar el foco a Studio y / o reproducir la primera pista marcada si está configurado para hacerlo.

source: * Loads encoder labels when an encoder first gains focus (if this was loaded earlier, it could be a waste of space, especially if encoders are never used).
es: * Carga las etiquetas del codificador cuando un codificador obtiene el foco por primera vez (si se habían cargado antes, podría suponer un gasto de espacio, especialmente si nunca se usan los codificadores).

source: * Announces encoder labels (if defined) via a dedicated name getter. Labels are stored as dictionary keys corresponding to encoder ID's under a dedicated encoder labels section inside the configuration map.
es: * Anuncia las etiquetas del codificador (si se han definido) mediante un método getter dedicado para el nombre. Las etiquetas se almacenan como claves de un diccionario y se corresponden con identificadores de codificadores bajo una sección dedicada a las etiquetas de los codificadores dentro del mapa de configuración.

source: * Define and remove encoder labels. If a label is defined (no empty string), encoder label is stored in an encoder labels collection, otherwise removed from the collection.
es: * Define y elimina etiquetas del codificador. Si una etiqueta está definida (cadena no vacía), la etiqueta del codificador se almacena en una colección de etiquetas del codificador, y en cualquier otro caso se elimina de la colección.
