Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/spladdoninternals.po
Languages: es

source: Column content retrieval routine has become one of the cornerstones of this add-on. In addition to Track Dial, ten other routines rely on it: Column Search, track place marker, column announcement order, Track Columns Explorer, vertical column navigation, playlist snapshots, playlist transcripts, Creator and Track Tool app modules, playlist editor found in Creator and Remote VT client, and when working with SAM encoder entries. Let's find out how seven of these work in more detail (playlist snapshots and transcripts are described under SPL Assistant section, as they deserve sections of their own).
es: El procedimiento de recuperación del contenido de las columnas ha llegado a ser una de las piedras angulares de este complemento. Además del dial de pista, otros diez procedimientos lo usan: búsqueda por columnas, marcador de posición de pista, verbalización del orden de columnas, explorador de columnas de pista, navegación vertical por columnas, instantáneas de listas de reproducción, transcripción de listas de reproducción, los módulos de aplicación de la herramienta de pista y de Creator, el editor de listas de reproducción que se encuentra en Creator y en el cliente Remote VT, y las entradas del codificador SAM. Veamos cómo funcionan siete de ellos con más detalle (las instantáneas de lista de reproducción y la transcripción de listas se describen en la sección del asistente de SPL, aunque se merecen secciones propias).

source: #### Track Dial: Navigating columns in track items
es: #### Dial de pista: navegación por columnas en elementos de pista

source: Note: no longer applicable since 17.04, included here for completeness.
es: Nota: ya no es aplicable desde la versión 17.04, se incluye aquí por completitud.

source: The column retriever routine is just one of the activities performed during Track Dial, and to see the beauty of this feature, assign a command to toggle Track Dial (you need to focus on the track item before opening Input Gestures dialog, as Track Dial is used by track items alone). Once you assign a command to toggle Track Dial and toggle this on, Studio will set a flag indicating that Track Dial is on, which causes left and right arrow keys to be assigned to column navigation commands (this flag is stored as part of the add-on configuration database). If you tell NVDA to play beeps for status announcements (see previous chapter), NVDA will play a high beep. Once you are done with Track Dial, press the just assigned command to turn off Track Dial, at which point left and right arrow keys return to their original functions, a low beep will be heard (if told to do so) and Track Dial flag will be cleared.
es: El procedimiento de recuperación de columna es una de las actividades realizadas durante el dial de pista, y para ver la belleza de esta característica, asigna una orden para conmutar el dial de pista (debes poner el foco en el elemento de pista antes de abrir el diálogo de gestos de entrada, ya que el dial de pista sólo es usado por los elementos de pista). Una vez asignes la orden para conmutar el dial de pista y lo actives, Studio establecerá un indicador indicando que el dial de pista está activo, lo que causa que las flechas izquierda y derecha se asignen a órdenes de navegación de columna (este indicador se almacena como parte de la base de datos de configuración del complemento). Si configuras NVDA para que reproduzca pitidos para anunciar los cambios de estado (mira el capítulo anterior), NVDA reproducirá un pitido agudo. Una vez acabes con el dial de pista, pulsa la orden asignada para apagarlo. En este punto las flechas izquierda y derecha volverán a ejercer sus funciones originales, se oirá un pitido grave (si se configura NVDA para ello) y se eliminará el indicador del dial de pista.

source: When navigating columns, NVDA will check if you are at the edge of the track row, and if so, it will play a beep and repeat the last column text. If not, NVDA will look at the column you wish to navigate to (stored in the app module), then it'll call the column text retriever to retrieve the column text.
es: Al navegar por columnas, NVDA comprobará si te encuentras en el borde de la fila de la pista, y si es así, reproducirá un pitido y repetirá el texto de la última columna. Si no, NVDA mirará la columna a la que quieres navegar (almacenada en el módulo de aplicación), después llamará al recuperador de texto de columna para recuperar el texto de esa columna.

source: To handle differences between Studio 5.0x and 5.1x, each track item class informs NVDA as to how leftmost column should be handled. For Studio 5.0x, leftmost column is artist field (obj.name will be checked), while track checked status is "shown" in Studio 5.10 (obj.name will be announced).
es: Para procesar las diferencias entre Studio 5.0x y 5.1x, cada clase de elemento de pista informa a NVDA cómo debería procesarse la columna que hay a la izquierda del todo. En Studio 5.0x, la columna más a la izquierda es el campo artista (se comprobará obj.name), mientras que el estado de verificación de la pista es el que se "muestra" en Studio 5.10 (se verbalizará obj.name).

source: #### Custom column announcement order: What to announce and how
es: #### Orden personalizado de verbalización de columnas: qué anunciar y cómo

source: Track Dial routine also allowed another top request to come to life: column announcement order. This allows you (broadcaster) to hear columns in specific order and to exclude certain columns from being announced.
es: El procedimiento del dial de pista también permitió dar vida a otra solicitud: orden de verbalización de columnas. Esto te permite (locutor) oír las columnas en un orden específico y excluir ciertas columnas para que no sean verbalizadas.

source: Until 2020, custom column announcement order handler resided in reportFocus method in the main track item class. In late 2020, this was split into a custom track name getter, as track name announcement was revised to use SysListView32 routines directly (prior to this, track item class relied on default IAccessible implementation).
es: Hasta 2020, el manejador del orden personalizado del anuncio de columnas residía en el método reportFocus de la clase principal del elemento de pista. A finales de 2020, se dividió en un método getter personalizado del nombre de pista, ya que se revisó el anuncio de pista para usar directamente los procedimientos de SysListView32 (antes de esto, la clase del elemento de pista se apoyaba en la implementación predeterminada de IAccessible).

source: In order to use this, you must tell NVDA to not use screen order (add-on settings dialog's column announcement panel, or in 21.01 and later, press NVDA+V while focused on playlist viewer item to toggle this). Then from the same settings panel (column announcement), check the columns you wish to hear and/or use the columns list to set column announcement order. The column announcement order is a list box with two buttons: move up and down.
es: Para usarlo, hay que indicar a NVDA que no utilice el orden en pantalla (diálogo de ajustes del complemento, panel de anuncio de columnas, o simplemente NVDA+v teniendo el foco en un elemento del visualizador de lista de reproducción para conmutarlo en la versión 21.01 o posterior). A continuación, en el mismo panel de opciones (anuncio de columnas), marca las columnas que quieras oír y usa la lista de columnas para configurar el orden de verbalización. El orden de verbalización de columnas es un cuadro de lista con dos botones: mover arriba y abajo.

source: Once column order and included columns are defined, NVDA will use this information to build track property text. Prior to 2021, this was track description, later shifting to building track name text. This is done by repeatedly calling the column retriever routine for columns you wish to hear, then using the column order you defined to build parts of the property text (a combination of a list and str.join is used).
es: Una vez se definen las columnas incluidas y el orden de las mismas, NVDA usará esta información para construir el texto de descripción del elemento de pista. Antes de 2021, esta era la descripción de la pista, cambiando después a la construcción del texto de nombre de la pista. Esto se hace llamando repetidamente al procedimiento recuperador de columna en las columnas que quieres oír, y usando después el orden de columnas que definiste para construir partes del texto de la descripción (se usa una combinación de lista y str.join).

source: For example, if NVDA is told to announce title and artist (in that specific order), NVDA will first locate title, then will add artist information. This is then presented as, "Title: some title, Artist: some artist".
es: Por ejemplo, si hacemos que NVDA anuncie el título y el artista (en ese orden específico), NVDA primero ubicará el título, luego añadirá la información del artista. Esto después se presentará como "Título: algún título, artista: algún artista".

source: It is also possible to suppress announcement of column headers. Until 2020, add-on settings shipped with a dedicated checkbox to toggle header announcement. From 2021 onwards, NVDA's table row/column header setting is used to set column header announcement for Studio track columns.
es: También es posible suprimir el anuncio de las cabeceras de columna. Hasta 2020, las opciones del complemento venían con una casilla de verificación dedicada a conmutar el anuncio de cabeceras. Desde 2021 en adelante, se usa la opción de NVDA de cabeceras de fila y columna para configurar el anuncio de cabeceras de columna en las columnas de pista de Studio.

source: ##### Track name versus description?
es: ##### ¿Nombre de pista versus descripción?

source: Until 2020, because Studio's track item class relied mostly on default IAccessible implementation, track description recorded trakc properties. For this reason, whenever custom column order or inclusion were defined, reportFocus method would construct a custom track description text based on the custom column order. This changed in add-on 20.11 when SysListView32 routines took a greater role in defining track items, and since NVDA builds custom text for item names based on column information, Studio's track item class will also construct custom item name based on custom column order and inclusion if defined. Because of this, from late 2020, column builder was split into a different method, namely a custom item name getter which is the method used by NVDA to retrieve name text for a control.
es: Hasta 2020, y ya que la clase de elemento de pista de Studio se apoyaba en la implementación predeterminada de IAccessible, la descripción de la pista registraba las propiedades de la misma. Por esta razón, siempre que se definía un orden o inclusión personalizados de columnas, el método reportFocus construía un texto de descripción de pista personalizado basado en el orden de columnas personalizado. Esto cambió en el complemento 20.11, cuando los procedimientos de SysListView32 adquirieron un rol más importante en la definición de elementos de pista, y ya que NVDA construye texto personalizado para los nombres de elementos basándose en la información de las columnas, la clase de elemento de pista de Studio también construirá nombres de elementos personalizados basándose en el orden personalizado de columnas e inclusión, si se han definido. A causa de esto, desde finales de 2020, el constructor de columnas está dividido en un método diferente, un getter personalizado del nombre del elemento que se usa para que NVDA recupere el texto del nombre de un control.

source: #### Track Columns Explorer: Retrieve information from specific columns
es: #### Explorador de columnas de pista: recuperar información de columnas específicas

source: In add-on 7.0, it became possible to let NVDA announce information from specific columns. This is done by letting NVDA assign SPL Assistant, 1 through 0 (6 for Studio 5.0x) to a function to obtain information from specific column (slot); add-on 8.0 changed these commands to use Control+NVDA+number row, and SPL Assistant, number row commands were removed in 2020. This is called Track Columns Explorer (usually termed Coloumns Explorer).
es: En el complemento 7.0, apareció la posibilidad de hacer que NVDA verbalice información de columnas específicas. Esto se hace dejando a NVDA que asigne al asistente de SPL, del 1 al 0 (6 para Studio 5.0x) una función para obtener información de una columna específica (slot); el complemento 8.0 cambia estas órdenes para usar ctrl+NVDA+fila de números, y se eliminó Asistente de SPL, órdenes de la fila numérica en 2020. Esto se llama explorador de columnas de pista (generalmente conocido como explorador de columnas).

source: In addition to using column retriever routine in Track Dial, Columns Explorer needs to know Studio version in use, as Studio 5.1x shows columns not found in Studio 5.0x (this is checked when entering SPL Assistant as discussed later). In addition, since not all track items expose more than ten columns or column slots cannot be configured for some items (notably Creator's Playlist Editor), Columns Explorer needs to know how many columns can be retrieved and take action if no column slot can be defined.
es: Además de usar el procedimiento de recuperación de columna en el dial de pista, el explorador de columnas necesita saber la versión de Studio en uso, ya que Studio 5.1x muestra columnas que no están en Studio 5.0x (esto se comprueba al entrar en el asistente de SPL, como se expondrá más tarde). Además, como no todos los elementos de pista exponen más de diez columnas o no se pueden configurar los slots de columna en algunos elementos (perceptible en el editor de listas de reproducción de Creator), el explorador de columnas necesita saber cuántas columnas se pueden recuperar y tomar medidas si no se puede definir un slot de columna.

source: Once column slots are defined (for items allowing configuring column slots, which are Studio's Playlist Viewer, Track Tool, and Creator's main tracks list, Columns Explorer performs the following:
es: Una vez se definen los slots de columna (en elementos que lo permitan, que son el visor de listas de reproducción de Studio, la herramienta de pista y la lista principal de pistas de Creator), el explorador de columnas hace lo siguiente:

source: 1. Checks if you are indeed focused on a track item, and if not, it'll say "not a track". With the removal of SPL Assistant, number row commands in 2020, this is no longer checked as track items themselves will define Columns Explorer commands.
es: 1. Comprueba si el foco se encuentra en un elemento de pista y, si no, dirá "No es una pista". Con la eliminación de las órdenes Asistente de SPL, fila numérica en 2020, esto ya no se comprueba, ya que los propios elementos de pista definirán por sí mismos órdenes del explorador de columnas.

source: 2. Consults a list of column slots and locates corresponding column index for the slot in question.
es: 2. Consulta una lista de slots de columna y ubica el índice de columna correspondiente del slot en cuestión.

source: 3. Uses column retriever routine to announce column header and content for the selected column slot.
es: 3. Usa el procedimiento de recuperación de columna para verbalizar la cabecera de la columna y el contenido de la columna del slot seleccionado.

source: ##### Optimization bonus: I've rearranged columns in studio 5.10...
es: ##### Bonus de optimización: he reordenado las columnas en Studio 5.10...

source: Due to a different control data structure in use, one can rearrange columns in Studio 5.10 and later. But how does NVDA know exactly which column is which? This is thanks to the fact that internal column position doesn't change. When you rearrange columns, you are changing the way columns are presented on screen. When column retriever function (described above) is invoked, Studio returns column content for a column index regardless of where this column is located on screen. Not only this makes Columns Explorer simpler to implement, it allows Track Dial to track (after manual intervention) column presentation changes on screen.
es: Debido a que hay una estructura de control de datos diferente en uso, se pueden reordenar columnas en Studio 5.10 y posteriores. ¿Pero cómo sabe NVDA exactamente qué columna es cuál? Lo hace gracias al hecho de que la posición interna de las columnas no cambia. Cuando reordenas columnas, estás cambiando la forma en que estas se presentan en pantalla. Cuando se invoca a la función de recuperación de columna (descrita arriba), Studio devuelve el contenido de la columna dado un índice sin importar dónde se encuentra esa columna en pantalla. Esto no sólo hace que la implementación del explorador de columnas sea más simple, sino que permite al dial de pista rastrear (después de una intervención manual) los cambios de presentación de las columnas en pantalla.

source: ##### What about items where column slots cannot be configured?
es: ##### ¿Qué pasa con los elementos donde no se pueden configurar slots de columna?

source: For items other than Studio's Playlist Viewer, Track Tool, and Creator's main tracks list, Columns Explorer slots cannot be configured (hence absence of "exploreColumns" property, notably in Creator's Playlist Editor in add-on 20.02). If so, Columns Explorer will resort to displaying data for columns shown in display order (as it appears on screen). As a bonus, if a track item does not show more than ten columns, Columns Explorer will announce an error message if current column position is out of bounds (beyond column count for the track item). These were done in order to support Playlist Editor properly as track items in there only shows eight columns.
es: Para elementos distintos al visor de listas de reproducción de Studio, la herramienta de pista y la lista principal de pistas de Creator, los slots del explorador de columnas no pueden configurarse (de ahí la ausencia de la propiedad "exploreColumns", perceptible en el editor de listas de reproducción de Creator en el complemento 20.02). Si es así, el explorador de columnas las reordenará para mostrar sus datos en el orden que se muestran (como se ven en pantalla). Como extra, si un elemento de pista no muestra más de diez columnas, el explorador de columnas anunciará un mensaje de error si la posición de la columna actual se sale de los límites (más allá de la cantidad de columnas del elemento de pista). Estos se hicieron para dar soporte al editor de listas de reproducción adecuadamente, ya que sus elementos de pista sólo muestran ocho columnas.

source: #### Column Search: Finding text in specific columns
es: #### Búsqueda por columnas: encontrar texto en columnas específicas

source: In the previous section, I mentioned that a single dialog performs double duty when talking about Track Finder. We'll now tour the other side of the coin: Column Search.
es: En la sección anterior, mencioné que un único diálogo hace una doble función cuando hablamos del buscador de pistas. Ahora recorreremos el otro lado de la moneda: la búsqueda por columnas.

source: Column Search dialog adds a second control to Track Finder: a list of columns. Once text is entered to be searched in a column, NVDA will use trackFinder routine (discussed earlier) to locate text in specific columns (I mentioned that trackFinder routine takes column(s) as the argument, and this is where this argument comes in handy). In fact, both regular Track Finder and Column Search uses the above column retriever routine to locate column text (the private linear search function introduced in Track Finder 2.0 locates text from specified columns, and for regular track finder, artist and title columns are examined). Just like the regular Track Finder, once search is done, it'll either move you to a track item or present an error dialog.
es: El diálogo de búsqueda por columnas añade un segundo control al buscador de pistas: una lista de columnas. Una vez se introduce el texto a buscar en una columna, NVDA usará el procedimiento trackFinder (expuesto antes) para ubicar texto en columnas específicas (he mencionado que el procedimiento trackFinder recibe la(s) columnas(s) como un argumento, y aquí es donde el argumento resulta útil). De hecho, tanto el buscador de pistas normal como la búsqueda por columnas usan el procedimiento de recuperación de columnas de arriba para ubicar el texto de la columna (la función privada de búsqueda lineal introducida en el buscador de pistas 2.0 localiza texto de columnas específicas, y en el buscador de pistas normal, se examinan las columnas artista y título). Al igual que con el buscador de pistas normal, una vez se ha hecho la búsqueda, se moverá el foco a un elemento de pista o bien se presentará un diálogo de error.

source: So what causes one dialog to present both Track Finder and Column Search dialog? It's all thanks to the arguments passed into the find dialog constructor. The signature is:
es: Entonces, ¿qué causa que un diálogo presente tanto el buscador de pistas como el buscador por columnas? Esto se hace gracias a los argumentos pasados al constructor del diálogo de búsqueda. La cabecera es:

source: The last argument (columnSearch) determines which version of the dialog to present. The object (obj) is needed to tell NVDA where to begin the search and to call the track finder routine defined in the object's app module.
es: El último argumento (columnSearch) determina la versión del diálogo que se debe presentar. El objeto (obj) es necesario para decirle a NVDA dónde empezar la búsqueda y para llamar al procedimiento del buscador de pistas definido en su módulo de aplicación.

source: #### Track Place Marker: A variation of column search for finding filenames
es: #### Marcador de pista: una variante de la búsqueda por columnas para encontrar nombres de archivo

source: Another feature that uses column routines is track place marker. You would drop a place marker at the current track (SPL Assistant, Control+K), move around the playlist, then move to the track with the marker set on it (SPL Assistant, K).
es: Otra característica que usa los procedimientos de columna es el marcador de pista. Tú pondrías un marcador en la pista actual (asistente de SPL, ctrl+k), te moverías por la lista de reproducción, y después te moverías a la pista que tiene el marcador (asistente de SPL, k).

source: Once you drop a place marker, Studio app module will record the filename of the currently focused track, and when you wish to move to the marked track, NVDA will use column search routine to locate it. Unlike a typical column search, NVDA will call the private linear search routine directly and will select the column where filename is stored (in effect, you are asking NVDA to do a column search after choosing filename as the data you are looking for).
es: Una vez sitúes un marcador, el módulo de aplicación de Studio registrará el nombre del archivo de la pista que tenga actualmente el foco, y cuando quieras moverte a la pista marcada, NVDA usará el procedimiento de búsqueda en columnas para encontrarla. Al contrario que pasa con las búsquedas por columna típicas, NVDA llamará a la función privada de búsqueda lineal directamente y seleccionará la columna donde se encuentre el nombre del archivo (en efecto, le estás diciendo a NVDA que haga una búsqueda por columnas después de elegir nombre de archivo como dato a buscar).

source: #### Vertical column navigation: just announce the column I want
es: #### Navegación vertical por columnas: verbalizar sólo la columna que quiero
