Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/spladdoninternals.po
Languages: es

source: 3. Adds gestures for the layer set to the main gestures map via bindGestures function. In case of screen reader emulation in SPL Assistant, the appropriate gestures map is selected.
es: 3. Se añaden los gestos del conjunto de la capa al mapa principal de gestos a través de la función bindGestures. En el caso de la emulación de lector de pantalla en el asistente de SPL, se selecciona el mapa apropiado de gestos.

source: 3. You press a command in the layer set (such as A from Assistant to hear automation status, or press A to turn automation on if using SPL Controller layer). Depending on how the layer script is implemented, it either calls Studio API (for SPL Controller layer and for some Assistant commands) or simulates object navigation to fetch needed information (Assistant layer). In the app module, for performance reasons, the object is cached. More details on mechanics of this procedure in subsequent sections.
es: 3. Pulsas una orden en el conjunto de la capa (como la A de asistente para oír el estado de la automatización, o la A para activar la automatización si se usa la capa del controlador de SPL). Dependiendo de cómo esté implementado el script de capa, llama a la api de Studio (para la capa de controlador de SPL y algunas órdenes del asistente) o bien simula navegación de objetos para recuperar la información necesaria (capa del asistente). En el módulo de aplicación, por razones de rendimiento, el objeto se mete en caché. Hay más detalles de los mecanismos de este procedimiento en las siguientes secciones.

source: 4. After the layer command is done, it calls "finish" function (app module/global plugin) to perform clean up actions such as:
es: 4. Después de que se haya hecho la orden de capa, se llama a la función "finish" (módulo de aplicación / extensión global) para realizar acciones de limpieza tales como:

source: * Clears layer flags.
es: * Limpiar los indicadores de capa.

source: * Removes the "current" gestures (main gestures and layer commands) and reassigns it to the main gestures map (this is dynamic binding removal).
es: * eliminar los gestos "actuales" (gestos principales y gestos de capa) y reasignarlos al mapa principal de gestos (esto se llama eliminación dinámica de asociaciones).

source: * Performs additional actions depending on context (for example, if Cart Explorer was in use).
es: * Realizar acciones adicionales dependiendo del contexto (por ejemplo, si el explorador cart estaba en uso).

source: ### The importance of Studio window handle and Studio API
es: ### La importancia del manejador de ventana de Studio y la api de Studio

source: In order to use services offered by Studio, one has to use Studio API, which in turn requires one to keep an eye on window handle to Studio (in Windows API, a window handle (just called handle) is a reference to something, such as a window, a file, connection routines and so on). This is important if one wishes to perform Studio commands from other programs (Studio uses messages to communicate with the outside program in question via user32.dll's SendMessage function).
es: Para usar los servicios que ofrece Studio, se debe utilizar la api de Studio, que básicamente necesita que tengamos vigilado el manejador de ventana de Studio (en la api de Windows, un manejador de ventana (simplemente llamado manejador) es una referencia a algo, como a una ventana, un archivo, procedimientos de conexión y así sucesivamente). Es importante si se desean ejecutar órdenes de Studio desde otros programas (Studio usa mensajes para comunicarse con el programa externo en cuestión mediante la función SendMessage de user32.dll).

source: Starting from add-on 7.0, one of the activities the app module performs at startup (besides announcing the version of Studio you are using) is to look for the handle to Studio's main window until it is found (this is done via a thread which calls user32.dll's FindWindowW (FindWindowA until late 2018 as explained below) function every second), and once found, the app module caches this information for later use. A similar check is performed by SPL Controller command, as without this, SPL Controller is useless (as noted earlier). Because of the prominence of the Studio API and the window handle, one of the first things I do whenver new versions of Studio is released is to ask for the latest Studio API and modify the app module and/or global plugin accordingly.
es: Desde el complemento 7.0, una de las actividades que realiza el módulo de aplicación cuando se inicia (además de verbalizar la versión de Studio que estás usando) es buscar el manejador de la ventana principal de Studio hasta que lo encuentra (esto se hace mediante un hilo que llama a la función FindWindowW (FindWindowA hasta finales de 2018 como se explica debajo) de user32.dll cada segundo), y una vez que lo encuentra, el módulo de aplicación guarda esta información para uso futuro. El controlador SPL realiza una comprobación similar, ya que sin el manejador, el controlador de SPL es inútil (como se ha explicado antes). Debido a la importancia de la api de Studio y el manejador de ventana, una de las primeras cosas que hago cada vez que se publica una nueva versión de Studio es pedir la última api de Studio y modificar el módulo de aplicación y / o la extensión global apropiadamente.

source: #### FindWindowA versus FindWindowW
es: #### FindWindowA frente a FindWindowW

source: In the old days of Windows (1990's), programs were not ready to support Unicode when Windows itself did. To support programs that are not Unicode-aware, Microsoft defined two versions of a given Windows API function. For example, there were two versions of FindWindow function, the difference being the final character as follows:
es: En los viejos tiempos de Windows (años 90), los programas no estaban listos para dar soporte a Unicode cuando el propio Windows lo hizo. Para dar soporte a programas que no están preparados para Unicode, Microsoft definió dos versiones de una función dada de la API de Windows. Por ejemplo, había dos versiones de la función FindWindow, siendo la diferencia su carácter final, como se explica a continuación:

source: * A: ANSI version meant for legacy programs (e.g. FindWindowA).
es: * A: versión ANSI hecha para programas antiguos (por ejemplo, FindWindowA).

source: * W: Wide char (Unicode) character version (e.g. FindWindowW).
es: * W: versión para caracteres Wide (Unicode) (por ejemplo, FindWindowW).

source: In reality, programs call FindWindow function, and the appropriate "version" was chosen based on overall character representation macro as specified by the program. For example, if the program was unicode-aware, when FindWindow is called, Windows internally calls FindWindowW.
es: En realidad, los programas llaman a la función FindWindow, y se elige la "versión" apropiada basada en la macro de representación de caracteres general como la especifica el programa. Por ejemplo, si el programa estuviese preparado para Unicode, al llamar a FindWindow, Windows llamaría internamente a FindWindowW.

source: Until 2018, Studio app module and other components of the add-on called FindWindowA due to the fact that, in Python 2, a string is a read-only array of ANSI characters. Python 3 (and if a string is prefixed with "u" in Python 2) uses immutable array of Unicode characters for strings. Internally, NVDA expects Unicode strings for the function that wraps FindWindow function (located in winUser module), thus mimicking Python 3 behavior. StationPlaylist add-on adopted FindWindowW behavior in late 2018, but the wrapper provided by NVDA is not used due to incorrect error checking behavior in NVDA (if window handle is 0 (NULL), success error is raised, which goes against specifications from Windows API; no longer the case in NVDA 2019.3/Python 3).
es: Hasta el 2018, el módulo de aplicación de Studio y otros componentes del complemento llamaban a FindWindowA debido al hecho de que, en Python 2, una cadena es un array de sólo lectura de caracteres ANSI. Python 3 (y si se crea una cadena en Python 2 prefijada con la "u") usa un array inmutable de caracteres Unicode para las cadenas. Internamente, NVDA espera cadenas Unicode para la función que envuelve a FindWindow (ubicada en el módulo winUser), imitando por tanto al comportamiento en Python 3. El complemento de StationPlaylist adoptó el comportamiento de FindWindowW a finales de 2018, pero no se usa la envoltura proporcionada por NVDA debido al comportamiento incorrecto al comprobar errores en NVDA (si el manejador de ventana es 0 (NULL), se lanza un código de error que indica éxito, que va en contra de las especificaciones de la API de Windows; ya no se da el caso en NVDA 2019.3 / Python 3).

source: ## Life of the SPL app module
es: ## Vida del módulo de aplicación de SPL

source: Note: For the rest of this article, you'll see some portions of the source code to let you better understand how something works (mostly pseudo code will be provided). Also, certain things will require explaining how NVDA Core (the screen reader itself) works (so you'll learn several things at once).
es: Nota: durante el resto de este artículo, verás algunas porciones del código fuente para hacerte entender mejor cómo funciona algo (mayoritariamente se proporcionará pseudocódigo). Además, para algunas cosas será necesario explicar cómo funciona el núcleo de NVDA (el lector de pantalla en sí) (por lo que aprenderás muchas cosas de una vez).

source: ### SPL Studio app module and friends: design and code overview
es: ### Módulo de aplicación de SPL Studio y amigos: descripción del diseño y del código

source: As noted previously, the SPL Studio app module (splstudio/__init__.py) and friends (other app modules) consists of several sections. These include (from top to bottom):
es: Como se ha indicado antes, el módulo de aplicación de SPL Studio (splstudio/__init__.py) consta de varias secciones. Estas incluyen (de arriba a abajo):

source: * Imports: Many modules from Python packages and from NVDA screen reader are imported here, including IAccessible controls support, configuration manager and so on.
es: * Importaciones: aquí se importan muchos módulos de diversos paquetes Python y del lector de pantalla NVDA, incluyendo soporte para controles de IAccessible, gestor de configuración y así sucesivamente.

source: * Layer command wrapper: I talked about how layer commands work in a previous section, and the "finally" function at the top is the one that makes this possible.
es: * Envoltura de orden de capa: ya dije en un capítulo anterior cómo funcionaban las órdenes de capa, y la función "finally" al principio es la que hace esto posible.

source: * Few helper functions and checks: This includes a flag specifying minimum version of Studio needed, the cached value for Studio window handle (SPLWin) and place holders for threads such as microphone alarm timer (more on this in threads section). This section also includes helper functions such as "messageSound" (displays a message on a braille display and plays a wave file) and other helper functions.
es: * Unas pocas comprobaciones y funciones auxiliares: aquí se incluye un indicador que especifica la mínima versión de Studio requerida, el valor almacenado para el manejador de ventana de Studio (SPLWin), y referencias para hilos como el temporizador de alarma del micrófono (más sobre esto en la sección de hilos). Esta sección también incluye funciones auxiliares como "messageSound" (muestra un mensaje en una pantalla Braille y reproduce un archivo wav) y otras funciones auxiliares.

source: * Track item overlay classes: three classes are defined for various purposes. The first is a base class that provides commands and services across Studio and other apps, while other two classes provide support for tracks found throughout Studio (one is a general track items class, the other is specific to playlist viewer). We'll come back to these objects later.
es: * Clases de superposición del elemento de pista: se definen tres clases con diversos propósitos. La primera es una clase base que proporciona órdenes y servicios a través de Studio y otras aplicaciones, mientras que las otras dos clases proporcionan soporte para las pistas que se encuentran a lo largo de Studio (una es una clase general de elementos de pista, la otra es específica del visor de listas de reproducción). Volveremos a estos objetos más tarde.

source: * App module class: This is the core of not only the app module, but the entire add-on package. The app module class (appModules.splstudio.AppModule) is further divided into sections as described in add-on design chapter.
es: * Clase del módulo de aplicación: este es el núcleo no sólo del módulo de aplicación, sino del paquete del complemento entero. La clase del módulo de aplicación (appModules.splstudio.AppModule) está a su vez dividida en secciones como se describe en el capítulo de diseño del complemento.

source: For Studio's colleagues (Creator, Track Tool, Remote VT client), they consist of sections listed above except layer command wrapper, and track item classes are simplified. For VT Recorder, because it controls certain internal behaviors of Studio app module when it starts, only the constructor and terminate methods (see below) are provided. For Streamer and DSP Engine, encoder specific workarounds are present.
es: Los compañeros de Studio (Creator, herramienta de pista, cliente Remote VT) se explican en las secciones listadas arriba excepto la capa de envoltura de órdenes, y se han simplificado las clases de elemento de pista. Ya que la grabadora de pistas de voz controla ciertos aspectos internos del módulo de aplicación de Studio al arrancar, sólo se proporcionan el constructor y el método terminate (mira más abajo). Para Streamer y el motor DSP, se encuentran presentes soluciones específicas del codificador.

source: Let's now tour the lifecycle of the app module object in question: before and during app module initialization, activities performed while the app module is active, death and (until 2018) add-on updates.
es: Recorramos ahora el ciclo de vida del objeto del módulo de aplicación en cuestión: antes y durante la inicialización del módulo de aplicación, actividades realizadas mientras el módulo de aplicación está activo, muerte y (hasta 2018) actualizaciones del complemento.

source: Note: although standalone add-on update feature is gone, the mechanism behind add-on update feature will be documented for sake of completeness.
es: Nota: aunque la función independiente de búsqueda de actualizaciones se ha ido, el mecanismo detrás de la actualización de complementos se documentará para dar completitud.

source: ### Before birth: NVDA's app module import routines
es: ### Antes de nacer: procedimientos de importación del módulo de aplicación de NVDA

source: Before we go any further, it is important for you to understand how NVDA loads various app modules. This routine, available from source/appModuleHandler.py (NVDA Core), can be summarized as follows:
es: Antes de que profundicemos más, es importante que entiendas cómo carga NVDA distintos módulos de aplicación. Este procedimiento, disponible en source/appModuleHandler.py (núcleo de NVDA) puede resumirse de la siguiente manera:

source: 1. If a new process (program) runs, NVDA will try to obtain the process ID (PID) for the newly loaded process.
es: 1. Si se ejecuta un nuevo proceso (programa), NVDA intentará obtener el identificador de proceso (PID) para el proceso recién cargado.

source: 2. Next, NVDA will look for an app module matching the name of the executable for the newly created process. It looks in various places, including source/appModules, userConfigDirectory/appModules and addonname/appModules, then resorting to the default app module if no app module with the given name is found.
es: 2. A continuación, NVDA buscará un módulo de aplicación que encaje con el nombre del ejecutable del proceso recién creado. Mira en varios lugares, entre ellos source/appModules, directorio de configuración de usuario/appModules y complemento/appModules, luego vuelve al módulo de aplicación por defecto si no encuentra ningún módulo de aplicación con el nombre especificado.

source: 3. Next, NVDA will attempt to use Python's built-in __import__ function to load the app module, raising errors if necessary. No errors means the app module is ready for use.
es: 3. Después, NVDA intentará usar la función __import__ integrada en Python para cargar el módulo de aplicación, lanzando errores si es necesario. Si no hay errores significa que el módulo de aplicación está listo para usarse.

source: 4. Once the newly loaded module is ready, NVDA will instantiate appModule.AppModule class (make it available). If a constructor (__init__ method) is defined, Python (not NVDA) will call the app module constructor (more on this below).
es: 4. Una vez esté listo el módulo recién cargado, NVDA instanciará la clase appModule.AppModule (la pondrá disponible). Si se define un constructor (método __init__), Python (y no NVDA) llamará al constructor del módulo de aplicación (más sobre esto debajo).

source: In case the app module's AppModule class has a constructor defined, Python will follow directions specified in the constructor. Just prior to performing app module specific constructor routines, it is important to call the constructor for the default app module first as in the following code:
es: En caso de que la clase AppModule del módulo de aplicación tenga un constructor definido, Python seguirá las órdenes especificadas en ese constructor. Antes de hacer los procedimientos de inicialización específicos del módulo de aplicación, es importante llamar primero al constructor del módulo de aplicación por defecto como en el siguiente código:

source: This is a must because the default app module constructor performs important activities, including:
es: Esto es obligatorio porque el constructor del módulo de aplicación por defecto realiza actividades importantes, incluyendo:

source: 1. The default app module constructor will call another base constructor (this time, it is baseObject.ScriptableObject, containing gestures support among other important properties).
es: 1. El constructor del módulo de aplicación por defecto llamará a otro constructor base (en esta ocasión, se trata de baseObject.ScriptableObject, que contiene soporte de gestos entre otras propiedades importantes).

source: 2. Initializes various properties, such as PID (process ID), app module name (if defined), application name and the handle to the app in question via kernel32.dll's OpenProcess function (XP/Server 2003 and Vista/Server 2008 and later requires different arguments).
es: 2. Inicializa diversas propiedades, como PID (identificador de proceso), nombre del módulo de aplicación (si está definido), nombre de la aplicación y manejador hacia la aplicación en cuestión mediante la función OpenProcess de kernel32.dll (XP/Server 2003 y Vista/Server 2008 y posterior necesitan argumentos distintos).

source: 3. Lastly, the constructor initializes process injection handle and helper binding handle in case such routines are required.
es: 3. Por último, el constructor inicializa el manejador de inyección de proceso y el manejador de asociación auxiliar en caso de que se necesiten estos procedimientos.

source: ### Birth: app module construction
es: ### Nacimiento: construcción del módulo de aplicación

source: Certain app module add-ons shipt with an app module with a constructor define, and SPL Studio is one of them; in 2018, constructors were added to Creator and Track Tool for various purposes, and Remote VT client ships with a constructor similar to Creator app module. After calling the base constructor as described above, SPL app module's constructor (__init__ method that runs when the app module starts) does the following:
es: Ciertos complementos con módulos de aplicación vienen con un módulo de aplicación con un constructor definido, y SPL Studio es uno de ellos; en 2018, se añadieron constructores a Creator y a la herramienta de pista con diversos propósitos, y el cliente Remote VT viene con un constructor similar al del módulo de aplicación de Creator. Después de llamar al constructor base como se describe arriba, el constructor del módulo de aplicación de SPL (método __init__ que se ejecuta cuando se inicia el módulo de aplicación) hace lo siguiente:

source: 1. Checks whether a supported version of Studio is running, and if not, raises RuntimeError exception, preventing you from using the app module while an unsupported version of Studio is in use (as of add-on 17.04, you need to use Studio 5.10 and later).
es: 1. Comprueba si se está ejecutando una versión soportada de Studio, y si no es así, se lanza una excepción RuntimeError, impidiendo que uses el módulo de aplicación mientras esté en uso una versión no soportada de Studio (a partir del complemento 17.04, es necesario usar Studio 5.10 o posterior).

source: 2. Unless silenced by `globalVars.appArgs.minimal` being True, NVDA announces, "Using SPL Studio version 5.01" if Studio 5.01 is in use (of course, NVDA will say 5.10 when Studio 5.10 is in use). This is done via ui.message function (part of NVDA Core) which lets you hear spoken messages or read the message on a braille display. In reality, ui.message function calls two functions serially (one after the other): speech.speakMessage (speaking something via a synthesizer) and braille.handler.message (brailling messages on a braille display if connected).
es: 2. A menos que se silencie poniendo `globalVars.appArgs.minimal` a True, NVDA verbaliza "Usando SPL Studio versión 5.01" si Studio 5.01 está en uso (por supuesto, NVDA dirá 5.10 cuando Studio 5.10 esté en uso). Esto se hace mediante la función ui.message (parte del núcleo de NVDA), que te permite oír mensajes hablados o leer el mensaje en una pantalla braille. En realidad, la función ui.message llama en serie a dos funciones (una después de la otra): speech.speakMessage (hablando algo mediante un sintetizador) y braille.handler.message (mostrando mensajes en una pantalla braille si hay alguna conectada).

source: 3. Next, add-on settings and related subsystems are initialized by calling splconfig.initialize(). For add-on 6.x and 7.x, the first four steps are performed by the init (formerly initConfig) function itself, while in 8.0 it is handled by SPLConfig ConfigHub class constructor. Add-on 17.10 changes this significantly, and in 18.07 and later, some steps are skipped if another Studio app is in use (see the next few sections). This is done as follows:
es: 3. A continuación, se inicializan los ajustes del complemento y los subsistemas relacionados llamando a splconfig.initialize(). Para los complementos 6.x y 7.x, se hacen los cuatro primeros pasos en la misma función init (conocida como initConfig), mientras que en el 8.0 se encarga de esto el constructor de la clase ConfigHub de SPLConfig. El complemento 17.10 cambia esto de forma significativa, y en la versión 18.07 y posteriores, se saltan algunos pasos si otra aplicación de Studio está en uso (mira las siguientes secciones). Esto se hace de la siguiente manera:
