Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/spladdoninternals.po
Languages: es

source: ### Introducing Cart Explorer version 1
es: ### Presentación del explorador cart versión 1

source: Cart Explorer version 1, shipped as part of add-on 3.0, worked as follows:
es: La versión 1 del explorador cart, incorporada en el complemento 3.0, funcionaba de la siguiente manera:

source: 1. You press Control+NVDA+3 to activate Cart Explorer. When this happens, NVDA will make sure you are in main playlist viewer, then it will set a flag indicating that Cart Explorer is active.
es: 1. Se pulsa NVDA+ctrl+3 para activar el explorador cart. Cuando esto ocurre, NVDA se asegura de que estés en el visor principal de listas de reproducción, y después establece un indicador para informar de que el explorador cart está activo.

source: 2. NVDA will then open and parse cart bank files, storing cart assignments in a dictionary of cart keys to cart names. This parser also takes care of some corner cases, including skipping unassigned carts and determining Studio edition in use. Once carts were parsed, NVDA says, "Entering Cart Explorer", and if errors occur, NVDA will inform you that it cannot enter Cart Explorer (this happens if the cart bank file doesn't exist).
es: 2. NVDA abre e interpreta los archivos de los bancos cart, almacenando las asignaciones de carts en un diccionario con teclas de cart y nombres de cart. Este intérprete también tiene en cuenta algunos casos excepcionales, incluyendo saltarse los carts no asignados y determinar la edición de Studio en uso. Una vez se interpretan los carts, NVDA dice "Entrando en el explorador cart", y si ocurren errores, NVDA te informará de que no puede entrar en el explorador cart (esto pasa si el archivo del banco de carts no existe).

source: 3. While using Cart Explorer, if you press a cart key, NVDA will look up the name of the key in the carts dictionary, and announce the cart name associated with it (if found, otherwise, NVDA says, "cart unassigned").
es: 3. Mientras usas el explorador cart, si pulsas una tecla cart, NVDA buscará el nombre de la tecla en el diccionario de carts, y anunciará el nombre del cart asociado con ella (si se encuentra, en cualquier otro caso NVDA dice "Cart sin asignar").

source: 4. It so happens that some people will activate Cart Edit Mode to modify cart assignments while in the middle of exploring carts. If this happens, NVDA will remind you (via doExtraAction function used by name change event) that Cart Explorer is active, and when Cart Edit Mode is turned off, NVDA will ask you to reenter Cart Explorer (this was done to parse newly updated cart bank files).
es: 4. A veces algunas personas activan el modo de edición de cart para modificar sus asignaciones mientras explora carts. Si esto pasa, NVDA te recordará (mediante la función doExtraAction usada en el evento de cambio de nombre) que el explorador cart está activo, y cuando el modo de edición de cart se desactive, NVDA te preguntará si quieres volver a entrar en el explorador cart (esto se hizo para interpretar los archivos actualizados de bancos de carts).

source: 5. You press Control+NVDA+3, and NVDA will clear carts dictionary, thereby leaving Cart Explorer.
es: 5. Se pulsa ctrl+NVDA+3, y NVDA limpiará el diccionario de carts, dejando el explorador cart después.

source: But there was a major concern with this approach: what if a future version of Studio uses a different cart bank format? Thus, I revisited cart bank files again in July 2015, and this time, I noticed a familiar structure: comma-separated values, and thought about a possibility that a spreadsheet application such as Excel would handle this gracefully. To test my hypothesis, I opened .cart files in Excel, and voila, it presented itself just like any CSV file. Thus I worked on modifying cart parsing routine, this time using Python's CSV module to parse "cart" files (cart bank files are really CSV files in disguise). This new routine (described below) made its appearance as part of add-on 6.0.
es: Pero había un gran problema con este enfoque: ¿qué pasa si una versión futura de Studio utiliza un formato diferente de bancos de cart? Por lo tanto, volví a visitar los archivos de banco de cart de nuevo en julio de 2015, y esta vez me di cuenta de que había una estructura familiar: valores separados por comas, y pensé en la posibilidad de que una aplicación de hojas de cálculo los procesaría adecuadamente. Para probar mi hipótesis, abrí los archivos .cart en Excel, y efectivamente, se mostraron como archivos csv. Por lo tanto, trabajé en modificar el procedimiento de interpretación de carts, en esta ocasión usando el módulo csv de Python para interpretar los archivos "cart" (los archivos de bancos de cart realmente son archivos csv en esencia). Este nuevo procedimiento (descrito debajo) hizo su aparición como parte del complemento 6.0.

source: ### The magic behind Cart Explorer version 2: handling CSV files
es: ### La magia tras el explorador cart versión 2: trabajar con archivos csv

source: Since Python comes with a library to handle CSV files and since cart banks are CSV files, I rewrote Cart Explorer routine (a function in splmisc module which returns the carts dictionary) as follows:
es: Ya que Python viene con una biblioteca para trabajar con archivos csv y ya que los bancos de carts son archivos csv, reescribí el procedimiento del explorador cart (una función en el módulo splmisc que devuelve el diccionario de carts) de la siguiente manera:

source: 1. When entering Cart Explorer, Cart Explorer preparation routine (splmisc.cartExplorerInit) will take a snapshot of your user name and Studio edition (Studio's title bar indicates which version is in use). Then it initializes the carts dictionary and stores the Studio edition in use.
es: 1. Al entrar en el explorador cart, el procedimiento de preparación del explorador cart (splmisc.cartExplorerInit) tomará una instantánea de tu nombre de usuario y la edición de Studio (la barra de título de Studio indica qué versión se está usando). Después inicializa el diccionario de carts y almacena la edición de Studio en uso.

source: 2. Next, the preparation function will write down names and paths to cart banks. In case a user other than default user is using Studio, it'll modify the cart file names to match the name likely to be used by Studio to present user-specific cart banks. These cart names form one part of the cart bank path (the other part is the path to the folder where the carts live, obtained by using an environment variable).
es: 2. A continuación, la función de preparación escribirá nombres y rutas en los bancos cart. En caso de que un usuario distinto al que hay por defecto esté utilizando Studio, se modificarán los nombres de archivo de los carts para que encajen con el nombre que probablemente usará Studio para presentar los bancos de carts específicos del usuario. Estos nombres de carts forman una parte de la ruta al banco de carts (la otra parte es la ruta a la carpeta en la que residen los carts, obtenida mediante una variable de entorno).

source: 3. For each cart bank, NVDA will ask Python to parse the cart bank as a CSV file (csv.reader; when finished, it returns a list of lists, with each list representing one row of a CSV table).
es: 3. En cada banco de carts, NVDA pedirá a Python que interprete el banco como un archivo csv (csv.reader; al acabar, devuelve una lista de listas, siendo cada lista una fila de la tabla csv).

source: 4. Once the csv version of the selected cart bank is ready, the row containing cart keys and cart names, together with the cart bank modifier and the carts dictionary are sent to a helper function (part of splmisc module) that will do the following:
es: 4. Una vez está lista la versión csv del banco de carts correspondiente, la fila que contiene las teclas de cart y sus nombres, junto con el modificador del banco de carts y el diccionario de carts, se envían a una función auxiliar (parte del módulo splmisc) que hará lo siguiente:

source: 1. Depending on Studio edition, this helper will work with only the first half (Standard will only work with function keys, which are the first twelve columns of this row) or the entire row (the rest are number row keys) will be processed.
es: 1. Dependiendo de la edición de Studio, esta función auxiliar trabajará con la primera mitad solamente (la Standard sólo trabajará con las teclas de función, que están en las primeras doce columnas de esta fila) o se procesará la fila entera (el resto son las teclas numéricas).

source: 2. Depending on column position (items in the row list), it will see if function keys or number row keys should be assigned to the selected cart entry. This routine also checks the type of the cart bank (modifiers or none (main)) and modifies the cart key name accordingly.
es: 2. Dependiendo de la posición de la columna (elementos en la lista de la fila), se verá si deberían asignarse las teclas de función o las de la fila numérica a la entrada seleccionada del cart. Este procedimiento también comprueba el tipo del banco de carts (modificadores o nada (principal)) y modifica el nombre de la tecla cart según corresponda.

source: 3. Next, the helper routine will try to locate the name of the jingle assigned to the cart key in question, and if there is one, it'll add the cart key and jingle name pair into the carts dictionary.
es: 3. A continuación, el procedimiento auxiliar intentará ubicar el nombre del jingle asignado a la tecla cart en cuestión, y si hay uno, añadirá el par de la tecla del cart y el nombre del jingle al diccionario de carts.

source: 5. Back at the cartExplorerInit function, if no erorrs were found while parsing a cart bank, it'll move onto the next one, otherwise it will inform the Studio app module by modifying a flag value in the carts dictionary (stored as an integer, representing number of cart bankks with errors).
es: 5. De vuelta en la función cartExplorerInit, si no se encontraron errores mientras se interpretaba un banco de carts, esta se moverá al siguiente, en cualquier otro caso informará al módulo de aplicación de Studio modificando un valor indicador en el diccionario de carts (almacenado como un entero que representa el número de bancos cart con errores).

source: 6. By now cartExplorerInit is desperate to pass the carts dictionary to someone, and this someone turns out to be the Studio app module - once picked up by the app module, carts dictionary is hired by you to look up cart names for cart keys while you use Cart Explorer (to fire the carts dictionary, simply deactivate Cart Explorer by pressing Control+NVDA+3).
es: 6. Ahora cartExplorerInit está desesperada por pasarle el diccionario de carts a alguien, y ese alguien resulta ser el módulo de aplicación de Studio - una vez es recogido por el módulo de aplicación, tú lo utilizas para mirar los nombres de carts que se corresponden con las teclas cart mientras usas el explorador cart (para echar al fuego el diccionario de carts, simplemente desactiva el explorador cart pulsando ctrl+NVDA+3).

source: In effect, the routine above (the "magic" behind Cart Explorer) replaced a hand-written cart bank parser and simplified the add-on code (I regret not investigating CSV module in 2014). As far as user experience is concerned, this is same as Cart Explorer 1, with the difference being the parsing routine. With the addition of splmisc.cartExplorerInit, the majority of the splmisc module (miscellaneous services, containing the Track Finder/Column Search combo dialog, column retriever and Cart Explorer preparation tool) was completed. But the innovations continued.
es: En efecto, el procedimiento anterior (la "magia" tras el explorador cart) reemplazó un intérprete de bancos de carts escrito a mano y simplificó el código del complemento (lamento no haber investigado el módulo csv en 2014). En términos de experiencia de usuario, no cambia nada con respecto al explorador cart versión 1, siendo la diferencia el procedimiento de interpretación. Al añadir la función splmisc.cartExplorerInit, la mayoría del módulo splmisc (servicios misceláneos entre los que están el diálogo combinado del buscador de columnas y el buscador de pistas, el recuperador de columnas y la herramienta de preparación del explorador cart) estaba completo. Pero continuaron las innovaciones.

source: ### Enter Cart Explorer version 3: file modification timestamps
es: ### Introducción al explorador cart versión 3: fechas de modificación de los archivos

source: There were two issues with Cart Explorer version 2: confusing statements when cart insert mode was active, and inability to detect that cart editing is finished. Cart insert mode allows broadcasters to press the cart command to have the file inserted into the playlist as a regular track. Inability to detect cart edit completion meant one had to reenter Cart Explorer to view updated cart assignments.
es: Había dos problemas con la versión 2 del explorador cart: frases confusas cuando el modo de inserción de cart estaba activo, e incapacidad de detectar que había finalizado la edición de carts. El modo de inserción de carts permite a los locutores pulsar la orden cart para insertar el archivo dentro de la lista de reproducción como si fuera una pista normal. La incapacidad de detectar la finalización de la edición de carts significaba que había que entrar en el explorador cart para ver las asignaciones cart actualizadas.

source: The first issue was solved by telling users that Cart Explorer was active while cart insert mode was active. The resolution to the second issue required a bit of work, and involved rewriting parts of Cart Explorer (now version 3), which is included as of add-on 17.01 (optimized in 17.04). The biggest difference is recording file modification timestamps for carts when carts dictionary is being built (see above), and if cart edit is turned off, checking the timestamps of newly modified cart banks against previous timestamps (when cart edit is off, when cart assignments have changed, cart files are written back to disk) and skipping unmodified cart banks. In spring 2017, this was further optimized by allowing carts dictionary to be modified on the fly (only changed bits will be modified, including possible new assignments, changes and deletions). This means no more need to reenter cart Explorer when cart assignments have changed, a huge relief for broadcasters who need to change cart assignments for holidays or other special occasions.
es: El primer problema se solucionó indicando a los usuarios que el explorador cart estaba activo mientras el modo de inserción de carts lo estaba. La resolución del segundo problema necesitó un poco de trabajo, e implicó reescribir partes del explorador cart (ahora versión 3), que viene incluido a partir del complemento 17.01 (optimizado en 17.04). La gran diferencia es que se registran las fechas de modificación de los archivos cart cuando se construye el diccionario de carts (mira arriba), y si se desactiva la edición de carts, se comprueba la fecha de modificación de los archivos de banco de carts con las fechas guardadas (cuando la edición de carts se apaga, cuando cambian las asignaciones de carts, se escriben los archivos de carts de vuelta al disco) ignorando los archivos de cart no modificados. En la primavera de 2017, esto se optimizó aún más permitiendo que el diccionario de carts fuera modificado al vuelo (sólo se cambiarán los bits modificados, incluidas las posibles nuevas asignaciones, cambios y eliminaciones). Esto significa que desaparece la necesidad de volver a entrar al explorador cart cuando las asignaciones de los carts cambian, un gran alivio para los locutores que necesitan cambiar las asignaciones de carts para las fiestas u otras ocasiones especiales.

source: Cart Explorer has come a long way; from a simple suggestion to the CSV parsing routine above to checking timestamps for cart assignment changes, Cart Explorer has changed to meet the needs of broadcasters using Studio and NVDA. I would like to improve this further in future releases (another suggestion I received was ability to specify cart file names for individual banks, and I'm thinking about implementing this in the near future).
es: El explorador cart ha recorrido un largo camino; desde una sugerencia simple hasta el procedimiento para interpretar csv que se ha descrito antes y la comprobación de las fechas de modificación de los archivos para buscar cambios de asignación de carts. El explorador cart ha cambiado hasta satisfacer las necesidades de los locutores que usan Studio y NVDA. Me gustaría mejorarlo más en versiones futuras (otra sugerencia que recibí fue la capacidad de especificar los nombres de archivo con carts de bancos individuales, y estoy pensando en implementarla en el futuro cercano).

source: One of the things you may have noticed as you read this article so far is how I and other developers continue to research better ways of accomplishing something. You also saw a glimpse of how developers and users shape a feature and how much work is involved to bring a feature suggestion to life. These activities (research and feature development collaboration) are just two of the pillars of this add-on, and highlights how design philosophy and product development approach affects future course of product development.
es: Una de las cosas de las que puedes haberte dado cuenta según lees este artículo hasta ahora es cómo tanto yo como otros desarrolladores seguimos investigando mejores maneras de resolver algo. También echaste un vistazo a cómo desarrolladores y usuarios dan forma a una característica y cuánto trabajo implica hacer realidad una sugerencia. Estas actividades (investigación y colaboración en el desarrollo de características) son dos de los pilares que dan soporte a este complemento, y resaltan cómo afectan la filosofía del diseño y el enfoque de desarrollo del producto al curso futuro de su evolución.

source: This ends our detailed tour of internals of major features in Studio app module. When we come back, we'll visit our friend from the past: SPL Assistant layer and inner workings of various layer commands.
es: Con esto termina nuestro recorrido detallado por el interior de las características más importantes del módulo de aplicación de Studio. Cuando volvamos, visitaremos a nuestro amigo del pasado: la capa del asistente de SPL y el funcionamiento interno de diversas órdenes de capa.

source: ## All about StationPlaylist Assistant layer
es: ## Todo sobre la capa del asistente de SPL

source: You may recall visiting two layer command sets in an earlier section: SPL Controller and SPL Assistant, the former used to perform Studio functions from any program and the latter for status announcements. I mentioned throughout this series that we'll tour these layer sets, and we'll start with SPL Assistant layer.
es: Como recordarás, en un artículo anterior hablamos de dos conjuntos de órdenes de capa: el controlador de SPL y el asistente de SPL, el primero usado para realizar funciones de Studio desde cualquier programa y el otro para anuncios de estado. He mencionado a lo largo de este artículo que visitaríamos estos conjuntos de capa, así que empezaremos con la capa del asistente de SPL.

source: ### Talk about layer commands
es: ### Charla sobre las órdenes de capa

source: One of the common features of Studio scripts for JAWS, Window-Eyes and NVDA is extensive use of layer commands. This was popularized by JAWS and its Studio layer (grave key). Some of the benefits of this approach include saving keyboard commands, reminding users as to commands available in Studio and so on.
es: Una de las características que tienen en común los scripts de Jaws, Window Eyes y NVDA es el uso extenso de órdenes de capa. Jaws popularizó este concepto y su capa de Studio (la tecla grave). Algunos beneficios de este enfoque incluyen ahorrar órdenes de teclado, recordar a los usuarios las órdenes de Studio y así sucesivamente.

source: ### Birth of SPL Assistant layer
es: ### Nacimiento de la capa del asistente de SPL

source: As mentioned previously, since version 1.0 in January 2014, StationPlaylist add-on comes with two layer commands to represent the global plugin and the studio app module. In case of Studio app module and its layer set (SPL Assistant), I borrowed some commands from both JAWS and Window-Eyes scripts with some notable differences, namely some commands and how things were announced.
es: Como mencioné antes, desde la versión 1.0 en enero de 2014, el complemento StationPlaylist viene con dos órdenes de capa para representar a la extensión global y al módulo de aplicación de Studio. En el caso del módulo de aplicación de Studio y su conjunto de capa (asistente de SPL), tomé prestadas algunas órdenes de los scripts de Jaws y Window Eyes con algunas diferencias destacables, entre ellas algunas órdenes y cómo se verbalizaban las cosas.

source: When I sat down to design this layer set, I felt it would be helpful for broadcasters if most of the Assistant layer commands borrowed from Studio command assignments. For example, a broadcaster will press M to toggle microphone on and off, and in SPL Assistant layer, pressing M announces microphone status. Another example was Cart Edit Mode - pressing Control+T in Studio will toggle this, and pressing SPL Assistant, T will announce whether this mode is on or off (the reason for assigning T for Cart Edit Mode status will be discussed later).
es: Cuando me senté a diseñar este conjunto de capa, sentí que sería útil para los locutores que la mayoría de las órdenes de la capa del asistente vinieran de las órdenes asignadas a Studio. Por ejemplo, un locutor pulsará la m para encender o apagar el micrófono, y en la capa del asistente del SPL, pulsar la m hace que se verbalice el estado del micrófono. Otro ejemplo fue el modo de edición de cart - pulsar ctrl+t en Studio lo conmutará, y pulsar asistente de SPL, t indicará si este modo está encendido o apagado (más tarde se discutirá la razón por la que se asignó la t al estado del modo de edición de carts).

source: Originally, one could invoke SPL Assistant layer by pressing Control+NVDA+grave key from within Studio. However, some NVDA translators told me that this key combination is used for NVDA screen reader commands in their languages. Thus, in add-on 2.0 (late spring 2014), I decided to remove this command, which means in order for you (broadcasters) to invoke SPL Assistant layer, you need to go to Input Gestures dialog while focused in Studio, expand StationPlaylist category and look for the Assistant entry (I personally use Control+NVDA+grave, and in recent add-on development builds, I told the add-on to let SPL Controller layer command (discussed later) to invoke Assistant layer).
es: Originalmente se podía invocar la capa del asistente de SPL pulsando ctrl+NVDA+grave desde Studio. Sin embargo, algunos traductores de NVDA me dijeron que esta combinación de teclas se usa para algunas órdenes de NVDA en su idioma. Por tanto, en el complemento 2.0 (a finales de la primavera de 2014), decidí eliminar esta orden, lo que se traduce en que para que podáis invocar la capa del asistente de SPL (locutores), debéis ir al diálogo gestos de entrada mientras tengáis el foco en Studio, expandir la categoría StationPlaylist y buscar la entrada del asistente (personalmente uso ctrl+NVDA+grave, y en compilaciones recientes de desarrollo del complemento, hice que el complemento dejara a la orden de capa del controlador de SPL (explicada más tarde) invocara la capa del asistente).
