Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/spladdoninternals.po
Languages: es

source: ### Add-on development process
es: ### El proceso de desarrollo del complemento

source: Follow me as I show you how a typical SPL add-on version is developed, released and maintained:
es: Sígueme mientras te muestro cómo se desarrolla, publica y mantiene una versión típica del complemento para SPL:

source: 1. Before starting work on the new add-on version, I write down some goals the add-on should achieve, including feature ideas, user (your) suggestions and so on. With changes to the process in 2017, a feature development may span multiple versions.
es: 1. Antes de comenzar a trabajar en la nueva versión del complemento, apunto algunos objetivos que el complemento debería alcanzar, incluyendo ideas de características, sugerencias del usuario (tuyas) y demás. Con los cambios del proceso en 2017, el desarrollo de una característica puede hacerse a lo largo de varias versiones.

source: 2. I then hold a conference call with add-on users to see what they think about some ideas and gather feedback (these are also written down).
es: 2. A continuación hago una conferencia por llamada con usuarios del complemento para ver qué piensan de algunas ideas y recopilar comentarios (que también me apunto).

source: 3. I then create separate branches for each feature in order to isolate code and not to break existing code.
es: 3. Después creo ramas separadas para cada característica para aislar código y no romper el código existente.

source: 4. Next, I write todo comments reminding myself as to what the feature should be like, then I start working on it. As each feature is being developed, I do mental simulations as to how you might use the feature under development, such as possible errors, messages spoken and so on.
es: 4. Después, escribo comentarios para recordarme a mí mismo cómo debería ser la característica, luego empiezo a trabajar en ella. Según se va desarrollando cada característica, hago simulaciones mentales sobre cómo podrías usar la característica en desarrollo, posibles errores, mensajes verbalizados y así.

source: 5. Once the feature is quite stable, I test the feature to uncover bugs and to fill in the missing pieces. When it comes to testing, I test the new feature branch on both of my computers running different versions of Studio to make sure it works across versions (if not, I go back and modify the code to recognize differences between Studio versions).
es: 5. Una vez la característica está bastante estable, la pruebo para descubrir fallos y rellenar los huecos que faltan. Cuando pasa a pruebas, pruebo la nueva rama de características en mis dos ordenadores, que ejecutan versiones distintas de Studio, para asegurarme de que funciona entre versiones (si no, vuelvo atrás y modifico el código para reconocer las diferencias entre versiones de Studio).

source: 6. Starting in fall 2015, I've merged development branches into a staging branch for testing purposes. This branch is also used to generate try (Test Drive program) builds so those who've signed up for early access program can leave feedback (try builds are generated about once a week).
es: 6. Empezando a finales del 2015, he mezclado las ramas de desarrollo en una única rama con propósitos de prueba. Esta rama también se usa para generar compilaciones de prueba (programa de unidad de pruebas), así que todo el que se ha registrado para el programa de acceso previo puede dejar comentarios (las compilaciones de prueba se generan aproximadamente una vez a la semana).

source: 7. After testing the feature for a while and if the feature is stable, I merge the feature branch into master.
es: 7. Después de probar la característica durante un rato y si esta es estable, mezclo la rama de la característica en master.

source: 8. Every few weeks, I publish master branch snapshots to gather feedback from users willing to test drive snapshots. With the advent of add-on updates in add-on 7.0, one can update between snapshots or stable versions (whichever branch one is using, the update check routine wil use that branch; for example, if one is using master snapshots, updates will be fetched from master branch only).
es: 8. Cada pocas semanas, publico versiones de desarrollo de la rama master para recopilar comentarios de los usuarios que estén dispuestos a probar versiones de desarrollo dirigidas. Con la llegada de las actualizaciones del complemento en la versión 7.0, cualquiera puede actualizar entre versiones estables o de prueba (la rama en uso será utilizada por el actualizador; por ejemplo, si alguien usa las versiones de desarrollo master, las actualizaciones sólo se recuperarán desde la rama master).

source: 9. At some point, I set release target window for the next add-on version (for 6.0, it was December 2015). This determines when feature freeze should be and beta release window (for 6.0, beta 1 was released in October 2015). Between feature freeze and the first beta release, I concentrate on code refinements and bug fixes. This has changed significantly in 2017 (see below).
es: 9. En algún momento, establezco la fecha de la publicación de la próxima versión del complemento (para la versión 6.0, fue en diciembre del 2015). Esto determina cuándo debería ser la congelación de características y la fecha de liberación de la beta (para el 6.0, la beta 1 se publicó en octubre del 2015). Entre la congelación de características y la primera liberación beta, me concentro en refinar el código y arreglar fallos. Esto ha cambiado significativamente en 2017 (mira más abajo).

source: 10. After going through several beta cycles (typically two), I ask NVDA community add-on reviewers to review my add-on code and request add-on release during the release window (this is done by merging master branch into stable branch).
es: 10. Después de hacer varios ciclos beta (generalmente dos), pido a los revisores de la comunidad de NVDA que revisen el código de mi complemento y pidan su publicación en las fechas apropiadas (esto se hace mezclando la rama master en la rama stable).

source: 11. Once the add-on version is released, subsequent maintenance versions (localization updates, bug fixes, minor tweaks) will be released from the stable branch, with the master branch containing the code for the next major version.
es: 11. Una vez se publica la versión del complemento, las siguientes versiones de mantenimiento (actualización de traducciones, solución de fallos, retoques menores) se liberarán desde la rama stable, con la rama master conteniendo el código para la siguiente gran versión.

source: 12. Once the next version enters beta cycle, further maintenance releases may or may not happen (an exception is long-term support release, described below).
es: 12. Una vez la siguiente versión entra en el ciclo de betas, podría haber o podría no haber más versiones de mantenimiento (una excepción son las versiones de soporte extendido, descritas más abajo).

source: #### Changes in 2017
es: #### Cambios en 2017

source: In late 2016, I and some users had a conference call regarding the future direction of the add-on. During this call, participants felt that the add-on now includes all the features people need, so it was decided to scale back on features and focus on compatibility with new Studio releases. In the end, it was decided that a version of the add-on to be released in 2017 will be the final major version of this add-on, with future updates being byte-sized chunks.
es: Ya entrado 2016, algunos usuarios y yo tuvimos una conferencia por llamada relacionada con la dirección futura del complemento. Durante esta llamada, los participantes sentían que el complemento ya incluye todas las funciones que la gente necesita, por lo que se decidió dejar de escalar en características y enfocarse en la compatibilidad con nuevas versiones de Studio. Al final, se decidió que una versión del complemento que se publicaría en 2017 sería la versión final principal de este complemento, con las futuras actualizaciones siendo muy pequeñas.

source: This decision also aligned with my other add-ons where new versions were released every month or so, along with the fact that features are complete for most add-ons. The new regular update schedule for SPL add-on was implemented as of June 2017.
es: Esta decisión también se alineó con mis otros complementos, donde las nuevas versiones se liberaban cada mes o así, junto al hecho de que las características están completas en la mayoría de complementos. La nueva programación regular de actualizaciones del complemento de SPL se implementó en junio de 2017.

source: There were two more implications of this decision:
es: Esta decisión implicaba dos cosas más:

source: * No more waits: a new stable feature should not be held up for up to six months if it is ready for the public, thus updates include both new features and bug fixes.
es: * No más esperas: una nueva característica estable no debería retenerse hasta dentro de seis meses si está lista para el público, y por tanto las actualizaciones incluyen nuevas características y solución de fallos.

source: * The Test Drive program (see below) should not be an exclusive thing anymore, but an opt-in process, as I felt early feedback loop is crucial to success of a product such as this add-on.
es: * El programa de pruebas dirigidas (mira más abajo) no debería ser algo exclusivo nunca más, sino un proceso al que se pueda optar, ya que yo sentía que el bucle de retroalimentación temprana es crucial para el éxito de un producto como este complemento.

source: With this in mind, the following things were changed in 2017:
es: Con esto en mente, las siguientes cosas cambiaron en 2017:

source: * No more betas: the development branch (now called slow ring) is considered live beta branch.
es: * No más betas: la rama de desarrollo (ahora llamada anillo lento) se considera como rama de betas.

source: * Anyone can switch to try build branch (called fast ring snapshots) provided that they are willing to provide early feedback.
es: * Cualquiera puede cambiar a la rama de compilaciones de prueba (llamada anillo rápido de instantáneas) suponiendo que estén interesados en proporcionar retroalimentación temprana.

source: * Long-term support updates are now tied to new major Studio releases. This criteria was extended in late 2017 to include critical changes to NVDA (see below).
es: * Las actualizaciones de soporte extendido ahora están atadas a las nuevas versiones principales de Studio. Este criterio se extendió entrado 2017 para incluir cambios críticos en NVDA (mira más abajo).

source: #### Further changes in 2018
es: #### Más cambios en 2018

source: In July 2018, NV Access announced changes to NVDA's release process in order to make testing and integration easier. Prior to this, an NVDA feature was incubated in the next snapshot for at least two weeks, and this meant having to deal with increasing number of pull requests which sometimes produced conflicts. To avoid this, and to let features come to master branch directly, what used to be live beta (master) branch became "alpha" snapshots. People who wanted more stability were moved to beta releases.
es: En julio de 2018, NV Access informó sobre cambios en el proceso de liberación para facilitar la integración y las pruebas. Antes de eso, se estaba incubando una nueva función de NVDA en la versión de desarrollo next durante al menos dos semanas, y esto significaba tratar con el creciente número de solicitudes de cambio que en ocasiones producían conflictos. Para evitar esto, y hacer que las nuevas funciones vinieran a la rama master directamente, lo que solía ser la rama de beta en vivo (master) se convirtió en las versiones de desarrollo "alpha". Se movió a la gente que quería más estabilidad a las versiones beta.

source: On the SPL add-on side, Test Drive Fast and Slow ring builds have become identical in late July 2018. I also felt that add-on development has slowed down considerably, as well as preparing for the next long-term support release (18.09), thus I felt an overhaul of Test Drive Program was in order.
es: Por parte del complemento para SPL, las compilaciones de los anillos lento y rápido del programa de prueba se han vuelto idénticas a finales de agosto de 2018. He sentido también que el desarrollo del complemento se ha ralentizado considerablemente mientras se preparaba la siguiente versión LTS (18.09) y, por tanto, reacondicioné el programa de unidad de pruebas.

source: Then in August 2018, I released Add-on Updater, a proof of concept add-on that allows NVDA to check for add-on updates for all add-ons registered with NVDA Community Add-ons website. In its early days, SPL add-on was excluded because it interfered with Add-on Updater's own update check facility. In reality, I generalized SPL add-on's update check code and transfered it to the new Add-on Updater, hence almost identical internals.
es: Después, en agosto de 2018, publiqué Add-on Updater, un complemento que actuaba como prueba de concepto que permite que NVDA busque actualizaciones de todos los complementos registrados en el sitio web de complementos de la comunidad. En sus primeros días, se excluyó el complemento de SPL porque interfería con la propia función de búsqueda de actualizaciones de Add-on Updater. En realidad, generalicé el código de búsqueda de actualizaciones del complemento de SPL y lo transferí al nuevo Add-on Updater, por lo que era casi idéntico por dentro.

source: Given that my long-term goal is to let NVDA itself check for SPL add-on updates, coupled with observations from above, I asked the community if it would be better to change the nature of Test Drive Fast ring and to let Add-on Updater check for all add-on updates. The community agreed, hence the following changes were made in August 2018 prior to release of 18.09:
es: Dado que mi objetivo a largo plazo es hacer que NVDA busque por sí mismo las actualizaciones del complemento para SPL, además de las observaciones anteriores, pregunté a la comunidad si sería mejor cambiar la naturaleza del anillo rápido de la unidad de pruebas para que sea Add-on Updater el que busque todas las actualizaciones. La comunidad estuvo deacuerdo, por lo que se llevaron a cabo los siguientes cambios en agosto de 2018 antes de publicar la versión 18.09:

source: * Test Drive Fast and Slow rings were combined into a single "development" channel. Consequently, there is no more update channel selection capability, with users encouraged to obtain the right releases from add-ons website. This was extended in September 2018 to cover long-term support releases.
es: * Los anillos rápido y lento de la unidad de pruebas se combinaron en un único canal de "desarrollo". Como consecuencia ya no existe la posibilidad de elegir el canal de actualización, siendo los usuarios los encargados de obtener la versión correcta desde la web de complementos. Esto se extendió en septiembre de 2018 para cubrir las versiones de soporte extendido.

source: * A new concept of "pilot features" replaced Test Drive Fast, configurable via a checkbox and internal flags.
es: * Un nuevo concepto de "funciones piloto" reemplazó al anillo rápido de la unidad de pruebas, configurable mediante una casilla de verificación e indicadores internos.

source: * New (risky) features under development will be enabled if pilot features facility is turned on, otherwise content is identical to regular development build.
es: * Las nuevas funciones (arriesgadas) en desarrollo se activarán si la opción de funciones piloto se activa, en cualquier otro caso el contenido es idéntico al de las versiones de desarrollo regulares.

source: * Add-on update checking facility is now taken care of by Add-on Updater, and in the future, to be done by NVDA itself. Consequently, add-on update feature and the source code that controlled it has been removed in December 2018.
es: * La función de búsqueda de actualizaciones del complemento la lleva a cabo Add-on Updater, y en el futuro, el propio NVDA. Como consecuencia, la función de búsqueda de actualizaciones y el código fuente que la controlaba se han eliminado en diciembre de 2018.

source: #### Long-term support release
es: #### Versión de soporte extendido

source: A typical add-on version is supported until the next add-on version is released (currently several weeks to months). However, there are times when an add-on version receives extended support (termed long-term support (LTS) release). This happens if the next major version of Studio is released, a version of Studio with user interface changes is released, or critical changes are expected in future NVDA releases such as ending support for a Windows version.
es: Una versión típica de un complemento se soporta hasta que se publica la siguiente versión del complemento (actualmente varias semanas o meses). Sin embargo, hay veces en las que una versión de un complemento recibe soporte extendido (llamadas versiones lts). Esto pasa si se publica la siguiente versión de Studio, se publica una versión de Studio con cambios en la interfaz de usuario, o se esperan cambios críticos en versiones futuras de NVDA tales como finalización de soporte para una versión de Windows.

source: A LTS version is a major version or a major periodic release of the SPL add-on with some notable differences:
es: Una versión lts es una versión mayor o una versión periódica del complemento de SPL con algunas diferencias destacables:

source: * Support duration: A LTS version is supported for at least twelve months.
es: * Duración del soporte: una versión LTS recibe soporte durante al menos doce meses.

source: * Features: A LTS version may contain some features from future add-on releases provided that they can be safely backported.
es: * Características: una versión lts puede contener algunas características de versiones futuras del complemento que pueden agregarse de forma segura.

source: * Studio version supported: A LTS version is the last version to support the oldest supported Studio version. This is designed to give people plenty of time to upgrade to newer Studio releases.
es: * Versión soportada de Studio: una versión lts es la última versión en dar soporte a la versión de Studio más antigua soportada. Esto se diseña así para dar a la gente todo el tiempo posible para actualizarse a una nueva versión de Studio.

source: * Last version with old NVDA technology in use: in some cases, LTS releases are made to support users of old NVDA releases. After the LTS release is created, add-on source code will shift to using newer code from NVDA. This criteria was first applied in 18.09 as a result of NVDA's end of support for Windows XP, Vista and 7 without Service Pack 1, as well as transition to Python 3.
es: * Última versión que usa tecnología de NVDA antigua: en algunos casos, las versiones lts están hechas para dar soporte a usuarios de versiones antiguas de NVDA. Después de crear la versión lts, el código fuente del complemento cambiará para usar el código más reciente de NVDA. Este criterio se aplicó primero a la versión 18.09 como resultado del fin de soporte de NVDA para Windows XP, Vista y 7 sin Service Pack 1, así como para la transición a Python 3.

source: As of June 2021, the most recent LTS version is add-on 20.09.x (September 2020 to April 2021). Previous LTS releases have included 18.09.x (September 2018 to December 2019), 15.x (formerly 7.x until October 2016; October 2016 to April 2018) and 3.x (September 2014 to June 2015). For example, add-on 3.x was maintained thus:
es: A fecha de junio de 2021, la versión LTS más reciente es la 20.09.x (desde septiembre de 2020 hasta abril de 2021). Entre las versiones LTS anteriores se incluyen la 18.09.x (desde septiembre de 2018 a diciembre de 2019), la 15.x, conocida como 7.x hasta octubre de 2016 (de octubre de 2016 a abril de 2018). La versión lts anterior era la 3.x (de septiembre de 2014 a junio de 2015). Por ejemplo, el complemento 3.x se mantuvo de la siguiente manera:

source: 1. Add-on 3.0 was released in September 2014.
es: 1. El complemento 3.0 fue publicado en 2014.

source: 2. Add-on 3.5 (December 2014) could have been the last maintenance version for add-on 3.x if it was not a LTS version.
es: 2. El complemento 3.5 (diciembre de 2014) podría haber sido la última versión de mantenimiento del complemento 3.x si no hubiera sido una versión lts.

source: 3. When add-on 4.0 was released (January 2015), add-on 3.6 was released, backporting some features from 4.0. Users were told that add-on 3.x will be the last version to support Studio versions earlier than 5.00. From that time on, add-on 3.x was taken off the stable branch and was moved to an internal branch.
es: 3. Cuando se publicó el complemento 4.0 (enero de 2015), se liberó el complemento 3.6, que traía algunas características del 4.0. Se dijo a los usuarios que el complemento 3.x sería el último en dar soporte a versiones de Studio anteriores a la 5.00. A partir de entonces, el complemento 3.x se trasladó desde la rama stable a una rama interna.

source: 4. When add-on 5.0 beta was released (May 2015), add-on 3.x (3.9 was available then) entered end of support countdown (no more maintenance releases).
es: 4. Cuando se publicó la beta del complemento 5.0 (mayo de 2015), el complemento 3.x (3.9 por entonces) entró en la cuenta atrás de fin de soporte (sin más versiones de mantenimiento).

source: 5. A few weeks later, when add-on 5.0 came out (June 2015), add-on 3.x became unsupported.
es: 5. Unas semanas más tardes, cuando llegó el complemento 5.0 (junio de 2015), el complemento 3.x se quedó sin soporte.

source: ### Final thoughts
es: ### Consideraciones finales

source: As I end this article on StationPlaylist Add-on Internals, I feel it is time I reveal why my add-ons are free: it is because I love you users and as a service for NVDA user and developer community (and in extension, to all blind broadcasters using SPL Studio). What brings me joy as an add-on writer is the fact that this add-on (and accompanying documentation) has made impact in your lives and lives of listeners to your shows, as well as to other NVDA users and developers around the world. Thank you users for your continued support and feedback, and I promise once again that all my add-on code (including SPL add-on) will be free and anyone is welcome to study and improve upon it.
es: Según termino este artículo sobre los interiores del complemento de StationPlaylist Studio, siento que es el momento de que revele por qué mis complementos son gratuitos: es porque amo a los usuarios como un servicio para la comunidad de usuarios y desarrolladores de NVDA (y en extensión, a todos los locutores que usan SPL Studio). Lo que me trae alegría como escritor de complementos es el hecho de que este complemento (y la documentación que lo acompaña) haya impactado en vuestras vidas y las vidas de los oyentes de vuestros programas, así como a otros usuarios y desarrolladores de NVDA por todo el mundo. Gracias a vosotros, usuarios, por vuestro soporte continuo y vuestros comentarios, prometo una vez más que todo el código de mis complementos (incluido el complemento de SPL) será libre y cualquiera es bienvenido para estudiarlo y mejorarlo.
