Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/SwitchingFromJawsToNVDA.po
Languages: es

source: In recent versions of JAWS, you can configure a different speech synthesizer to be used when say all is active. You can do this in NVDA by creating a say all profile in the configuration profiles menu.
es: En versiones recientes de JAWS, puedes configurar un sintetizador de voz diferente para que se utilice cuando Verbalizar todo está activo. Puedes hacerlo en NVDA creando un perfil Verbalizar todo en el menú Perfiles de Configuración.

source: Here are the steps.
es: Estos son los pasos.

source: 1. Open the configurations profile from the main NVDA menu. Press NVDA, N, then arrow down to configuration profiles.
es: 1. Abre Perfiles de Configuración en el menú principal de NVDA. Pulsa NVDA+n; luego, flecha abajo hacia Perfiles de Configuración.

source: 2. Create a new profile by tabbing to the *new* button or press alt, N.
es: 2. Crea un nuevo perfil tabulando hasta el botón *Nuevo* o pulsa alt+n.

source: 3. After you name your profile, tab to the profile usage radio butttons. arrow down until you hear "say all". Hit *OK*
es: 3. Después de introducir el nombre de tu perfil, Tabula hacia los botones de opciones para usar este perfil. Flecha abajo hasta oír "Verbalizar todo". Pulsa *Aceptar*

source: while this profile is active, you need to complete the process by configuring the synthesizer while the say all profile is active.
es: necesitas completar el proceso de configuración del sintetizador mientras el perfil Verbalizar todo está activo.

source: ## Missing Info
es: ## Información faltante

source: This guide is a community driven project and is ever expanding. If you have some experience of both JAWS and NVDA and think something's missing, feel free to add a section or revise out of date info. Spelling and grammar corrections are of course welcome. Please note that a Github account is required.
es: Esta guía es un proyecto dirigido por la comunidad y se encuentra en expansión. Si tienes algo de experiencia con Jaws y NVDA y piensas que falta algo aquí, añade libremente una sección o revisa la información obsoleta. Se agradecen, por supuesto, las correcciones gramaticales y ortográficas. Por favor, ten en cuenta que es necesaria una cuenta de GitHub.

source: After Editing, please preview your changes and fill in the edit summary box before submitting.
es: Después de editar, previsualiza tus cambios y rellena el campo Resumen de edición antes de enviarlos.
