Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/SwitchingFromJawsToNVDA.po
Languages: es

source: <!--- Please fill out the edit message before submitting changes. Do not use this guide to promote illegal software.--->
es: <!--- Por favor, rellena el mensaje de edición antes de enviar cambios. No uses esta guía para promocionar software ilegal.--->

source: # Switching From JAWS To NVDA
es: # Pasar de JAWS a NVDA

source: ## Introduction
es: ## Introducción

source: The purpose of this guide is to assist users of JAWS (Job Access With Speech), a commercial screen reader by Freedom Scientific to switch to the open-source screen reader NVDA (NonVisual Desktop Access) with ease. It assumes prior knowledge of JAWS and that you are proficient in its use.
es: El propósito de esta guía es ayudar a los usuarios de JAWS (Job Access With Speech), un lector de pantalla comercial proporcionado por Freedom Scientific, a pasar con facilidad al lector de pantalla de código abierto NVDA (Non Visual Desktop Access). La guía presupone que conoces JAWS y que eres capaz de usarlo eficientemente.

source: It is not intended to be a replacement of the included user guide, rather as a means to make NVDA seem less daunting.
es: No se propone reemplazar a la guía del usuario incorporada, sino más bien que NVDA no intimide tanto.

source: ## Strengths And Weaknesses
es: ## Fortalezas y debilidades

source: The intent of this guide is not to be a comparison of JAWS and NVDA, but it is necessary to mention some things that work differently. In most daily situations, NVDA works just as well as JAWS, if not better in some cases.
es: La intención de esta guía no es hacer una comparativa entre JAWS y NVDA, pero es necesario mencionar algunas cosas que funcionan de forma diferente. En la mayoría de situaciones cotidianas, encontrarás que NVDA funciona tan bien como JAWS, e incluso mejor en algunos casos.

source: ## NVDA's Desktop and Laptop Keyboard Layouts
es: ## Distribuciones de teclado de escritorio y portátil de NVDA

source: NVDA uses "Desktop" keyboard layout by default. This layout uses the number pad (with numlock off) for review cursor and object navigation commands (more on those further down). Laptop Keyboard layout is designed for keyboards without a number pad. Those commands are moved to other keys, as are a number of other commands.
es: NVDA utiliza de manera predeterminada la distribución de teclado "de escritorio". Esta distribución usa el bloque numérico (con el bloqueo numérico desactivado) para las órdenes del cursor de revisión y de navegación por objetos (se explica más sobre esto posteriormente). La distribución de teclado portátil está diseñada para teclados sin bloque numérico. Las órdenes anteriores cambian a otras teclas, al igual que otra buena cantidad de órdenes.

source: Selecting the laptop keyboard layout does not automatically set the CapsLock key to act as the NVDA modifier key. Keyboard layout and NVDA key can be set independently from NVDA's keyboard settings. Checkboxes are provided to select caps lock, numpad insert, or extended insert. Any combination of these keys can be selected regardless of the keyboard layout selected. Press NVDA+control+k to open NVDA's keyboard layout settings.
es: Seleccionar la distribución de teclado portátil no establece automáticamente la tecla Bloqueo de mayúsculas como tecla modificadora de NVDA. La distribución de teclado y la tecla modificadora de NVDA se pueden configurar independientemente desde las opciones de teclado de NVDA. Se proporcionan casillas de verificación para seleccionar bloqueo mayúsculas, insert del teclado numérico o insert extendido. Se puede elegir cualquier combinación de estas teclas sin importar la distribución de teclado elegida. Pulsa NVDA+control+k para abrir las opciones de distribución de teclado de NVDA.

source: ## Getting Started With NVDA
es: ## Primeros pasos con NVDA

source: The [NVDA User Guide](https://www.nvaccess.org/files/nvda/documentation/userGuide.html) contains all NVDA commands. Here are some basic commands which are used frequently. All commands are configurable, so these are the default keystrokes for these functions. As noted previously, your NVDA key can be either insert or caps lock.
es: La [guía de usuario de NVDA](https://www.nvaccess.org/files/nvda/documentation/userGuide.html) contiene todas las órdenes de NVDA. Aquí sólo hay algunas órdenes básicas que se emplean con frecuencia. Todas las órdenes son configurables, por lo que estas son las combinaciones de teclado predeterminadas para estas funciones. Como se ha reseñado antes, tu tecla NVDA puede ser insert o el bloqueo mayúsculas.

source: Most NVDA functions can be enabled or changed via the NVDA settings. Settings, and other options, are available via NVDA's menu. To open NVDA's menu, press NVDA+n. To open NVDA's settings dialog directly, press NVDA+control+g. Many settings screens have keystrokes to open them directly, such as NVDA+control+s for synthesizer, or NVDA+control+v for other voice options.
es: Se pueden activar y cambiar la mayoría de funciones de NVDA desde las opciones. La configuración, así como otros ajustes, está disponible en el menú NVDA. Para abrir el menú de NVDA, pulsa NVDA+n. Para abrir directamente el diálogo de opciones de NVDA, pulsa NVDA+control+g. Muchas pantallas de opciones disponen de atajos para abrirlas directamente, tales como NVDA+control+s para sintetizador, o NVDA+control+v para otras opciones de voz.

source: * Start NVDA: Press control+alt+n
es: * Iniciar NVDA: pulsa control+alt+n

source: * Exit NVDA: NVDA+Q, then enter.
es: * Salir de NVDA: NVDA+q, luego intro.

source: * Pause or restart speech: shift
es: * Pausar o reanudar la voz: shift

source: * Stop speech: control
es: * Detener la voz: control

source: * Report window title: NVDA+t
es: * Indicar el título de la ventana: NVDA+t

source: * Report current focus: NVDA+tab
es: * Indicar el objeto que tiene el foco: NVDA+tab

source: * Report time: NVDA+f12 (press twice quickly for date)
es: * Indicar la hora: NVDA+f12 (pulsa dos veces rápidamente para la fecha)

source: * Toggle speak typed characters: NVDA+2
es: * Conmutar la verbalización de caracteres al escribir: NVDA+2

source: * Toggle speak typed words: NVDA+3
es: * Conmutar la verbalización de palabras al escribir: NVDA+3

source: * Toggle speak command keys: NVDA+4
es: * Conmutar verbalización de teclas de órdenes: NVDA+4

source: * Report battery: NVDA+Shift+b
es: * Indicar batería: NVDA+shift+b

source: * Toggle input help mode (read each key without performing an action): NVDA+1
es: * Conmutar el modo de ayuda de entrada (leer cada tecla sin realizar ninguna acción): NVDA+1

source: * Report status bar: NVDA+end (desktop layout) / NVDA+shift+end (laptop layout)
es: * Indicar barra de estado: NVDA+fin (distribución de escritorio), NVDA+shift+fin (distribución portátil)

source: * Read the current line: NVDA+up arrow (desktop keyboard layout) / NVDA+l (laptop keyboard layout)
es: * Leer la línea actual: NVDA+flecha arriba (distribución de teclado de escritorio), NVDA+l (distribución de teclado portátil)

source: * Say all (Read from the current point onwards): NVDA+down arrow (desktop layout) / NVDA+a (laptop layout)
es: * Verbalizar todo (leer desde la posición actual en adelante): NVDA+flecha abajo (distribución de escritorio), NVDA+a (distribución portátil)

source: * Report clipboard: NVDA+c
es: * Indicar portapapeles: NVDA+c

source: * Read selected text: NVDA+shift+up arrow (desktop layout) / NVDA+shift+s (laptop layout)
es: * Leer el texto seleccionado: NVDA+shift+flecha arriba (distribución de escritorio), NVDA+shift+s (distribución portátil)

source: * Report text formatting: NVDA+f
es: * Indicar formato del texto: NVDA+f

source: * Adjust speech options: NVDA+control+arrows (desktop layout) / NVDA+shift+control+arrows (laptop layout) - refer to the [Synth Settings Ring in the User Guide](https://www.nvaccess.org/files/nvda/documentation/userGuide.html#SynthSettingsRing) for more information
es: * Ajustar opciones de voz: NVDA+control+flechas (distribución de escritorio), NVDA+control+shift+flechas (distribución portátil). Consulta el [anillo de opciones del sintetizador en la guía de usuario](https://www.nvaccess.org/files/nvda/documentation/userGuide.html#SynthSettingsRing) para más información

source: * Open Elements list (similar to Jaws' links list): NVDA+f7 (Note that many single letter navigation keys such as H for heading, N for non-linked text or F for form field, are the same as used in Jaws).
es: * Abrir lista de elementos (similar a la lista de enlaces de Jaws): NVDA+f7.

source: To get help for NVDA, press NVDA+n to open the menu, then H for help. From this submenu you can access the User Guide, a quick reference of commands, history of new features and more. These first three options open in the default web browser. There is also more comprehensitve [Training Material available in the NV Access Shop](https://www.nvaccess.org/shop/).
es: Para obtener ayuda sobre NVDA, pulsa NVDA+n para abrir el menú, y A para Ayuda. Desde este submenú puedes acceder a la guía de usuario, una referencia rápida de órdenes, un historial de nuevas funciones y más. Estas tres primeras opciones se abren en el explorador web predeterminado. Hay material de formación más exhaustivo en la [tienda de la comunidad hispanohablante de NVDA](https://nvda.es/tienda).

source: ## Note On The Insert Key.
es: ## Nota acerca de la tecla Insert.

source: As you may be aware, both JAWS and NVDA can use the insert key for its modifier key. Both screen readers treat it slightly differently, which could lead to some confusion if you are used to one or the other.
es: Como sabrás, tanto JAWS como NVDA pueden utilizar la tecla insert como tecla modificadora. En ambos lectores de pantalla su comportamiento es ligeramente diferente, lo que podría llevar a cierta confusión si estás acostumbrado a uno u otro.

source: With JAWS loaded, the insert key is solely for its use. This means that, in order to use the original function assigned to it (such as switching between insert and overwrite modes in a text editor or word processor), you first have to activate JAWS's pass key through command.
es: Con JAWS cargado, la tecla insert es únicamente para su uso. Esto significa que, para utilizar la función original que se le ha asignado (como cambiar entre los modos insertar y sobrescribir en un editor de texto o procesador de texto), primero debes pulsar el atajo para enviar la siguiente pulsación de teclado al sistema.

source: NVDA, on the other hand, allows you to carry out the insert key's original function by pressing it twice quickly.
es: Por otra parte, NVDA te permite llevar a cabo la función original de la tecla insert presionándola dos veces rápidamente.

source: Keep this in mind the next time you're editing text while using NVDA and find yourself erasing what you've already written by typing over it. This also works for caps lock when it is assigned as the NVDA modifier key (press it twice to toggle caps lock).
es: Ten esto en cuenta la próxima vez que estés editando texto mientras usas NVDA y te encuentres sobreescribiendo texto. Esto también funciona para la BloqMayus cuando se asigna como la tecla modificadora de NVDA (pulsar la tecla dos veces seguidas para alternar a BloqMayus).

source: ## Keyboard Manager / Navigation Quick Key Manager / Input Gestures
es: ## Asistente de teclado / Asistente de teclas rápidas / Gestos de entrada

source: NVDA has one feature to edit keystrokes, called Input Gestures. Input Gestures is found on NVDA's "Preferences menu". Any feature can use keystrokes, touch gestures or Braille display buttons. When Input Gestures is loaded, the focus starts in a tree view. Use the arrows or first letter navigation to locate categories and options inside categories. Alternatively, press SHIFT+TAB or ALT+F to move to the filter edit, and type the name of the feature to find. Any feature can have multiple gestures defined, or none. When adding a gesture, you can add the gesture for the current keyboard layout only, or all layouts.
es: NVDA tiene una función para editar atajos de teclado, llamada Gestos de entrada. Gestos de entrada se encuentra en el menú "Preferencias" de NVDA. Cualquier función puede usar atajos de teclado, gestos táctiles o botones de la pantalla Braille. Cuando se carga Gestos de entrada, el foco comienza en una vista en árbol. Usa las flechas o navega con la primera letra para encontrar categorías y opciones dentro de esas categorías. De forma alternativa, pulsa shift+tab o alt+F para moverte al cuadro de edición Filtrar, y teclea el nombre de la función a buscar. Cualquier función puede tener varios gestos definidos, o ninguno. Al añadir un gesto, se puede indicar que sea sólo para la disposición de teclado actual, o todas las disposiciones.

source: ## Alternative Synthesizers
es: ## Sintetizadores alternativos

source: Windows OneCore voices, included in Windows 10, is used by NVDA as the default synthesizer in Windows 10. Windows OneCore voices are responsive, natural-sounding and available in many languages. To add extra voices install a new language in Windows 10 itself, including the language pack. Variants of a language, such as "English (United Kingdom)" and "English (United States)" each include different voices.
es: NVDA utiliza las voces de Windows OneCore, incorporadas en Windows 10, como el sintetizador predeterminado en Windows 10. Las voces de Windows OneCore son ágiles, suenan de forma natural y están disponibles en muchos idiomas. Para añadir voces adicionales, instala un nuevo idioma en Windows 10, incluyendo el paquete de idioma. Las variantes de un idioma, como "inglés (Reino Unido)" e "inglés (Estados Unidos)" incluyen voces diferentes.

source: The eSpeak NG synthesizer is also included with NVDA. It is used as the default in Windows 8.1 and earlier. Like NVDA itself, eSpeak NG is also free and open-source, which is one of the reasons for its inclusion. Another being the sheer amount of languages it can speak.
es: ESpeak NG es el sintetizador de voz que se incluye con NVDA. Se usa de forma predeterminada en Windows 8.1 y versiones anteriores. Al igual que NVDA en sí, eSpeak también es libre y de código abierto, una de las razones por las que viene incluido. Otra es el número de idiomas que puede hablar.

source: Both Windows OneCore Voices, and eSpeak NG, have access to features such as "rate boost", enabling the speech rate to effectively be doubled. You can also press SHIFT to pause, and continue, speaking, instead of CONTROL which simply stops speech.
es: Tanto las Voces Windows OneCore como eSpeak NG tienen acceso a funciones como "alzado brusco", lo que permite que la velocidad de voz se duplique efectivamente. También puedes pulsar MAYÚS para pausar, y pulsándola nuevamente continuará hablando, en lugar de CONTROL, que simplemente detiene la voz.

source: To change synthesizer, press NVDA+control+s. To set other voice options, press NVDA+control+v.
es: Para cambiar el sintetizador, pulsa NVDA+control+s. Para configurar otras opciones de voz, pulsa NVDA+control+v.

source: However, you may find that, for whatever reason, neither Windows OneCore, nor eSpeak NG is right for you. If this is the case you will be glad to know that there are alternatives, which will be discussed in the following sections.
es: Sin embargo, es posible que, por cualquier motivo, ni Windows OneCore ni eSpeak NG sean adecuados para ti. Si este es el caso, te encantará saber que hay alternativas, que se discutirán en las siguientes secciones.

source: Code Factory has released a version of [eloquence as an NVDA add-on which can be purchased from this link.](http://codefactoryglobal.com/app-store/voices-for-nvda/). A license to use Nuance's Vocalizer synthesizer is also included in the price.
es: Code Factory ha lanzado una versión de [eloquence como un complemento NVDA que puede adquirirse desde este enlace](http://codefactoryglobal.com/app-store/voices-for-nvda/). El precio también incluye una licencia para usar el sintetizador Vocalizer de Nuance.

source: See the section entitled "Scripts" for information about NVDA add-ons.
es: Consulta la sección titulada “Scripts” para obtener información sobre los complementos de NVDA.

source: ### Even more voices
es: ### Aún más voces

source: If you still cannot find the perfect voice for you, the [Extra Voices page](http://community.nvda-project.org/wiki/ExtraVoices) lists several other speech synthesizers (both free and paid you can use instead.
es: Si todavía no encuentras la voz perfecta para ti, consulta la [página de voces extra](http://community.nvda-project.org/wiki/ExtraVoices). En esta página en inglés se enumeran otros sintetizadores de voz (tanto gratuitos como de pago).

source: ## Using a specific soundcard / audio device
es: ## Utilización de una tarjeta de sonido / dispositivo de audio específico

source: Jaws has a "Soundcards" option in its utilities, which allows setting which audio device speech comes through. NVDA has a similar option in the Syntheisizer dialog. Press NVDA+control+s to open the dialog directly, TAB to the second option which is "Audio Output Device". This is a drop-down list with the audio devices available. Select the desired device with the arrow keys. The third option in this dialog box is "Ducking". This controls whether NVDA lowers ("Ducks") the volume of sounds from other programs (eg music or YouTube videos). Ducking can be "Always" (while NVDA is running), only while NVDA is outputting speech and sounds, or never.
es: Jaws dispone de una opción llamada "Tarjetas de sonido" en sus utilidades, que permite configurar por qué dispositivo de sonido sale la voz. NVDA tiene una opción parecida en el diálogo de sintetizador. Pulsa NVDA+control+s para abrir directamente el diálogo, tabula hasta la segunda opción, llamada "Dispositivo de salida de audio". Se trata de una lista desplegable con los dispositivos de sonido disponibles. Selecciona el dispositivo deseado con las flechas. La tercera opción de este cuadro de diálogo es "Modo de atenuación de audio". Esta controla si NVDA rebaja ("atenúa") el volumen de los sonidos de otros programas (como música o vídeos de YouTube). La atenuación puede producirse "siempre" (mientras NVDA se encuentra en ejecución), sólo mientras NVDA está hablando o emitiendo sonidos, o nunca.

source: ## Terminology
es: ## Terminología

source: Most of the time, both NVDA and JAWS share a lot of the same terminology to describe controls e.g. radio buttons, combo boxes, checkboxes etc.
es: En la mayoría de las ocasiones, JAWS y NVDA usan gran cantidad de términos comunes para describir controles, por ejemplo botones de opción, cuadros combinados, casillas de verificación, etc.

source: One notable difference is that NVDA differentiates between single and multi-line edit fields, and will also tell you if a field is "protected" (anything you type will be replaced by asterisks). It will also alert you if text is selected in a field when you tab over to it. If so, typing will replace the highlighted text.
es: Una diferencia notable es que NVDA distingue entre cuadros de edición simples y multilínea, y también te indicará si un campo es de contraseña (todo lo que escribas será reemplazado por asteriscos). También te advertirá si hay texto seleccionado en un campo cuando te sitúes sobre él con el tabulador. Si es así, al escribir se reemplazará el texto seleccionado.

source: NVDA refers to the different languages a speech synthesizer can speak as voices, and the different voices supported by your synthesizer as variants.
es: NVDA llama “voces” a los distintos idiomas que un sintetizador puede hablar, y “variantes” a las diferentes voces admitidas por tu sintetizador.

source: ## Cursors
es: ## Cursores

source: NVDA has various cursors to aid in navigating Windows and applications, similar to JAWS. The terminology is slightly different as described below.
es: NVDA tiene varios cursores para ayudar en la navegación de Windows y aplicaciones, similares a JAWS. La terminología es ligeramente distinta, según se describe a continuación.

source: The PC cursor in NVDA's documentation is referred to as the system focus and system caret.
es: El cursor del PC, en la documentación de NVDA, es mencionado como "el foco del sistema" y "el cursor del sistema".

source: The equivalent to the JAWS cursor is a combination of object navigation, the review cursor and the various review modes; such as Document review, object review and Screen Review. The Screen Review function is the one perhaps most similar to the JAWS cursor. However, it is beneficial to become familiar with all of these. You will find thorough, easy to understand instructions in the user guide, or the [Basic Training for NVDA](https://www.nvaccess.org/product/basic-training-for-nvda-ebook/) ($30 AUD).
es: Lo equivalente al cursor de JAWS es una combinación de navegación de objetos, el cursor de revisión, revisión de documentos y revisión de pantalla. La función de "revisión de pantalla" es quizá la más similar al cursor de JAWS, pero es conveniente familiarizarse con los tres modos de revisión. Encontrarás instrucciones para esto, ampliadas y más fáciles de entender, en la guía de usuario o el libro [formación básica de NVDA](https://nvda.es/producto/libro-formacion-basica-de-nvda/) (€17,99).

source: Unlike JAWS, you don't have to switch between the PC and JAWS cursor equivalents as the numpad is reserved exclusively for working with the JAWS cursor like functions.
es: A diferencia de JAWS, no hay que cambiar entre los equivalentes al cursor del PC y de JAWS, pues el teclado numérico está reservado exclusivamente para trabajar con las funciones correspondientes al "cursor de JAWS".

source: It is worth noting that when you use object navigation or the review cursor, the mouse does not, by default, move in sync. You have to press a command to move the mouse to the location of the review cursor, which is similar to how JAWS' "invisible cursor" works. There are also commands to simulate clicking or locking both mouse buttons.
es: Vale la pena señalar que, cuando se utiliza la navegación de objetos o el cursor de revisión, el ratón no se mueve en sincronía. Tienes que pulsar una orden para mover el ratón a la ubicación del cursor de revisión, que es similar a cómo funciona el "cursor invisible" de JAWS. También hay órdenes para simular clic o bloquear ambos botones del ratón.

source: However, if you simply want to activate the current object you are focused on when using object navigation, there is a command to do this without having to move the mouse cursor to it first.
es: Si simplemente deseas activar el objeto actual en el que estás enfocado cuando utilizas la navegación de objetos, hay una orden para hacerlo sin tener que mover el cursor del ratón hasta él objeto.

source: ### Accessing the notification area (system tray)
es: ### Accediendo al área de notificación (bandeja del sistema)
