Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/SwitchingFromJawsToNVDA.po
Languages: es

source: NVDA does not provide a dialog to access the notification area, as this is accessible natively. Press WINDOWS+B to access the notification area. To move between notification area items, either use the arrow keys or press the first letter of an item. Pressing the spacebar on an icon is the same as left-clicking the mouse. Pressing enter is the same as double-clicking the left mouse button (there is no distinction between these in Windows 10). Pressing the applications key or shift+f10 to open the context menu for an item.
es: NVDA no proporciona un diálogo para acceder al área de notificación, ya que se puede acceder de forma nativa. Pulsa WINDOWS+B para acceder al área de notificación. Para moverte entre los elementos del área de notificación, usa las flechas o pulsa la primera letra de un elemento. Pulsar la barra espaciadora sobre un icono es lo mismo que hacer clic con el botón izquierdo del ratón. Pulsar Intro es lo mismo que hacer doble clic con el botón izquierdo del ratón (no hay distinción entre estos en Windows 10). Pulsar la tecla aplicaciones o shift+f10 para abrir el menú contextual de un elemento.

source: If the first item in the notification area is "Notification chevron button", Windows is not set to show all icons. Press ENTER or spacebar to open this and then arrow through the items. To set Windows to always show all notification area icons, open "notification area" windows settings, or "select which icons appear on the taskbar", and ensure "Always show all icons in the notification area" is checked.
es: Si el primer elemento en el área de notificación es "Botón de notificación de chevron", Windows no está configurado para mostrar todos los iconos. Pulsa INTRO o barra espaciadora para abrir esto y luego las teclas de flechas para navegar a través de los elementos. Para configurar Windows para que siempre muestre todos los iconos del área de notificación, abre Configuración de Windows, "Área de notificación", o "Seleccionar los iconos que aparecen en la barra de tareas", y asegúrate de que la opción "Mostrar siempre todos los iconos en el área de notificación" esté marcada.

source: If you prefer to have a dialog you can access with NVDA+F11, there is a "SysTrayList" add-on available in the [Add-ons website](https://addons.nvda-project.org/index.en.html).
es: Si prefieres tener un cuadro de diálogo al que puedas acceder con NVDA+F11, hay un complemento "SysTrayList" disponible en el [sitio Web de complementos de la comunidad de NVDA](https://addons.nvda-project.org/index.es.html).

source: ### Accessing the ribbon
es: ### Accediendo a la cinta

source: Microsoft Office 2007 replaced the menu and toolbars with a "ribbon". Like the notification area, these are accessible so NVDA does not provide a "virtual ribbon" replacement. Microsoft has a page on [Using the keyboard to work with the ribbon](https://support.office.com/en-us/article/use-the-keyboard-to-work-with-the-ribbon-954cd3f7-2f77-4983-978d-c09b20e31f0e). Essentially press ALT or ALT+letter to access individual ribbons. Press CONTROL+LEFT and RIGHT ARROWS to move between groups within the current ribbon (eg Clipboard, font, paragraph, etc in Word's Home ribbon). Press TAB to move between individual items in each ribbon and spacebar or enter to activate the current ribbon item. The Ribbon also includes "tell me". Press alt+q, type the command or feature you would like to access, use the arrow keys to select it from the list and enter to activate it.
es: Microsoft Office 2007 reemplazó el menú y las barras de herramientas con una "cinta". Al igual que el área de notificación, estos son accesibles para que NVDA no proporcione un reemplazo de "cinta virtual". Microsoft tiene una página en inglés sobre el [Uso del teclado para trabajar con la cinta](https://support.office.com/en-us/article/use-the-keyboard-to-work-with-the-ribbon-954cd3f7-2f77-4983-978d-c09b20e31f0e). Esencialmente pulsa ALT o ALT+letra para acceder a las cintas individuales. Pulsa CONTROL+Flecha Izquierda y Flecha Derecha para moverse entre los grupos dentro de la cinta actual (por ejemplo Portapapeles, fuente, párrafo, etc en la cinta de Inicio de Word). Pulsa la tecla TAB para moverte entre los elementos individuales en cada cinta y barra espaciadora o Intro para activar el elemento de la cinta actual. La cinta también incluye "DIME" (Tell Me). Pulsa alt+q, y, después, escribe el término de búsqueda o la función a la que deseas acceder, usa las teclas de flechas para seleccionarlo a partir de la lista e Intro para activarlo.

source: ### Progress bar announcement
es: ### Anuncio de las barras de progreso

source: JAWS has only single type of progress bar announcement E.G speaking the percentage as it changes. In NVDA, This can be done verbally ("5%", "6%", "23%", etc), as beeps, increasing in pitch, or both. To adjust this, press NVDA+U. Alternatively, it is available from the Object Presentation settings. Press NVDA+control+o to open these settings.
es: Jaws sólo tiene un único tipo de anuncio de barras de progreso, verbalizar el porcentaje mientras cambia. En NVDA, esto se puede hacer verbalmente ("5%", "6%", "23%", etc.), en forma de pitidos que suben de tono, o ambas. Para ajustar esto, pulsa NVDA+u. Alternativamente, se encuentra disponible en las opciones de presentación de objetos. Pulsa NVDA+control+o para abrir estas opciones.

source: ### Accessing characters and emoji
es: ### Accediendo a los caracteres y emojis

source: Jaws has a command INSERT+4 to select symbols. In NVDA INSERT+4 (assuming INSERT is your NVDA modifier key) toggle speak command keys, which reports when non-alphanumeric keys, such as spacebar or arrows are pressed. To select special characters can be done in different ways in many programs. For instance, press CONTROL+ALT+E to type a Euro symbol in Word. The insert symbol functionality in Word (ALT+N, then U) is accessible, although some of the symbols listed in the "more symbols" dialog are not read correctly in all versions of Word. Similarly, the "charmap" program in Windows itself allows any symbol from any font to be inserted. Again, not all characters are completely described.
es: Jaws tiene un comando INSERT+4 para seleccionar símbolos. En NVDA INSERT+4 (suponiendo que INSERT sea tu tecla modificadora de NVDA) conmutará el modo verbalizar teclas de órdenes, que anuncia cuándo se pulsan teclas no alfanuméricas, como la barra espaciadora o las flechas. Para seleccionar caracteres especiales se pueden usar diferentes medios en muchos programas. Por ejemplo, pulsa CONTROL+ALT+E para escribir el símbolo del Euro en Word. La funcionalidad de insertar símbolo en Word (ALT+N, luego U) es accesible, aunque algunos de los símbolos enumerados en el cuadro de diálogo "Más símbolos" no se leen correctamente en todas las versiones de Word. Del mismo modo, el programa "charmap" en el propio Windows permite insertar cualquier símbolo de cualquier fuente. Nuevamente, no todos los caracteres están completamente descritos.

source: The Windows 10 Emoji window is accessible. Press WINDOWS+. (WINDOWS+full stop). Press TAB to move to the categories, select a category then press enter. Press SHIFT+TAB to move to the list of emoji for that category, use the arrows to move between the available emoji and enter to insert the current emoji into text. Press escape when done.
es: La ventana Emoji de Windows 10 es accesible. Pulsa WINDOWS+. (WINDOWS+punto). Pulsa TAB para moverte a las categorías, selecciona una categoría y luego pulsa Intro. Pulsa SHIFT+TAB para moverte a través de la lista de emojis para esa categoría, usa las flechas para moverte entre los emojis disponibles e Intro para insertar el emoji actual en el texto. Pulsa escape cuando hayas terminado.

source: ### Touch cursor
es: ### Cursor táctil

source: In JAWS 15 or later, you can use numpad keys to navigate apps using a tree-like structure, similar to how users of smartphone screen readers such as VoiceOver would navigate touchscreens. in NVDA, object navigation and object mode touch commands can be used for this purpose
es: En JAWS 15 o posterior, puedes utilizar las teclas del teclado numérico para navegar por las aplicaciones utilizando una estructura parecida a un árbol, similar a la forma en que los usuarios de los lectores de pantalla de teléfonos inteligentes (smartphones) como VoiceOver navegarían por pantallas táctiles. En NVDA, las órdenes de navegación de objetos y de modo objeto táctil se pueden utilizar con este fin

source: ## Virtual Cursor
es: ## Cursor virtual

source: The virtual cursor in NVDA is known as browse mode. It functions in much the same way as JAWS, giving you access to navigation quick keys, or in NVDA speak, single letter navigation.
es: El cursor virtual es conocido como "modo exploración". En gran parte funciona como en JAWS, ofreciéndote acceso a teclas rápidas de navegación o, en el lenguaje de NVDA, "navegación con una sola letra".

source: Following are some common issues you may encounter when browsing the web with NVDA for the first time, and how to address them.
es: A continuación se enumeran algunos problemas comunes que puedes encontrar al navegar por la web con NVDA por primera vez y cómo solucionarlos.

source: ### Why Is Everything On One Line?
es: ### ¿Por qué está todo en una línea?

source: In case you are unaware, JAWS has two modes for displaying webpages or other documents using the virtual cursor; simple layout and screen layout. Simple layout is the default, which displays content in a linear fashion - putting each link or control on its own line. Screen layout formats the content similar to how it's displayed on screen.
es: Por si no lo sabías, JAWS tiene dos modos de mostrar páginas web u otros documentos usando el cursor virtual: Diseño simple y diseño de pantalla. El diseño simple se establece por defecto, y muestra el contenido de una forma lineal -colocando cada enlace o control en su propia línea. El diseño de pantalla distribuye el contenido de manera semejante a cómo aparece en pantalla.

source: The default in NVDA is screen layout, but you can easily switch to its version of simple layout by pressing NVDA+V while in browse mode. This will turn Screen layout off. Be sure to save your configuration after making this change with NVDA+CTRL+c.
es: La opción por defecto en NVDA es "Diseño de pantalla", pero puedes cambiar fácilmente a su versión de diseño simple pulsando NVDA+v mientras estés en modo exploración. Esto desactivará el "diseño de pantalla". Asegúrate de guardar tu configuración con NVDA+control+c después de hacer este cambio.

source: ### It Keeps Saying Clickable Clickable Clickable.
es: ### Sigue diciendo Cliqueable Cliqueable Cliqueable.

source: While reading webpages, you might notice sometimes that NVDA says "clickable", even multiple times on the same link or control.
es: Durante la lectura de páginas web, podrías notar que NVDA dice "cliqueable", a veces con demasiada frecuencia, incluso varias veces en el mismo enlace o control.

source: As of version 2018.4 and later, NvDA will now only say clickable once, so if you experience this issue, please upgrade your copy. Because there is no cost associated with upgrading, NV Access recommends always using the latest stable release of NVDA.
es: A partir de la versión 2018.4 y posteriores, NVDA ahora solo dirá cliqueable una vez, por lo que, si experimentas este problema, actualiza tu copia. Debido a que no hay ningún costo asociado con la actualización, NV Access recomienda usar siempre la última versión estable de NVDA.

source: You can also turn off the announcement of clickable elements entirely by going to document formatting in settings (NVDA+control+d) and unchecking "clickable" in the elements group.
es: También puedes desactivar el anunciado del elemento cliqueable completamente yendo a las opciones de Formateado de documentos (NVDA+control+d), y desmarcando la casilla "cliqueable" en el grupo de elementos.

source: ### Find doesn't work on the web.
es: ### La búsqueda no funciona en la web.

source: While JAWS is loaded, pressing ctrl+f in Internet Explorer or Firefox brings up the JAWS Find dialogue rather than activating the browser's built-in find command. This is to allow you to search for text using the virtual cursor. The regular find command will search for the next occurrence of the entered text, but will not move the virtual cursor to that location. This is due to how screen readers interact with web pages.
es: Mientras JAWS está cargado, la pulsación de ctrl+f en Internet Explorer o Firefox abre el cuadro de diálogo Buscar de JAWS, en vez de activar la instrucción de búsqueda nativa del navegador. Esto es para permitirte buscar texto empleando el cursor virtual. La instrucción de búsqueda convencional buscará la siguiente coincidencia del texto introducido, pero no desplazará el cursor virtual a esa ubicación. Esto se debe al modo en que los lectores de pantalla interactúan con las páginas web.

source: NVDA has its own find command to search in browse mode, but it has not been tied to CTRL+F, so pressing that shortcut key calls up the browser's find command, hence find not working as expected.
es: NVDA tiene su propia orden para buscar en el modo exploración, pero no ha sido asociada a ctrl+f, de modo que al pulsar ese atajo de teclado se invoca la instrucción de búsqueda del navegador, por lo que la búsqueda no funcionará como se espera.

source: To bring up NVDA's find dialogue, press ctrl+NVDA+F. Type in what you wish to find then press enter.
es: Para abrir el cuadro de diálogo buscar de NVDA, pulsa ctrl+NVDA+F. Escribe el texto que deseas encontrar y a continuación pulsa Intro.

source: ### No commands to view forms and headings?
es: ### ¿No hay órdenes para ver formularios y encabezados?

source: In JAWS, you can press JAWS+F5 to list forms, JAWS+F6 to list headings and JAWS+F7 to list links. In NVDA, the latter two have been combined into an elements list dialog, and you can access it by pressing NVDA+F7. You can then press ALT+H to select Headings (the default), ALT+F for form field, ALT+B for buttons and ALT+D for landmarks.
es: En JAWS, puedes pulsar JAWS+F5 para listar campos de formulario, JAWS+F6 para listar encabezados y JAWS+F7 para listar enlaces. En NVDA, todo esto se ha combinado en un diálogo de lista de elementos, y se puede acceder a él presionando NVDA+F7.

source: ## Forms Mode
es: ## Modo formularios

source: The equivalent of forms mode in NVDA is focus mode, and it behaves very similar to JAWS, Even switching modes automatically when navigating through a webpage. It will play a sound alerting you to which mode you are in. If desired, NVDA can speak the mode change rather than use a sound.
es: Lo equivalente al Modo formularios, en NVDA es Modo foco y se comporta de una forma muy similar a JAWS, incluso cambiando automáticamente entre modos de navegación al desplazarte por una página web. Se reproducirá un sonido para informarte sobre el modo en el que te encuentras. Si lo deseas, NVDA puede verbalizar el cambio de modo en lugar de usar un sonido.

source: Details about Focus Mode can be found in the user guide.
es: Los detalles acerca del "modo foco" se explican en la guía del usuario.

source: ## NVDA talks too much.
es: ## NVDA habla demasiado.

source: Sometimes you may find that NVDA can seem overly verbose, particularly in some list views. This is because as far as NVDA is concerned, list views are tables. NVDA is configured by default to announce each column or row header.
es: En ocasiones puede parecerte que NVDA es demasiado prolijo en sus verbalizaciones, particularmente en algunas listas de elementos. Esto sucede porque, en lo que a NVDA respecta, las listas de elementos son tablas. Por defecto NVDA está configurado para indicar los encabezados de cada fila o columna.

source: To turn that option off, uncheck "Report table row/column headers" in the "Document Formatting" screen of NVDA's settings dialogue. Press NVDA+control+d to open this setting screen.
es: Para desactivar esta opción, desmarca la casilla "Anunciar encabezados de fila/columna de tabla" en el cuadro de diálogo "Formateado de documentos" en las opciones de NVDA. Pulsa NVDA+control+d para abrir este cuadro de diálogo de Opciones.

source: ## the Speech dictionary
es: ## Diccionarios del Habla

source: NVDA has always included a function to edit "Speech Dictionaries", which are similar to JAWS' dictionary manager files. There is a group of radio buttons in the Add/edit dictionary entry labelled type, which determines how the text in the pattern, (NVDA speak for actual word), box will be treated.
es: NVDA siempre ha incluido una función para editar "Diccionarios del habla", que son similares a los archivos del asistente de diccionarios de JAWS. Hay un grupo de botones de opción en Añadir/editar entrada de diccionario (con la etiqueta Tipo), que determina cómo se tratará el texto del cuadro patrón (como NVDA se refiere a palabra real).

source: * anywhere, which is the default behavior.
es: * En cualquier sitio, que es el comportamiento por defecto.

source: * Whole word, which is how JAWS handles dictionary entries.
es: * Palabra completa, que es cómo JAWS maneja las entradas de diccionario.

source: * Regular Expression, which is complicated.
es: * Expresión regular, lo cual es complicado.

source: You will also find a case sensitive checkbox.
es: También encontrarás una casilla de verificación "sensible a las mayúsculas".

source: Access the speech dictionaries with NVDA+n (to open the NVDA menu), then P for preferences, then D for dictionaries. There are three options. Default dictionary works across the board, Voice dictionary works only for the current voice, and temporary works only for the current session. Unless you know you want one of the other two, most of the time "default dictionary" is the desired dictionary to edit.
es: Accede a los Diccionarios del habla con NVDA+n (para abrir el menú NVDA), luego P para Preferencias, luego D para Diccionarios. Hay tres opciones. El diccionario Predeterminado funciona en todas las voces, el diccionario Voz solo funciona para la voz actual y el diccionario Temporal funciona en todas las voces, pero sólo para la sesión actual. Al menos que sepas que deseas uno de los otros dos, la mayoría de las veces el "diccionario predeterminado" es el diccionario deseado para editar.

source: Like JAWS, scripts can be added to NVDA to provide support for other applications or to add new features that can be accessed from anywhere. These script packages are called NVDA Add-ons. You can find add-ons on the [NVDA Community Add-ons page](http://addons.nvda-project.org/).
es: Como en JAWS, es posible añadir scripts para mejorar la experiencia en otras aplicaciones, o para proporcionar características disponibles desde cualquier lugar. Estos paquetes de scripts se llaman "complementos de NVDA". Puedes encontrar complementos en el [sitio Web de complementos de la comunidad de NVDA](http://addons.nvda-project.org/).

source: These include a few that emulate JAWS features not currently present in NVDA such as a system tray list, virtualise window function and ability to append text to clipboard. Scripts for popular applications such as GoldWave are also available. The user guide has details on installing add-ons, and you can read help documentation that comes with each add-on to learn more about how to use the add-on.
es: Estos incluyen unos pocos que emulan características no incorporadas actualmente en NVDA, como una lista de iconos correspondientes a la bandeja del sistema, la función de "virtualizar ventana" o la posibilidad de añadir texto al portapapeles. También están disponibles scripts para aplicaciones populares tales como GoldWave. La guía del usuario contiene información sobre la instalación de complementos, y puedes leer documentación de ayuda que viene con cada complemento para aprender más sobre cómo utilizarlo.

source: There is an [NVDA Developer Guide](https://www.nvaccess.org/files/nvda/documentation/developerGuide.html) with information on how to create add-ons.
es: El siguiente enlace lleva a la [Guía de desarrolladores de NVDA (en inglés)](https://www.nvaccess.org/files/nvda/documentation/developerGuide.html) con información sobre cómo crear complementos.

source: ## Screen Shade
es: ## Cubrepantallas

source: From version 2019.3, NVDA includes an equivalent to JAWS' Screen Shade feature called Screen Curtain, which will blacken the screen. By default it is not assigned to a keystroke, but you can assign one from the input gestures dialogue. See the users guide for details on how to do this.
es: Desde la versión 2019.3, NVDA incluye una función equivalente al cubrepantallas de Jaws, llamada cortina de pantalla, que oscurecerá la pantalla. Por defecto no tiene un atajo de teclado asignado, pero se puede asignar uno desde el diálogo Gestos de entrada. Consulta la guía de usuario para obtener más detalles sobre cómo hacerlo.

source: Activating the command once will enable or disable the screen curtain until you restart your computer, whereas doing so twice quickly will enable it permanently until you disable it. You can also toggle it in the vision category in Settings.
es: Al pulsar la orden una vez se activará o desactivará la cortina de pantalla hasta que se reinicie el ordenador, mientras que si se pulsa dos veces rápidamente se activará de forma permanente hasta que sea desactivada. También se puede conmutar su estado en la categoría Visión en las opciones.

source: ## Remote access
es: ## Acceso Remoto

source: In 2015, Christopher Toth and Tyler Spivey released a free add-on to allow NVDA users to provide remote support, similar to JAWS Tandem. To learn more about this add-on, go to the [NVDA Remote site](http://www.nvdaremote.com).
es: En 2015, Christopher Toth y Tyler Spivey lanzaron un complemento gratuito para permitir a los usuarios de NVDA proporcionar un apoyo a distancia similar al Tamdem de JAWS. Para aprender más sobre el complemento, por favor consulta [la página de inicio de NVDA Remote](http://www.nvdaremote.com).

source: ## Application-specific settings
es: ## Configuración de una aplicación en particular

source: NVDA can use configuration profiles, which make it possible to configure certain settings to be applied only when using a program. This is done by creating an app-specific configuration profile. To create an app-specific profile, open the Configuration Profiles dialogue while using the app in question. To open the dialogue, hit NVDA+N, to bring up the NVDA menu. arrow down until you hear configuration profiles and press enter, or press NVDA+control+P.
es: NVDA puede usar perfiles de configuración y es posible configurar ciertas opciones que se aplicarán al utilizar un programa. Esto se hace creando un perfil de configuración para una aplicación en particular. Para crear un perfil de configuración para una aplicación en particular, abre el cuadro de diálogo Perfiles de Configuración mientras utilizas la aplicación en cuestión. Para abrir el cuadro de diálogo, pulsa NVDA+N para que aparezca el menú NVDA, flecha abajo hasta que oigas Perfiles de Configuración y pulsa Intro, o pulsa NVDA+control+P.

source: When the dialogue opens, select New, and select "current application" when asked when to use this profile. Any changes made to NVDA settings (eg synthesizer, speech rate or punctuation level) are applied to this profile.
es: Cuando se abre el cuadro de diálogo, selecciona Nuevo, y selecciona "Aplicación actual" cuando se te pregunte cuándo utilizar este perfil. Cualquier cambio realizado en la configuración de NVDA (por ejemplo, sintetizador, velocidad de voz o nivel de puntuación) se aplica a este perfil.

source: ### Alternate say all
es: ### Alterna Verbalizar todo
