Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/Translating.po
Languages: es

source: # NVDA Translation and Localization
es: # Traducción y localización de NVDA

source: Thank you for considering to localize NVDA to your language, or improving an existing translation.
es: Gracias por plantearte mejorar alguna traducción de NVDA o llevar NVDA a tu idioma.

source: In order to support multiple languages/locales, NVDA must be translated and data specific to the locale must be provided.
es: A fin de soportar diferentes idiomas/hablas locales, NVDA debe traducirse y deben proporcionarse datos específicos para el idioma al que se traduce.

source: There are several tasks to be done, and this document hopes to give you an overview and guide you through the process.
es: Hay varias tareas que hay que realizar, y este documento pretende proporcionar una vista general y guiar a través del proceso.

source: ## Translation Mailing List
es: ## Lista de correo de traducciones

source: Translators should subscribe to the [NVDA translations mailing list](https://groups.io/g/nvda-translations)
es: Los traductores deberían suscribirse a la [lista de correo de traducciones de NVDA](https://groups.io/g/nvda-translations)

source: hosted at Groups.IO.
es: hospedada en Groups.IO.

source: It is an English low traffic list devoted for the discussion of translation.
es: Esta es una lista en inglés de bajo tráfico ideada para hablar sobre traducciones.

source: Important messages that relate to translators will also be sent here, i.e. before official NVDA releases, to remind translators to make sure their localization is up to date.
es: También se enviarán aquí mensajes importantes relacionados con los traductores, por ejemplo, antes de liberaciones oficiales de NVDA, para recordar a los traductores que verifiquen si su traducción está actualizada.

source: ## Important Dates
es: ## Fechas importantes

source: Translators should ensure their translation is up to date by (UTC 00:00 on 14 February, 14 May, 14 August and 14 November) in order for it to be included in the upcoming final release, with this being delayed up to three days for some releases. Work submitted after this time will not be included in the upcoming release. A reminder will be sent three to five days prior to end of this period. For further information please see the ReleaseProcess page.
es: Los traductores deberían asegurarse de que sus traducciones están actualizadas a las 00.00h UTC de los días 14 de febrero, mayo, agosto y noviembre para que éstas se incluyan en la liberación oficial próxima. Este límite se retrasa hasta 3 días en algunas liberaciones. Cualquier trabajo enviado después de esta fecha no será incluido en la versión próxima. Se enviará un recordatorio a la lista de traducciones desde 3 hasta 5 días antes del evento. Para mayor información, visita la página sobre elProceso de Liberación (sección documentación para desarrolladores).

source: ## Translation Status
es: ## Estado de las traducciones

source: Status for existing NVDA localizations are provided below. If you would like to improve or would like to work on a new language, please write to the NVDA translations email list.
es: Se puede acceder al estado de las traducciones existentes de NVDA en la tabla siguiente. Si quieres mejorar una traducción existente o trabajar en un nuevo idioma, escribe a la lista de correo de traducciones de NVDA.

source: Information updated as of August 2021 (2021.1).
es: Información actualizada en agosto de 2021 (2021.1).

source: When 2021.1 is listed in the last updated column, it means that the localization is fully up to date and is ready for the current release. For the purposes of the information below, "up to date" refers to interface translation of at least 98%.
es: Cuando se indica 2021.1 en la columna Actualizada por última vez, significa que la traducción está completamente actualizada y lista para ser incluida en la próxima liberación. A los efectos de esta tabla, se entiende por “actualizada” una traducción con, como mínimo, el 98% de la interfaz traducida.

source: | Language | Status | Last updated |
es: | Idioma | Estado | Actualizada por última vez |

source: | af_ZA: Afrikaans | out of date, maintainer needed, barely translated. | Oct 2009 |
es: | af_ZA: africano | Incompleta / obsoleta, se necesita un responsable. Apenas traducido. | Oct 2009 |

source: | am: Amharic | out of date, maintainer needed, barely translated. | Jul 2012 |
es: | am: amárico | Incompleta / obsoleta, se necesita un responsable. Apenas traducido. | Jul 2012 |

source: | an: Aragonese | up to date. | 2021.1 |
es: | an: aragonés | Actualizada. | 2021.1 |

source: | ar: Arabic | Up to date. | 2021.1 |
es: | ar: árabe | Actualizada. | 2021.1 |

source: | bg: Bulgarian | Up to date. | 2021.1 |
es: | bg: búlgaro | Actualizada. | 2021.1 |

source: | CA: Catalan | Work in progress. | 2018.4 |
es: | CA: catalán | En progreso. | 2018.4 |

source: | CKB: Central Kurdish | Maintainer needed, hasn't begun. | n.a. |
es: | CKB: curdo central | Se necesita un responsable, todavía sin comenzar. | n.a. |

source: | cs: Czech | Up to date, Documentation incomplete (Sept 2017). | 2021.1 |
es: | cs: Checo | Actualizada, documentación incompleta (Septiembre 2017). | 2021.1 |

source: | da: Danish | Up to date. | 2021.1 |
es: | da: danés | Actualizada. | 2021.1 |

source: | de: German | Up to date. | 2021.1 |
es: | de: alemán | Actualizada. | 2021.1 |

source: | de_CH: Swiss German | work in progress. | 2018.3 |
es: | de_CH: alemán de Suiza | En progreso. | 2018.3 |

source: | el: Greek | Up to date, Documentation incomplete (Sep 2017). | 2021.1 |
es: | el: Griego | Actualizada, documentación incompleta (Sep iembre 2017). | 2021.1 |

source: | es: Spanish | Up to date. | 2021.1 |
es: | es: español | Actualizada. | 2021.1 |

source: | es_CO: Spanish (Columbia) | translation Out of date, maintainer needed. | Jun 2020 |
es: | es_CO: Español (Colombia) | Obsoleta, se necesita un responsable. | Junio de 2020 |

source: | Et: Estonian | started translation of interface | Apr 2021 |
es: | Et: Estonio | iniciada traducción de la interfaz | Abril 2021 |

source: | fa: Farsi | Up to date | 2021.1 |
es: | fa: Farsi | Actualizada | 2021.1 |

source: | fi: Finnish | Up to date. | 2021.1 |
es: | fi: finés | Actualizada. | 2021.1 |

source: | fr: French | Up to date. | 2021.1 |
es: | fr: francés | Actualizada. | 2021.1 |

source: | ga: Gaeilge (Ireland) | work in progress. | Jun 2021 |
es: | ga: gaélico (Irlanda) | En progreso. | junio de 2021 |

source: | gl: Galician | Up to date. | 2021.1 |
es: | gl: gallego | Actualizada. | 2021.1 |

source: | he: Hebrew | Up to date. Documentation incomplete (Oct 2018). | 2021.1 |
es: | he: Hebreo | Actualizada, documentación incompleta (febrero 2018). | 2021.1 |

source: | hi: Hindi | Work in progress, documentation missing. | Mar 2021 |
es: | hi: Hindú | En progreso, falta la documentación. | marzo de 2021 |

source: | hr: Croatian | Up to date. | 2021.1 |
es: | hr: croata | Actualizada. | 2021.1 |

source: | hu: Hungarian | Work in progress. | 2020.4 |
es: | hu: Húngaro | En progreso. | 2020.4 |

source: | is: Icelandic | out of date, maintainer needed. | Apr 2013 |
es: | is: islandés | Obsoleta, se necesita un responsable. | Abril 2013 |

source: | it: Italian | Up to date. | 2021.1 |
es: | it: italiano | Actualizada. | 2021.1 |

source: | ja: Japanese | Up to date. | 2021.1 |
es: | ja: japonés | Actualizada. | 2021.1 |

source: | ka: Georgian | out of date, maintainer needed. | May 2015 |
es: | ka: georgiano | Obsoleta, se necesita un responsable. | Mayo 2015 |

source: | kk: Kazakh | out of date, maintainer needed, barely translated. | n/a |
es: | kk: cazajo | Obsoleta, se necesita responsable. Apenas traducido. | n.a |

source: | kmr: Northern Kurdish | Out of date, maintainer needed. | Dec 2018 |
es: | kmr: Curdo del norte | Obsoleta, se necesita un responsable. | diciembre de 2018 |

source: | kn: Kannada | Out of date, maintainer needed. | Sept 2015 |
es: | kn: canarés | Obsoleta, se necesita un responsable. | septiembre de 2015 |

source: | ko: Korean | Up to date, | 2021.1 |
es: | ko: coreano | Actualizada. | 2021.1 |

source: | ky: Kyrgyz | Work in progress. | 2018.3 |
es: | ky: kirguís | En progreso. | 2018.3 |

source: | lt: Lithuanian | Out of date, maintainer needed. | 2016 |
es: | lt: lituano | Obsoleta, se necesita un responsable. | 2016 |

source: | lv: Latvian | Out of date, maintainer needed. | 2016 |
es: | lv: letón | Obsoleta, se necesita un responsable. | 2016 |

source: | mk: Macedonian | Interface: Up to date. Documentation: Work in progress.. | 2021.1 |
es: | mk: macedonio | Interfaz: actualizada. Documentación: en progreso. | 2021.1 |

source: | mn: Mongolian | Work in progress. | Jul 2019 |
es: | mn: mongol | En progreso. | julio de 2019 |

source: | my: Burmese | Work in Progress. | August 2018 |
es: | my: birmano | En progreso. | agosto de 2018 |

source: | nb_NO: Norwegian | Out of date. | 2015 |
es: | nb_NO: noruego | Obsoleta. | 2015 |

source: | ne: Nepali | Out of date, maintainer needed. | 2016 |
es: | ne: Nepalí | Obsoleta, se necesita responsable. | 2016 |

source: | nl: Dutch | Up to date. | 2021.1 |
es: | nl: holandés | Actualizada. | 2021.1 |

source: | Pa: Punjabi | Out of date, maintainer needed. | Nov 2014 |
es: | Pa: punyabí | Obsoleta, se necesita responsable. | Noviembre 2014 |

source: | pl: Polish | Up to date. | 2021.1 |
es: | pl: polaco | Actualizada. | 2021.1 |

source: | pt_BR: Portuguese (Brazil) | Up to date. | 2021.1 |
es: | pt_BR: portugués (Brasil) | Actualizada. | 2021.1 |

source: | pt_PT: Portuguese (Portugal) | Up to date. | 2021.1 |
es: | pt_PT: portugués (Portugal) | Actualizada. | 2021.1 |

source: | ro: Romanian | Up to date. | 2021.1 |
es: | ro: rumano | Actualizada. | 2021.1 |

source: | ru: Russian | Up to date. | 2021.1 |
es: | ru: ruso | Actualizada. | 2021.1 |

source: | sk: Slovak | Up to date. | 2021.1 |
es: | sk: Eslovaco | Actualizada. | 2021.1 |

source: | sl: Slovenian | Up to date. | 2021.1 |
es: | sl: esloveno | Actualizada. | 2021.1 |

source: | so: somali | Out of Date, maintainer needed. | Feb 2019 |
es: | so: somalí | Obsoleta, se necesita responsable. | Febrero de 2019 |

source: | sr: Serbian | Up to date. | 2021.1 |
es: | sr: Serbio | Actualizada. | 2021.1 |

source: | sv: Swedish | out of date, maintainer needed. | May 2015 |
es: | sv: Sueco | Obsoleta, se necesita responsable. | Mayo de 2015 |

source: | ta: Tamil | Up to date. | 2021.1 |
es: | ta: Tamil | Actualizada. | 2021.1 |

source: | th: Tai | Out of date, maintainer needed, barely translated. | Feb 2011 |
es: | th: tailandés | Obsoleta, se necesita responsable. Apenas traducido. | Febrero 2011 |

source: | tr: Turkish | Up to date. | 2021.1 |
es: | tr: turco | Actualizada. | 2021.1 |

source: | uk: Ukranian | Up to date. | 2021.1 |
es: | uk: ucraniano | Actualizada. | 2021.1 |

source: | ur: Urdu | Out of date, maintainer needed, barely translated.| 2016 |
es: | ur: urdu | incompleta, se necesita responsable. Apenas traducido. | 2016 |

source: | vi: Vietnamese | Up to date. | 2021.1 |
es: | vi: Vietnamita | Actualizada. | 2021.1 |

source: | zh_CN: Simplified Chinese | Up to date. | 2021.1 |
es: | zh_CN: Chino simplificado | Actualizada. | 2021.1 |

source: | zh_HK: Traditional Chinese Hong Kong | Up to date, Documentation missing. | 2021.1 |
es: | zh_HK: chino tradicional de Hong Kong | Actualizada, falta la documentación. | 2021.1 |

source: | zh_TW: Traditional Chinese Taiwan | Up to date. | 2021.1 |
es: | zh_TW: Chino tradicional de Taiguán | Actualizada. | 2021.1 |

source: | kh: Traditional Khmer Cambodia | Starting, no files submitted | 2020.1 |
es: | kh: Khmer tradicional de Camboya | Comenzando, no se han enviado archivos | 2020.1 |

source: ## New Localization
es: ## Nueva traducción

source: Start by subscribing to the translation list above, so that you can get help and advice.
es: Empieza por suscribirte a la lista de traducciones arriba, de forma que puedas obtener ayuda y consejos.

source: It is recommended that you use our new more automated workflow, which will allow you to focus only on translation. See [the automated workflow section](#advantages-of-the-automatic-workflow-process ) below.
es: Se recomienda que uses el nuevo flujo de trabajo automático de NVDA, que te permite centrarte solo en traducir. Consulta la sección “Método de trabajo automático” más abajo.

source: If you still wish to go through the manual process, then follow the instructions on the [[TranslatingUsingManualProcess]] page after first reading [Files to be Localized](#files-to-be-localized) below.
es: Si aun así deseas continuar utilizando el proceso manual, lee la página “Traduciendo usando el proceso manual” enlazada en la parte inferior de este artículo después de leer [la sección “Archivos para ser traducidos”](#infopmanual).

source: ## Improving an Existing Localization
es: ## Mejorar una traducción existente

source: You should contact the existing maintainer of your language, and discuss your suggestions and changes. Together you should be able to agree on the best translation and terms to be used, and the necessary changes can be made.
es: Deberías contactar al responsable de la traducción en tu idioma y discutir con él tus sugerencias o cambios. Juntos deberíais ser capaces de poneros de acuerdo acerca de la mejor traducción y los términos que usar, de forma que se pueda proceder a la realización de los cambios oportunos.

source: You can send an email to the translation mailing list to find out the correct person.
es: Puedes enviar un correo a la lista de traducciones para encontrar a la persona correcta.

source: If your language is no longer maintained, you can request to be the new maintainer for the language.
es: Si tu idioma ya no tiene mantenimiento, puedes solicitar ser el nuevo traductor para esa lengua.

source: ## Files to be Localized
es: ## Archivos a ser traducidos

source: These files are listed in order of importance.
es: Los archivos se listan por orden de importancia.

source: - nvda.po: NVDA's interface messages, see [[TranslatingTheInterface]] page for more info.
es: - nvda.po: mensajes de la interfaz de NVDA, consulta la página “Traduciendo la interfaz” enlazada abajo para más información.

source: - characterDescriptions.dic: names of characters in your language, see [[TranslatingCharacterDescriptions]] for more info.
es: - characterDescriptions.dic: nombres de los caracteres en tu idioma. Consulta la página “Traduciendo descripciones de caracteres” enlazada abajo para más información.

source: - symbols.dic: names of symbols and punctuation in your language, see [[TranslatingSymbols]] for more information.
es: - symbols.dic: Nombres de los símbolos y signos de puntuación en tu idioma. Consulta la página “Traduciendo símbolos” enlazada abajo para más información.

source: - gestures.ini: remapping of gestures for your language, see [[TranslatingGestures]] for more information.
es: - gestures.ini: reasignación de gestos para tu idioma. Visita la página "Traducción de gestos" enlazada más abajo para más información.

source: - userGuide.t2t: the User Guide, see [[TranslatingUserGuide]] for more information.
es: - userGuide.t2t: La guía del usuario. Consulta la página “Traduciendo la guía del usuario” enlazada abajo para más información.

source: - changes.t2t (optional): a list of changes between releases, see [[TranslatingChanges]] for more information.
es: - changes.t2t (opcional): lista de cambios entre las diferentes versiones. Consulta la página “traduciendo registro de cambios” enlazada abajo para más información.

source: - Add-ons (optional): a set of optional features that users can install, see [[TranslatingAddons]] for more information.
es: - Complementos (opcional): un conjunto de características que los usuarios pueden instalar. Consulta la página “Traduciendo complementos” enlazada abajo para más información.

source: ## Advantages of the Automatic Workflow Process
es: ## Ventajas del método de trabajo automático

source: - No need of a full NVDA development environment.
es: - No es necesario un entorno de desarrollo completo de NVDA.

source: - You will be sent an email or twitter message when your po file needs updating.
es: - Recibirás un correo electrónico o un mensaje en Twitter cuando tengas que actualizar tus archivos .po.

source: - You will be sent an email or twitter message when your userGuide or changes file needs to be updated.
es: - Recibirás un correo electrónico o un mensaje en Twitter cuando los archivos de la guía del usuario o el registro de cambios tengan que actualizarse.

source: - Automatic generation of html from t2t files, so that you can check the correctness of your t2t markup.
es: - Generación automática de archivos HTML a partir de T2T, de forma que puedes verificar si la sintaxis T2T de tu traducción es correcta.

source: - Automatically generated difference and word difference between previous and new versions, to help you quickly find the changes.
es: - Generación automática de diferencia (diff) y diferencia por palabras entre la versión antigua y la nueva, de forma que puedas buscar rápidamente los cambios para traducirlos.

source: - A higher quality User Guide since the difference files encourage you to keep the English and your localization closely updated.
es: - Guía del usuario de alta calidad, ya que los archivos de diferencias te permiten tener tu traducción actualizada con mayor precisión con respecto a la versión inglesa.

source: - Translation becomes many small tasks instead a big rush near a deadline. Maybe 10 minutes per week on average.
es: - La traducción se convierte en un conjunto de pequeñas tareas en lugar deun gran trabajo cuando se acerca la fecha límite. De media unos 10 minutos a la semana.

source: - It is easier to contribute, since each work unit is self contained.
es: - Es fácil contribuir, debido a que cada unidad de trabajo es autónoma.

source: - Your translation is regularly and automatically included into NVDA snapshots.
es: - Tu traducción se incluye regular y automáticamente en las versiones de desarrollo de NVDA.

source: - Instead of following nvda-dev mailing list emails, you can just subscribe to nvda translations and important messages related to translation will be sent there.
es: - En lugar de seguir la lista de desarrollo de NVDA, puedes suscribirte al grupo de traducciones, donde se enviarán noticias importantes para los traductores.

source: - Auto generated structure difference between the English and your localized user guide, to quickly spot missing paragraphs, tables and lists.
es: - Se genera automáticamente una diferencia estructural entre las versiones inglesa y de tu idioma de la guía del usuario, de forma que puedes localizar y corregir párrafos, tablas o listas que falten.

source: - Automatic checking of po files, making sure that there are no mistakes that could cause any runtime errors.
es: - Verificación automática de los archivos po, para asegurarse de que no haya fallos que puedan generar errores en tiempo de ejecución.

source: If you want to follow the automatic workflow process, visit the [[TranslatingUsingAutomaticProcess]] page.
es: Si deseas usar el método de trabajo automático, consulta la página “Traduciendo mediante el método de trabajo automático” enlazada abajo.

source: ## Missing information
es: ## Información faltante

source: Please feel free to update this or any subsequent page with any tips or hints that you feel may be of use to other translators.
es: Siéntete libre de pedir que se actualice esta página o cualquiera subyacente con aquellos trucos y consejos que creas que pueden venir bien a los traductores.
