Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/Updating-eSpeak-NG.po
Languages: es

source: ### Background
es: ### Introducción

source: The main authority on build requirements should be `<nvda repo root>/include/espeak/Makefile.am`. The `*.vcxproj` files
es: La autoridad principal en requisitos de construcción debería ser `<raíz del repo de nvda>/include/espeak/Makefile.am`. Los archivos `*.vcxproj`

source: in `<nvda repo root>/include/espeak/src/windows/` can also be considered, however these are not always kept up to date.
es: en `<raíz del repo de nvda>/include/espeak/src/windows/` pueden tenerse también en cuenta. Sin embargo, no siempre se mantienen actualizados.

source: We dont use the auto make files or the visual studio files, we maintain our own method of building espeak. Modifications will need to be made in `<nvda repo root>/nvdaHelper/espeak`
es: NVAccess no usa los archivos de automake o los archivos de Visual Studio, ellos mantienen su propio método para construir Espeak. Las modificaciones tendrán que hacerse en `<raíz del repo de nvda>/nvdaHelper/espeak`

source: * `sconscript` for the build process.
es: * `sconscript` para el proceso de construcción.

source: * `config.h` to set the eSpeak-ng version that NVDA outputs to the log file.
es: * `config.h` para establecer la versión de eSpeak-NG que NVDA muestra en el archivo de registro.

source: ### Doing the update
es: ### Cómo hacer la actualización

source: 1. Start from a clean branch off of NVDA `master`
es: 1. Comienza desde una rama limpia de NVDA `master`

source: 1. Check out the latest NVDA `origin/master` and create a new branch.
es: 1. Haz checkout a la rama `origin/master` más reciente y crea una nueva rama.

source: 1. Do a git clean to ensure the working directory is clean.
es: 2. Ejecuta git clean para asegurarte de que el directorio de trabajo está limpio.

source: 1. Ensure submodules are up to date
es: 2. Asegúrate de que los submódulos están actualizados

source: 1. Synchronize submodules with `git submodule sync`
es: 1. Sincroniza los submódulos con `git submodule sync`

source: 1. Update submodules with `git submodule update --init --recursive`
es: 2. Actualiza los submódulos con `git submodule update --init --recursive`

source: 1. Checkout the new eSpeak-ng revision to try.
es: 3. Haz checkout en la nueva revisión de eSpeak-NG a probar.

source: 1. Change to the `include/espeak/` directory
es: 1. Navega al directorio `include/espeak/`

source: 1. Do `git fetch` to get the latest from the espeak-ng repo
es: 2. Haz `git fetch` para obtener lo último del repositorio de espeak-ng

source: 1. Do `git checkout origin/master` or whichever espeak-ng ref you wish.
es: 3. Haz `git checkout origin/master` o cualquier otra referencia de espeak-ng en la que estés interesado.

source: 1. Update our record of the version number and build.
es: 4. Actualiza el registro de versión de NVAccess y construye.

source: 1. Change back to the NVDA repo root
es: 1. Vuelve de nuevo a la raíz del repositorio de NVDA

source: 1. Update the package version in `<nvda repo root>/nvdaHelper/espeak/config.h` you can use `<nvda repo root>/include/espeak/src/windows/config.h` to double check this is what you expect.
es: 2. Actualiza la versión del paquete en `<raíz del repo de nvda>/nvdaHelper/espeak/config.h`. Puedes usar `<raíz del repo de nvda>/include/espeak/src/windows/config.h` para comprobar dos veces que es la versión que esperas.

source: 1. Do a build of NVDA
es: 3. Construye NVDA

source: 1. Run NVDA (set eSpeak-ng as the synthesizer) and test.
es: 5. Ejecuta NVDA (establece eSpeak-ng como sintetizador) y prueba.

source: 1. Ensure that the log file contains the new version number for eSpeak-NG
es: 6. Asegúrate de que el archivo de registro contiene el nuevo número de versión para eSpeak-NG

source: ### Troubleshooting
es: ### Resolución de problemas

source: If python crashes while building, check the log. If the last thing is compiling some dictionary try excluding it. This
es: Si Python falla durante la construcción, comprueba el registro. Si la última cosa que se hacía era compilar un diccionario, intenta excluirlo. Esto

source: can be done in `<nvda repo root>/nvdaHelper/espeak/sconscript`. Remember to report this to the eSpeak-ng project.
es: puede hacerse en `<raíz del repo de nvda>/nvdaHelper/espeak/sconscript`. Recuerda informar sobre el fallo al proyecto eSpeak-ng.

source: If the build fails, take note of the error, compare the diff of the `Makefile.am` file and mirror any changes in our `sconscript` file.
es: Si la construcción falla, toma nota del error, compara las diferencias con el archivo `makefile.am` y refleja cualquier cambio en el archivo `sconscript`.

source: ### Known issues
es: ### Problemas conocidos

source: Due to problems with emoji support (causing crashes), emoji dictionary files are being excluded from the build, they are deleted prior to compiling the dictionaries in the `<nvda repo root>/nvdaHelper/espeak/sconscript` file.
es: Debido a problemas con el soporte de emojis (que causaba errores fatales), los archivos de diccionarios de emojis se están excluyendo de la construcción, se eliminan antes de compilar los diccionarios en el archivo `<raíz del repo de nvda>/nvdaHelper/espeak/sconscript`.
