Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/w10addoninternals.po
Languages: es

source: * Settings and Store: for some controls (such as when downloading content from Store), a specific status control fires live region changed event. Unfortunately, the text for them are generic (for example, "downloading some percent" as opposed to announcing the product one is downloading), thus NVDA will locate information such as product names when this happens to make this easier to follow. Also, in Settings app, some controls in older versions of this app have no label, thus NVDA is told to look for labels to traversing sibling (next/previous) objects, and in case of certain Windows 10 1809 installations, the correct label is the name of the first child.
es: * Configuración y tienda: para algunos controles (como por ejemplo al descargar contenido de la tienda), un control de estado específico dispara el evento de región viva cambiada. Por desgracia, su texto es genérico (por ejemplo, "descargando algo por ciento", en lugar de verbalizar el producto que se está descargando), por lo que NVDA ubicará información como los nombres de producto cuando esto pase para hacer más fácil el seguimiento. También, en la aplicación de configuración, algunos controles en versiones más antiguas de la aplicación no tienen etiqueta, por lo que se pide a NVDA que busque etiquetas viajando por los objetos hermano (siguiente / anterior), y en el caso de ciertas instalaciones de la versión 1809 de Windows 10, la etiqueta correcta es el nombre del primer hijo.

source: ### A tale on app module and executable names
es: ### Un cuento sobre los nombres de ejecutables y módulos de aplicación

source: One of the side-effects of continuous delivery is appearance of unanticipated changes. This is more so when a workaround for an app broke simply because the name of the executable or the app has changed. In addition, some apps shipped with an executable whose name broke Python's module name and import routines.
es: Uno de los efectos colaterales de la entrega continua es la aparición de cambios no previstos con antelación. Este efecto es más notable cuando una solución para una aplicación se rompe simplemente porque el nombre del ejecutable o la aplicación ha cambiado. Además, algunas aplicaciones vinieron con un ejecutable cuyo nombre rompía los nombres de módulo de Python y los procedimientos de importación.

source: The specific issues encountered were:
es: Los problemas específicos que se encontraron fueron:

source: * Mail and Calendar, Maps, Modern Keyboard, Start menu, Windows Search and Store: executable names have changed throughout development of Windows 10 and later. For example, in May 2017, workarounds in place for Mail app broke when Microsoft renamed hxmail to hxoutlook, and in July 2019, Modern Keyboard was renamed to textinputhost. Windows 11 is no exception, bringing with it renamed Windows Search executable (searchhost). Due to this, aliasing (a new app module importing everything from an old version) is common.
es: * Correo y calendario, mapas, teclado moderno, menú Inicio, búsqueda de Windows y tienda: los nombres de los ejecutables han cambiado a lo largo del desarrollo de Windows 10 y posterior. Por ejemplo, en mayo de 2017, las soluciones para la aplicación de correo se rompieron cuando Microsoft cambió el nombre de hxmail a hxoutlook, y en julio de 2019, el teclado moderno se renombró a textinputhost. Windows 11 no es la excepción, al traer con él un ejecutable renombrado de Windows Search (searchhost). Por este motivo, es común la creación de alias (un módulo de aplicación que importa todo lo de otro módulo).

source: * MSN Weather, Store, modern keyboard and others: some executable names have a dot (.) in the middle, which breaks app module import routines. This is countered by replacing dots with underscores (_). For example, for Store, the actual executable name is winstore.app.exe, while the app module for this app is named winstore_app.py. This fix is now part of recent NVDA releases.
es: * MSN El tiempo, tienda, teclado moderno y otros: algunos nombres de ejecutable tienen un punto (.) a la mitad, que rompe los procedimientos de importación de módulos. Esto se soluciona reemplazando puntos por guiones bajos (_). Por ejemplo, para Tienda, el auténtico nombre del ejecutable es winstore.app.exe, mientras que su módulo de aplicación se llama winstore_app.py. Esta solución ya forma parte de las últimas versiones de NVDA.

source: ## Few remarks
es: ## Unas pocas notas

source: ### UIA performance
es: ### Rendimiento de UIA

source: Numerous issues were filed on NVDA's GitHub page regarding UIA performnace issues. These include issues in early days of Edge support where navigating the document was slow (resolved in NVDA 2017.2), list view issues in File Explorer while using a program with high CPU usage (GoldWave, for example, resolved in NVDA 2018.4) and so on. While some are specific to NVDA, others are reproducible while using Narrator, hence NV Access and Microsoft are actively collaborating on identifying and writing fixes for performance and control implementation problems (such as some of the ones listed above).
es: En la página de GitHub de NVDA se crearon bastantes incidencias relacionadas con problemas de rendimiento de UIA. Aquí se incluyen incidencias de los primeros días en los que se daba soporte a Edge en las que se decía que la navegación por el documento era lenta (resueltas en NVDA 2017.2), problemas en la vista de lista del explorador de archivos mientras se usaba un programa que consumía mucha CPU (GoldWave, por ejemplo, resuelto en NVDA 2018.4) y así sucesivamente. Mientras que algunos son específicos de NVDA, otros pueden reproducirse mientras se usa el narrador, por lo que NV Access y Microsoft están colaborando activamente para identificar y escribir correcciones para problemas de rendimiento e implementación de controles (como los que se han listado arriba).

source: ### Narrator is the new reference in screen reading in Windows 10 (and later) and universal apps
es: ### Narrador es la nueva referencia en lectura de pantalla en Windows 10 (y posterior) y las aplicaciones universales

source: Until a few years ago, any screen reader wishing to support an app or add features would look up to JAWS for Windows for guidance. This is no longer the case with Windows 10 (and later) and universal apps, as Narrator provides a useful yardstick (at least a base implementation other screen reader vendors should respond to) when it comes to reading text on screen, feature set for supporting universal apps, and investigate UIA issues. Some of the features discussed above, such as search suggestion notification, were inspired by Narrator's handling of various UIA events, and because Narrator reads what is told to read, NVDA ships with workarounds for odd UIA implementations to get around some poblems.
es: Hasta hace unos pocos años, cualquier lector de pantalla que quisiera dar soporte a una aplicación o añadir nuevas funciones utilizaba Jaws for Windows como guía. Ese ya no es el caso para Windows 10 (y posterior) y las aplicaciones universales, ya que Narrador proporciona un punto de referencia útil (al menos una implementación base a la que otros fabricantes de lectores de pantalla deberían responder) al leer texto en pantalla, un conjunto de características para dar soporte a las aplicaciones universales, e investigar problemas de UIA. Algunas de las características expuestas arriba, como la notificación de sugerencias de búsqueda, estuvieron inspiradas en la forma que tiene Narrador de manejar diversos eventos de UIA, y gracias a que Narrador lee lo que hay que leer, NVDA viene con soluciones para implementaciones UIA defectuosas para hacer frente a algunos problemas.

source: ### Add-on development and testing
es: ### Desarrollo y pruebas del complemento

source: The add-on employs iterative development cycle where features are continuously refined. Refinements can be driven by user feedback, changes from Windows Insider Preview builds and apps, or changes were made to NVDA that requires the add-on to support old and new code paths. Because the add-on employs continuous delivery model (stable versions can be released at any time), a stable version may contain features in various stages of development.
es: El complemento emplea ciclos de desarrollo iterativos donde se refinan las funciones continuamente. Los refinamientos pueden ser dirigidos por los comentarios de los usuarios, cambios en las compilaciones de Windows Insider y las aplicaciones, o cambios en NVDA que requieren que el complemento soporte nuevas y antiguas rutas de código. Como el complemento emplea un modelo de entrega continua (se pueden liberar versiones estables en cualquier momento), una versión estable puede contener funciones en diversos estados de desarrollo.

source: As part of add-on development and testing, one activity I perform is keep up with changes in Insider Preview builds, specifically changes in dev channel (formerly Windows Insider fast ring). Whenever new builds are released, I analyze new features described in release notes and see if user-visible changes are present. If so, I test new features and see how usable the feature is while using Narrator and NVDA. If I notice things are not working with NVDA, I perform debugging procedures such as analyzing UIA events to figure out how NVDA can better support a feature. This is done repeatedly until I'm satisfied that NVDA supports a given feature well. Examples of features that followed this route include emoji panel support, changes to Settings app interface, and reporting virtual desktop reordering operation. Note that even if a build does not come with spectacular changes, I still use it to look for small changes and fixes.
es: Como parte del desarrollo y las pruebas del complemento, una actividad que realizo es mantenerme al día con los cambios en las compilaciones Insider Preview, concretamente los cambios en el canal de desarrollo (anteriormente conocido como anillo rápido de Windows Insider). Siempre que se publican nuevas compilaciones, analizo las nuevas funciones descritas en las notas de versión y veo si hay presentes cambios visibles para el usuario. Si es así, pruebo las nuevas características y veo cómo de usables son mientras se usan Narrador y NVDA. Si descubro que algo no funciona con NVDA, realizo procedimientos de depuración como analizar los eventos UIA para hacerme una idea de cómo puede soportar NVDA mejor esa función. Hago esto repetidamente hasta que NVDA soporta la nueva característica bien. Ejemplos de funciones que han seguido esta ruta incluyen el panel de emojis, cambios en la interfaz de la aplicación Configuración, e informar de la operación de reordenar escritorios virtuales. Ten en cuenta que incluso si una compilación no viene con cambios espectaculares, aún la uso para buscar pequeños cambios y correcciones.

source: Because Windows ships with apps that can change without notice, apps can become another source of feature development. To support app changes, I note down differences between app releases and come up with a plan to support old and new releases. This becomes important if executables were renamed, in which case app aliasing is used to support old and new app releases. Examples include Mail and Calendar, modern keyboard, and Cortana.
es: Ya que Windows incorpora aplicaciones que pueden cambiar sin previo aviso, las aplicaciones pueden convertirse en otra fuente de desarrollo de funciones. Para soportar los cambios en aplicaciones, anoto las diferencias entre versiones de la aplicación y elaboro un plan para soportar las versiones antiguas y las nuevas. Esto se vuelve importante si los ejecutables se renombran, en cuyo caso se emplean alias de aplicaciones para soportar versiones nuevas y antiguas. Los ejemplos incluyen correo y calendario, el teclado moderno y Cortana.

source: Besides Windows and app changes, changes to NVDA such as incorporating support for a new Windows feature (scenario 1) or changes to apps (scenario 2) can contribute to feature changes. As described below, some add-on features became part of NVDA. If NV Access and contributors plan to incorporate features from this add-on, I assume it has been integrated and I edit the add-on source code to support old (not integrated) and new (integrated) code paths. These rely on presence of specific module attributes and do my best to let the add-on emulate features being reviewed. Once a version of NVDA with new features is released, the add-on is told to drop support for old NVDA versions with just integrated features not present. This route was taken to incorporate features such as emoji panel, search suggestions, Calculator support, and handling notification event.
es: Además de los cambios en Windows y las aplicaciones, los cambios a NVDA, tales como incorporar soporte para una nueva característica de Windows (escenario 1) o los cambios en aplicaciones (escenario 2) pueden contribuir a los cambios de funciones. Como se describe más abajo, algunas funciones del complemento se volvieron parte de NVDA. Si NV Access y los colaboradores planean incorporar funciones de este complemento, asumo que se han integrado y edito el código fuente del complemento para soportar las rutas de código antiguas (no integrado) y nuevas (integrado). Estas se apoyan en la presencia de atributos de módulo específicos y me esfuerzo para emular las características del complemento en revisión. Una vez que se libera una versión de NVDA con nuevas características, el complemento elimina el soporte para las versiones antiguas que no han integrado estas características. Esta ruta se tomó para incorporar características como el panel de emojis, sugerencias de búsqueda, soporte para la calculadora y manejo del evento de notificación.

source: From time to time, these changes are released as development snapshots. This is so that I can gather feedback from testers in hopes of refining changes. At least once a month, changes in development snapshots are sent to a branch used to prepare stable add-on releases, and a stable version is tagged a few days later once final changes such as latest localizations are integrated. The cycle then repeats.
es: De vez en cuándo, estos cambios se liberan en versiones de desarrollo. Esto se hace para poder recopilar comentarios de evaluadores con la esperanza de refinar los cambios. Al menos una vez al mes, los cambios en versiones de desarrollo se envían a una rama usada para preparar versiones estables del complemento, y se etiqueta la versión estable unos días después en cuanto se integran los últimos cambios, como las traducciones. Después, el ciclo se repite.

source: #### Changes in 2021
es: #### Cambios en 2021

source: One big change in 2021 is milestone-based development. It is still an iterative development process, but I decided to use a quarterly development cycle to isolate long-running features and to focus on other priorities. This is a result of life changes that will reduce add-on development commitments - to reduce focus on add-on maintenance in favor of early planning and initial development, focus on other priorities, and refine the add-on when I have time.
es: Un gran cambio en 2021 es el desarrollo basado en hitos. Aún sigue siendo un proceso de desarrollo iterativo, pero he decidido usar un ciclo de desarrollo trimestral para aislar funciones de larga duración y centrarme en otras prioridades. Este es el resultado de cambios en mi vida que reducirá mis compromisos con el desarrollo de complementos - reducir el foco en el mantenimiento de complementos en favor de planificación temprana y desarrollo inicial, centrarme en otras prioridades, y refinar el complemento cuando tenga tiempo.

source: The quarterly milestone process derives from Windows development milestones. As part of Windows development, Microsoft divides development phases into semesters. Each development semester is named according to a chemical element, specifically named after elements in the periodic table. This is done for Microsoft Azure, but also was adopted for Windows development recently and is designed to set milestones for long-running features. Near the end of a semester, Microsoft chooses features that will be part of the next release (either a full build or an enablement package) and creates a maintenance branch from these features, with others pushed to the next development semester for further refinements.
es: El proceso de desarrollo trimestral deriva de los hitos de desarrollo de Windows. Como parte del desarrollo de Windows, Microsoft divide las fases del desarrollo en semestres. Cada semestre de desarrollo se nombra en función de un elemento químico, concretamente nombrado así por los elementos en la tabla periódica. Esto se hace con Microsoft Azure, pero recientemente se ha adoptado también en el desarrollo de Windows, y se ha diseñado para establecer hitos para funciones de larga duración. Cuando se acerca el fin de un semestre, Microsoft selecciona funciones que formarán parte de la siguiente versión (ya sea una compilación completa o un paquete de características) y crea una rama de mantenimiento de estas funciones, siendo el resto enviado al siguiente semestre de desarrollo para futuros refinamientos.

source: The quarterly development cycle for Windows App Essentials (adopted in June 2021) is named after Windows development semesters, divided into two quarters or halves. For example, as of August 2021, the latest development cycle inside Microsoft is "nickel", and the internal development cycle for Windows App Essentials is "nickel1", scheduled for completion in September. Each quarter is dedicated to one or more long-running features or themes - for example, "nickel1" is dedicated to refining Windows 11 support and preparing the add-on for control types refactor from NVDA 2021.2. I tend to do a code sprint early and refine code as time goes on - as of August 2021, NVDA 2021.2 changes are housed inside a dedicated "prerelease" branch, which will become part of 'nickel1" proper once 2021.2 beta 1 is released and refined afterwards. Add-on feature evaluation such as removing redundant code paths is the tentative theme for "nickel2" which will run from September to December 2021, but as of August 2021, it is low in my priority compared to more immediate concerns, namely graduate school.
es: El ciclo trimestral de desarrollo de Windows App Essentials (adoptado por primera vez en junio de 2021) se nombra después de los semestres de desarrollo de Windows, dividido en dos cuartos o mitades. Por ejemplo, en agosto de 2021, el ciclo de desarrollo más reciente en Microsoft es "níquel", y el ciclo interno de desarrollo de Windows App Essentials es "níquel1", cuyo fin está programado para septiembre. Cada trimestre se dedica a una o más características de larga duración o temas. Por ejemplo, "níquel1" se dedica a refinar el soporte para Windows 11 y preparar el módulo para la refactorización de controlTypes de NVDA 2021.2. Tiendo a hacer un sprint de código pronto y refinarlo según pasa el tiempo. En agosto de 2021, los cambios de NVDA 2021.2 se alojan en una rama "prerelease" dedicada, que pasará a formar parte de "Níquel1" en cuanto se libere la beta 1 de NVDA 2021.2 y refinada posteriormente. La evaluación de funciones del complemento, así como la eliminación de rutas de código redundante, es el tema más plausible para "Níquel2", que se ejecutará entre septiembre y diciembre de 2021, pero en agosto de 2021 está bajo en mis prioridades en comparación con asuntos más inmediatos, como la escuela de posgrado.

source: In between milestone releases, a dedicated branch is used to backport key changes from the upcoming quarter. These are initially named after a chemical compound or an alloy involving the base element which is the base for the backport branch. For example, a branch named "alnico" (an alloy of aluminum, nickel, and cobalt) is used to backport key changes from "nickel2" to "nickel1" branch. These serve not only as maintenance branches, but also introduce features that will be part of the next milestone release provided that they do not involve massive rewrites such as requiring newer NVDA or Windows releases. Eventually the "alloy" branches are merged into milestone branches such as "nickel1".
es: Entre las liberaciones por hitos, se usa una rama dedicada para traer cambios clave del siguiente trimestre. Estos adquieren el nombre de un compuesto químico o una aleación que involucra el elemento que constituye la base de la rama con el cambio que se trae. Por ejemplo, una rama llamada "alnico" (una aleación de aluminio, níquel y cobalto) se usa para llevar cambios clave desde "níquel2" a la rama "níquel1". Sirven no sólo como ramas de mantenimiento, sino también para introducir funciones que serán parte de la siguiente versión basada en hito, siempre que no implique reescrituras masivas, como la necesidad de versiones de Windows o NVDA más recientes. Eventualmente, las ramas "aleación" se fusionan con las ramas de hitos como "níquel1".

source: The whole point of development milestone/quarter process is to remind me of life priorities. In the past, I was able to dedicate more time to add-on development and maintenance. As time went on, it became important to think about my immediate life concerns such as focusing more on advanced education. Besides, I have been looking for a way to reimagine add-on development cycles, so in June 2021, I decided to switch stable version development from more of a continuous delivery to quarterly releases with periodic backports, similar how recent features such as News and Interests (part of widgets in Windows 11) were developed (continuous development, followed by backports to stable releases). This change should have minimal impact on development snapshots, which are released continuously as add-on code changes. Overall, milestone development is still an iterative process just like previous releases.
es: El principal objetivo del desarrollo por hitos / proceso trimestral es recordarme las prioridades de la vida. En el pasado, era capaz de dedicar más tiempo al desarrollo y mantenimiento de complementos. Según ha pasado el tiempo, se ha vuelto más importante pensar en asuntos personales inmediatos, como centrarme más en la educación superior. Además, he estado buscando una forma de reinventar los ciclos de desarrollo de complementos, por lo que en junio de 2021 decidí pasar el desarrollo de versiones estables más de una entrega continua a versiones trimestrales con cambios periódicos, similar a como funciones recientes, como noticias e intereses (parte de los widgets de Windows 11) se han desarrollado (desarrollo continuo, seguido de cambios llevados a versiones estables). Este cambio debería tener un impacto mínimo en las versiones de desarrollo, que se publican continuamente según cambia el código del complemento. En general, el desarrollo por hitos es todavía un proceso iterativo, al igual que en versiones anteriores.

source: ### Integrating features from this add-on to NVDA screen reader
es: ### Integración de características de este complemento en el lector de pantalla NVDA
