Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/w10addoninternals.po
Languages: es

source: 4. The actual global plugin class, consisting of overlay class finder and tracking routines for various UIA events (only available if NVDA is restarted with debug logging enabled).
es: 4. La clase real de la extensión global, formada por un buscador de clases de superposición y procedimientos de rastreo para diversos eventos UIA (sólo disponibles si NVDA se reinicia con el registro de depuración habilitado).

source: ### Startup and shutdown
es: ### Inicio y apagado

source: At startup, along with checking to see if a compatible version of Windows (10 and later, not all feature updates are supported) is in use, the add-on enables tracking of missing UIA events. For example, until May 2017, controller for event (an event fired by a control that depends on another control such as an edit field with search suggestions) wasn't available in NVDA screen reader, but search suggestion announcement was made possible as this add-on added this event.
es: Al arrancar, junto con una comprobación del uso de una versión compatible de Windows (10 y posterior, no todas las actualizaciones de características se soportan), el complemento activa el rastreo de eventos UIA ausentes. Por ejemplo, hasta mayo de 2017, el controlador para evento (un evento producido por un control que depende de otro control, como un campo de texto con sugerencias de búsqueda) no estaba disponible en el lector de pantalla NVDA, pero la verbalización de sugerencias de búsqueda se hizo posible cuando este complemento añadió este evento.

source: Until 2019, the add-on was also responsible for extending UIA interface, adding settings dialogs, and checking for updates. These took the bulk of startup and shutdown routines which were removed with the removal of add-on update check facility.
es: Hasta 2019, el complemento era también responsable de extender la interfaz UIA, añadiendo diálogos de opciones y buscando actualizaciones. Eto tomaba la mayoría de procedimientos de inicio y apagado, que se suprimieron cuando se eliminó la función de búsqueda de actualizaciones del complemento.

source: ### Notable Windows app objects and features
es: ### Características y objetos de aplicación de Windows destacables

source: #### Sounds to indicate appearance of search suggestions
es: #### Sonidos para indicar la aparición de sugerencias de búsqueda

source: In some edit fields such as search box in Start menu, a list of suggestions will appear while entering text. for newer implementations, UIA controller for event is raised if this happens, with different screen readers reacting differently. For example, when typing something into Start search box while using Narrator, Narrator will play a sound to indicate appearance of suggestions, while old NVDA releases will announce top suggestion.
es: En algunos cuadros de edición, como el de búsqueda del menú inicio, aparecerá una lista de sugerencias mientras se escribe texto. En implementaciones más nuevas, se lanza el evento controlador para de UIA si esto ocurre, con los distintos lectores de pantalla reaccionando de forma diferente. Por ejemplo, al escribir texto en el cuadro de búsqueda del menú inicio mientras se usa el narrador, este reproducirá un sonido indicando la aparición de sugerencias, mientras que las versiones viejas de NVDA verbalizarán la sugerencia superior.

source: Because I felt it would be best to let users be notified when suggestions appear and disappear (and in some respects, follow Narrator's footsteps), I have implemented code to handle search suggestions. This is divided into four components:
es: Ya que sentía que lo mejor era notificar a los usuarios cuando las sugerencias aparecen y desaparecen (y en algunos aspectos seguir los pasos del narrador), he implementado código para manejar las sugerencias de búsqueda. Este código se divide en cuatro componentes:

source: * One or more classes used to identify edit fields that does raise UIA controller for event and ways to identify them. The reason for using several classes for the same object is due to compatibility reasons, as older NVDA releases does not come with a search field class. These classes include two events related to controller for event:
es: * Una o más clases usadas para identificar cuadros de edición que lanzan el evento de UIA controlador para, y formas de identificarlas. El motivo por el que se usan clases para el mismo objeto tiene que ver con la compatibilidad, ya que las versiones antiguas de NVDA no vienen con una clase para los cuadros de búsqueda. Estas clases incluyen dos eventos relacionados con el evento controlador para:

source: * `event_suggestionsOpened`: called when suggestions appear. Some controls, notably embedded Cortana search box when opening a new Sets tab, does not fire this event properly.
es: * `event_suggestionsOpened`: llamado cuando aparecen sugerencias. Algunos controles, especialmente el cuadro de búsqueda incrustado de Cortana que sale al abrir una nueva pestaña de conjuntos, no disparan este evento adecuadamente.

source: * `event_suggestionsClosed`: called when suggestions disappear. There are controls that does not raise this, including Edge's address omnibar.
es: * `event_suggestionsClosed`: llamado cuando desaparecen las sugerencias. Hay controles que no lanzan estos eventos, como la barra de direcciones de Microsoft Edge.

source: * A class representing the suggestion items themselves.
es: * Una clase que representa los elementos de sugerencia en sí.

source: * A set of sounds to indicate appearance/disappearance of suggestions.
es: * Un conjunto de sonidos para indicar la aparición y desaparición de sugerencias.

source: * A compatibility layer for old and upcoming NVDA releases as noted above.
es: * Una capa de compatibilidad para versiones de NVDA antiguas y futuras, tal y como se ha resaltado arriba.

source: In addition, in some cases, it is helpful to announce how many suggestions have appeared, thus a routine has been added to announce this. With this added, the complete picture is as follows:
es: Además, en algunos casos, es útil verbalizar cuántas sugerencias han aparecido, y por ello se ha añadido un procedimiento para hacerlo. Con esto añadido, el cuadro completo es el siguiente:

source: 1. User types text into a search field.
es: 1. El usuario escribe texto en un cuadro de búsqueda.

source: 2. NVDA will notice controller for event and will look for suggestions list. If such a list is found, NVDA will play the suggestion sound by raising suggestions opened event.
es: 2. NVDA recibirá el evento controlador para y buscará la lista de sugerencias. Si dicha lista se encuentra, NVDA reproducirá el sonido de sugerencias llamando al evento suggestionsOpened.

source: 3. If suggestions are found, it'll announce the top suggestion or suggestion count. The former is for Start menu, while the latter is for other edit fields.
es: 3. Si se encuentran sugerencias, NVDA verbalizará la sugerencia superior o la cantidad de sugerencias. Lo primero se hace en el menú inicio, mientras que lo último se hace en los demás cuadros de búsqueda.

source: 4. One can then use up or down arrow keys to move through suggestions, then press Enter to select or Escape to close suggestions list. When closing suggestions list, NVDA will play suggestions close sound.
es: 4. Se pueden usar las flechas arriba y abajo para moverse por las sugerencias, y pulsar intro para seleccionar o escape para cerrar la lista de sugerencias. Al cerrar la lista de sugerencias, NVDA reproducirá el sonido de desaparición de sugerencias.

source: Since NVDA 2017.3, suggestion announcement (not the count) is part of the screen reader.
es: Desde NVDA 2017.3, la verbalización de sugerencias de búsqueda (y no el total) es parte del lector de pantalla.

source: Note that the routines described above was done at a time when it was desirable to detect all possible search fields. However, it was found that some workarounds were app specific, thus in June 2019, it was decided to transfer some search field handling to app modules. This is especially the case with address omnibar in legacy Microsoft Edge (EdgeHTML version) where the global plugin’s suggestions closed event handler did not apply if Edge is in use. Along the way, handling rarely used search fields that appeared in one or two apps (such as People app search field in old app releases) were dropped.
es: Ten en cuenta que los procedimientos descritos más arriba se hicieron de una vez cuando se quisieron detectar todos los campos de búsqueda. Sin embargo, se descubrió que algunas aplicaciones necesitaban correcciones específicas, por lo que en junio de 2019 se decidió transferir el manejo de algunos campos de búsqueda a los módulos de aplicación. Este caso concretamente es el que se aplica a la barra de direcciones del antiguo Microsoft Edge (versión EdgeHTML), donde el manejador de evento de sugerencias de búsqueda cerradas de la extensión global no se aplicaba si Edge estaba en uso. El manejo de campos de búsqueda extraños que apareció en una o dos aplicaciones (como el campo de búsqueda de la aplicación Personas en versiones antiguas de la aplicación) fue eliminado.

source: #### Announcing notifications
es: #### Verbalizando notificaciones

source: Windows 10 1709 (Fall Creators Update) introduces a new event to let apps send text to be announced by UIA clients such as NVDA. One of the jobs of Windows App Objects is to catch this and announce notifications for NVDA releases which does not support this natively.
es: Windows 10 1709 (actualización Fall Creators) introduce un nuevo evento para permitir a las aplicaciones enviar texto que sea verbalizado por clientes UIA como NVDA. Una de las tareas de Objetos de aplicación de Windows es capturarlo y verbalizar notificaciones en versiones de NVDA que no lo soporten de forma nativa.

source: Because old NVDA releases do not support the new notification event natively, a trick is included with the add-on to allow NVDA to detect and handle notifications. This is done by extending UIA support subsystem through an internal module that takes over the NVDA's own routines. Among other things, this extended subsystem includes definitions for UIA notification event handler, and this subsystem takes over if NVDA 2018.1.x is running on Windows 10 1709 and later.
es: Como NVDA no soporta el nuevo evento de notificación de forma nativa, se incluye una solución con este complemento para permitir a NVDA detectar y procesar notificaciones. Esto se hace extendiendo el subsistema de soporte UIA a través de un módulo interno que tiene prioridad sobre los procedimientos de NVDA. Entre otras cosas, este subsistema extendido incluye definiciones para el manejador del evento de notificación de UIA, y tiene en cuenta si se está ejecutando NVDA 2018.1.x en Windows 10 1709 y versiones posteriores.

source: The notification event handler takes five keyword arguments:
es: El manejador de eventos de notificación recibe cinco argumentos clave:

source: * Sender: the UIA element that raised the event.
es: * Remitente: el elemento UIA que ha lanzado el evento.

source: * Notification kind: the kind of notification.
es: * Tipo de notificación: el tipo de notificación.

source: * Notification processing: how NVDA should process incoming notification.
es: * Procesado de notificación: cómo debería NVDA procesar la notificación entrante.

source: * Display string: notification text.
es: * Cadena a mostrar: texto de la notificación.

source: * Activity Id: the unique identifier for the notification.
es: * ID de actividad: el identificador único de la notificación.

source: As of October 2018, NVDA itself announces notifications for all apps (especially for the currently active app) except one or two apps where this would cause issues, thus the add-on is no longer involved in announcing many notifications except those that could cause issues.
es: Desde octubre de 2018, NVDA verbaliza notificaciones para todas las aplicaciones (especialmente la aplicación activa), excepto una o dos donde esto daría problemas, por lo que el complemento ya no está implicado en el anuncio de muchas notificaciones salvo aquellas que podrían causar problemas.

source: #### Tracking UIA events for controls
es: #### Rastreo de eventos UIA en controles

source: The Windows App Objects global plugin also has ability to track UIA events for controls and log info about them, executed via `uiaDebugLogging` function that takes an object and the event name. This function records the following if NVDA is started with debug logging enabled or told to monitor specific events and/or events from specific apps:
es: La extensión global Objetos de aplicación de Windows tiene también la capacidad de rastrear eventos UIA para controles y registrar información sobre ellos, ejecutando la función `uiaDebugLogging`, que recibe el objeto y el nombre del evento. Esta función registra lo siguiente si NVDA se ha iniciado con el registro de depuración habilitado o se le ha indicado que monitorice eventos específicos y / o eventos de aplicaciones concretas:

source: * What the object actually is.
es: * Qué es realmente el objeto.

source: * Object name.
es: * Nombre del objeto.

source: * Name of the event being logged.
es: * Nombre del evento que se registra.

source: * App where the control can be found (specifically, the app module).
es: * Aplicación donde puede encontrarse el control (específicamente, el módulo de aplicación).

source: * Automation Id if possible.
es: * ID de automatización si es posible.

source: * UIA class name.
es: * Nombre de clase UIA.

source: * For controller for event, the list of objects the given control depends on.
es: * Para el evento controlador para, la lista de objetos de la que depende el control dado.

source: * For tooltip open event, the GUI framework that powers the element.
es: * Para el evento de consejo abierto, el motor de interfaz gráfica que proporciona el elemento.

source: * For item status event, new item status text.
es: * Para el evento de estado del elemento, el nuevo texto de estado del elemento.

source: * For state change event, current element state.
es: * Para el evento de cambio de estado, el estado actual del elemento.

source: For notification events, NVDA records event parameters from the event handler method itself.
es: En caso de que haya eventos de notificación, NVDA registra los parámetros del evento desde el mismo método manejador del evento.

source: #### Looping selectors
es: #### Selectores en bucle

source: A looping selector is a combo box-like control where the selection loops around. This is employed in places such as Alarms and Clock, Settings/Update and Security/Windows Update/active hours and so on.
es: Un selector en bucle es un control similar a un cuadro combinado, donde la selección está en bucle y se repite. Se emplea en lugares como Reloj y alarmas, Configuración / Actualización y seguridad / Windows Update / Horas activas y así sucesivamente.

source: In older Windows 10 and universal app releases, when changing selector values, item selected UIA event wasn't fired. To get around this, the add-on will examine states for each item and announce if an item has selected state. This isn't the case for newer implementations, but for backward compatibility, the old routines are kept. This has been enhanced in NVDA 2019.1, and since June 2019, the add-on is no longer involved in keeping an eye on this control as NVDA supports it natively.
es: En versiones antiguas de Windows 10 y las aplicaciones universales, al cambiar los valores del selector, no se disparaba el evento UIA elemento seleccionado. Para solucionar esto, el complemento examinará los estados para cada elemento y verbalizará si un elemento tiene el estado seleccionado. Este no es el caso para implementaciones más nuevas, pero se conservan los procedimientos para garantizar compatibilidad hacia atrás. Esto se ha mejorado en NVDA 2019.1, y desde junio de 2019, el complemento ya no vigila esta situación porque NVDA la soporta de forma nativa.

source: #### Live region change events
es: #### Eventos de cambio de región viva

source: Some controls are live regions - that is, a control whose content denotes live text, such as progress of something, alerts and so on. Because of odd live region change event implementations, older NVDA releases does not support this event natively, but NVDA 2017.3 and later includes a trivial implementation where NVDA will announce the live region text i.e. object name.
es: Algunos controles son regiones vivas, o lo que es lo mismo: un control cuyo contenido denota texto vivo, como el progreso de algo, alertas y demás. Debido a implementaciones defectuosas del evento de cambio de región viva, las versiones más antiguas de NVDA no soportan este evento de forma nativa, pero en NVDA 2017.3 y versiones posteriores se incluye una implementación trivial donde NVDA verbalizará el texto de la región viva, como el nombre del objeto.

source: The Windows App Objects goes one step further by recording instances of this event and providing workarounds for specific cases. These include announcing correct text for Edge alerts (see below), preventing repeat announcements in some apps and so on.
es: Objetos de aplicación de Windows va un paso más allá registrando instancias de este evento y ofreciendo soluciones para casos específicos. Aquí se incluye la verbalización correcta de texto para las alertas en Edge (mira más abajo), la prevención de verbalizaciones repetidas en algunas aplicaciones, etc.

source: #### Recognizing various dialogs
es: #### Reconocimiento de diversos diálogos

source: Despite not being identified as such, some windows are actually dialogs. These include pop-up dialog for uninstaling apps, various dialogs found in Settings app and so on.
es: Algunas ventanas son realmente diálogos, aunque no se identifiquen como tales. Estas incluyen los diálogos emergentes para desinstalar aplicaciones, diversos diálogos que se encuentran en la aplicación de configuración y demás.

source: In old add-on releases, NVDA would consult a list of known dialog class names in hopes of catching a dialog. In newer releases, especially if run on Windows 10 1809 and later, UIA IsDialog property is used to catch dialog elements. Once dialogs are recognized, NVDA will read contents of these dialogs automatically when they appear. This has been simplified in NVDA 2018.3 as NVDA itself will try its best to recognize more dialogs, including those marked as a dialog via UIA in Windows 10 1809. However, there are windows that are actually dialogs, so the add-on still ships with a list of known dialog classes to be consulted by NVDA.
es: En versiones antiguas del complemento, NVDA habría consultado una lista de nombres de clases conocidas de diálogos con la esperanza de detectar alguno. En las nuevas versiones, especialmente si se ejecutan en Windows 10 versión 1809 o posterior, la propiedad UIA IsDialog se usa para detectar elementos de diálogo. Una vez se reconocen los diálogos, NVDA leerá su contenido automáticamente tan pronto como aparezcan. Esto se ha simplificado en NVDA 2018.3, ya que el propio NVDA dará lo mejor de sí mismo para reconocer más diálogos, incluyendo aquellos marcados como diálogos mediante UIA en Windows 10 1809. Sin embargo, existen ventanas que son realmente diálogos, por lo que el complemento todavía incorpora una lista de clases de diálogo conocidas para que NVDA las consulte.

source: #### Drag and drop events
es: #### Eventos de arrastrar y soltar

source: Some controls allow draggin and dropping items using keyboard commands. This is used when rearranging Start menu tiles, moving Action Center items around, and reordering virtual desktops in Windows 11. This is done by pressing Alt+Shift+left or right arrow keys.
es: Algunos controles permiten arrastrar y soltar elementos usando atajos de teclado. Esto se usa al reordenar los mosaicos del menú Inicio, desplazar elementos en el centro de actividades, y reordenar escritorios virtuales en Windows 11. Esto se hace pulsando las teclas alt+shift+flechas izquierda y derecha.

source: The controls listed above raise UIA drag and drop events, equivalent to mouse drag/drop events. Up to six UIA events are defined to notify UIA clients such as NVDA when drag or drop operation starts, is happening, or items were dragged or dropped. Of these, NVDA listens to the following events to announce new location of the just dragged item:
es: Los controles enumerados más arriba elevan eventos UIA de arrastrar y soltar, equivalentes a los eventos de arrastrar y soltar del ratón. Se definen hasta seis eventos UIA para notificar a clientes UIA como NVDA cuando la operación de arrastrar o soltar comienza, está en curso, o se han arrastrado o soltado los elementos. De estos, NVDA escucha los siguientes eventos para anunciar la nueva ubicación del elemento recién arrastrado:

source: * Drag complete: raised by the item itself when it is dragged somewhere.
es: * Drag complete: elevado por el propio elemento cuando se arrastra a algún sitio.

source: * Drop target dropped: a container such as a list notifies UIA clients if an item inside it is dragged to a new position.
es: * Drop target dropped: un contenedor, tal como una lista, notifica a los clientes UIA si se está arrastrando un elemento en su interior a una nueva posición.

source: ## App modules for universal apps
es: ## Módulos de aplicación para aplicaciones universales

source: In addition to Windows App Objects global plugin, the add-on comes with app modules designed to provide extra support for various universal apps included in Windows 10 and later. These modules include enhancers and/or fixers, broadly divided into five categories:
es: Además de la extensión global Objetos de aplicación de Windows, el complemento viene con módulos de aplicación diseñados para proporcionar soporte extra para diversas aplicaciones universales que vienen con Windows 10 y posterior. Estos módulos incluyen mejoras y/o solución de problemas, principalmente divididas en cinco categorías:

source: 1. Adding extra features.
es: 1. Añadir funciones extra.

source: 2. Supporting new technologies.
es: 2. Dar soporte a nuevas tecnologías.

source: 3. Announcing (or, more recently, suppressing extraneous announcement of) information in various situations.
es: 3. Verbalizar (o, más recientemente, suprimir verbalización sobrante de) información en diversas situaciones.

source: 4. Workarounds for UIA issues.
es: 4. Solución a problemas de UIA.

source: 5. Respond to changes in apps, and in at least four occasions, adding aliases due to renamed executable names.
es: 5. Respuesta a cambios en aplicaciones, y en al menos cuatro ocasiones, añadir algunos alias para aplicaciones con el nombre del ejecutable cambiado.

source: The modules and enhancers/fixers applied are:
es: Los módulos, mejoras y soluciones aplicadas son:

source: * Calculator: selectively announce calculator display.
es: * Calculadora: verbaliza la pantalla de manera selectiva.

source: * Calendar: suppress read-only state announcement in various controls.
es: * Calendario: suprime el anunciado del estado de sólo lectura en múltiples controles.

source: * Cortana/Start menu/Windows Search (classic Cortana): suppress double announcement of suggestion result item in some cases, staying silent when user is dictating to Cortana, handling bad UIA implementations.
es: * Cortana / Menú inicio / Windows Search (Cortana clásico): suprime la verbalización doble del elemento de sugerencia de resultado en algunos casos, permanece en silencio cuando el usuario dicta a Cortana, y procesa malas implementaciones de UIA.
