Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/w10addoninternals.po
Languages: es

source: * Cortana/conversations (new Cortana): announcing Cortana's responses.
es: * Cortana/conversaciones (nuevo Cortana): se anuncian las respuestas de Cortana.

source: * Mail: table navigation commands in message list, suppress read-only announcement in email content, app alias for hxmail.exe and hxoutlook.exe (the latter for updates released in May 2017).
es: * Correo: órdenes de navegación de tablas en la lista de mensajes, elimina la verbalización de sólo lectura en el contenido del correo, alias de aplicación para hxmail.exe y hxoutlook.exe (el más reciente para actualizaciones publicadas después de mayo del 2017).

source: * Maps: play location coordinates for map items, suppress repeated live region announcements, aliases to support old and new Maps releases (the old alias, maps_windows, is gone).
es: * Mapas: reproduce coordenadas de eventos para elementos en el mapa, se suprime la verbalización repetida en el cambio de regiones vivas, alias para dar soporte a versiones viejas y nuevas de la aplicación (el alias viejo, maps_windows, ya no está).

source: * Microsoft Store: announce needed information when live region changed event is fired by some controls, aliases to support old and new Store versions (the old alias, winstore_mobile, is no more).
es: * Tienda de Microsoft: verbaliza información necesaria cuando se dispara el evento de cambio de región viva en algunos controles, alias para soportar versiones antiguas y nuevas de la tienda (el alias antiguo, winstore_mobile, ya no está).

source: * Modern keyboard/text input host: support for emoji panel, dictation, hardware input suggestions, pasting clipboard items (Version 1809), and modern IME's, part of NVDA since 2018.3.
es: * Teclado moderno / host de entrada de texto: soporte para el panel de emojis, el dictado, las sugerencias de entrada por hardware y pegar elementos desde el portapapeles (versión 1809), IME moderno, parte de NVDA desde la versión 2018.3.

source: * MSN Weather: use up or down arrow keys to read forecast information.
es: * El tiempo: usa las flechas arriba o abajo para leer la información meteorológica.

source: * People: announcing first suggestion when looking for a contact.
es: * Personas: se anuncia la primera sugerencia al buscar un contacto.

source: * Settings: selectively announce various status information, provide correct labels for certain controls.
es: * Configuración: verbaliza de forma selectiva diversa información de estado, proporciona etiquetas correctas para ciertos controles.

source: ### Adding useful features in apps
es: ### Añadiendo funciones útiles en aplicaciones

source: The following app modules add functionality unique to NVDA and/or commands that are used to improve user experience when using apps:
es: Los siguientes módulos de aplicación añaden funcionalidad específica de NVDA y / o órdenes utilizadas exclusivamente para mejorar la experiencia de usuario al utilizar aplicaciones:

source: * Maps (maps.py): when using object navigation to examine a map, a tone will be played to indicate where things are located on the map. This is achieved by defining a custom handler for `event_becomeNavigatorObject` that'll take the coordinates of the object (in pixels) and play a tone, essentially emulating mouse coordinate beeps in NVDA. The app module also allows users to hear new locations when using street view to navigate the map, and this is done through handlers for live region changed event.
es: * Mapas (maps.py): al usar navegación de objetos para examinar un mapa, se reproducirá un tono para indicar dónde se ubican las cosas en el mapa. Esto se hace definiendo un manejador personalizado para `event_becomeNavigatorObject` que tomará las coordenadas del objeto (en píxeles) y reproducirá un tono, emulando esencialmente los pitidos de coordenadas del ratón de NVDA. El módulo de aplicación también permite a los usuarios oír nuevas ubicaciones al usar la vista de calle para navegar por el mapa, y esto se ha realizado a través de manejadores para el evento de región viva cambiada.

source: * Mail (hxoutlook.py): when focused on messages list, one can use table navigation commands (Control+Alt+arrow keys) to review message headers. This is possible thanks to two things: headers are child objects of the message item, and because of this, `NVDAObjects.behaviors.RowWithFakeNavigation` class can be employed to add this functionality.
es: * Correo (hxmail.py): al tener el foco en la lista de mensajes, se pueden usar órdenes de navegación de tablas (ctrl+alt+flechas) para revisar los encabezados del mensaje. Esto es posible gracias a dos cosas: los encabezados son objetos hijo del elemento del mensaje, y por esto, se puede emplear la clase `NVDAObjects.behaviors.RowWithFakeNavigation` para añadir esta funcionalidad.

source: * MSN Weather (microsoft_msn_weather.py): this app module, contributed by Derek Riemer, allows users to use up and down arrow keys to read forecast information, achieved by calling corresponding review cursor movement commands to move by line.
es: * El tiempo (Microsoft_msn_weather.py): este módulo de aplicación, aportado por Derek Riemer, permite a los usuarios pulsar las flechas arriba y abajo para leer información meteorológica, llamando a las órdenes correspondientes de movimiento del cursor de revisión para moverse por línea.

source: #### A note about modern keyboard
es: #### Una nota sobre el teclado moderno

source: Modern keyboard, sometimes called Composable Shell (windowsinternal_composableshell_experiences_textinput_inputapp.py) and nowadays called Text Input Host, is the name of the app that provides various features, including emoji panel, dictation, hardware input suggestions, listing items to be pasted from cloud clipboard and many other input related features. This is not exactly an app, but more towards a floating overlay, much akin to touch keyboard on touchscreen devices. Powering these is a redesigned touch keyboard where XAML-based touch panel (with its own process) is used.
es: Teclado moderno, en ocasiones llamado Composable Shell (windowsinternal_composableshell_experiences_textinput_inputapp.py), y hoy en día llamado host de entrada de texto, es el nombre de la aplicación que proporciona diversas características, incluyendo el panel de emojis, el dictado, las sugerencias de entrada por hardware, el listado de elementos que pueden pegarse desde el portapapeles en la nube y muchas más funciones relacionadas con la entrada. No se trata exactamente de una aplicación, sino que está más enfocado hacia una capa flotante, similar a los teclados en pantalla que se muestran en dispositivos táctiles. Para potenciarlos, hay un teclado táctil rediseñado donde se usa el panel táctil basado en XAML (con su propio proceso).

source: In Windows 10 Insider Preview build 16215 and later, it is possible for users to browse and select emojis to insert in an edit field. This is done by pressing Windows+period (.) or Windows+semicolon (;). A floating panel of emoji categories and emojis will appear. One can then use arrow keys to move through emojis or Tab and Shift+Tab to cycle through categories. In build 16226, one can type emoji descriptions to narrow the emoji field.
es: En Windows 10 Insider Preview compilación 16215 y posteriores, se da la posibilidad a los usuarios de explorar y seleccionar emojis para insertar en un cuadro de edición. Esto se hace pulsando Windows+punto (.) o Windows+punto y coma (;). Se mostrará un panel flotante con emojis y categorías de emojis. A partir de ahí se pueden usar las flechas para desplazarse entre los emojis, o tab y shift+tab para saltar por las categorías. En la compilación 16226, se pueden teclear descripciones de emojis para acotar el emoji deseado.

source: In build 17666 and later, this panel has been redesigned. Instead of using Tab key to move between categories, one would press Tab to move between emoji grid and categories. In case of People category, pressing Tab will let you move to skin tones list where you can use arrow keys to select a skin tone, then press Tab to move to emoji grid.
es: En la compilación 17666 y posteriores, se ha rediseñado este panel. En vez de usar el tabulador para moverse entre categorías, ahora se pulsa el tabulador para moverse entre las categorías y la cuadrícula de emojis. En el caso de la categoría personas, el tabulador te hará moverte a la lista de tonos de piel, en la que puedes usar las flechas para seleccionar un tono de piel, y luego pulsar tabulador para moverte a la cuadrícula de emojis.

source: Build 18305 and later brought another design change to this panel. In addition to selecting emojis, it also hosts two new grand categories named kaomoji ("face characters" in Japanese) and symbols. When one presses Tab, one will eventually reach category list with three items: emoji, kaomoji, and symbols. Just like selecting emoji categories, pressing Enter will switch the panel among these modes.
es: La compilación 18305 y posteriores trajeron otro cambio de diseño a este panel. Además de seleccionar emojis, también hay otras dos categorías principales llamadas kaomoji ("caracteres faciales" en japonés) y símbolos. Al pulsar tabulador, se alcanzará la lista de categorías con tres elementos: emoji, kaomoji y símbolos. Al igual que con las categorías de emojis, al pulsar intro se alternará el panel entre estos modos.

source: Build 18963 renamed Modern Keyboard to Text Input Host, along with bringing refined version of Input Method Editor (IME) for certain languages. For languages such as Japanese, the modern IME hosted by Text Input Host is used.
es: La compilación 18963 renombró el teclado moderno como host de entrada de texto, y además trae una versión refinada del editor de métodos de entrada (IME) para ciertos idiomas. En idiomas como el japonés, se usa el IME moderno alojado en el host de entrada de texto.

source: Build 20206 brought redesigned modern keyboard. Emoji panel and clipboard history were combined, along with searching for GIF's (animated images). Instead of element selected event, notification event is used to announce selected emoji and clipboard history item. It will not be until build 21296 that the redesigned emoji panel became usable, and as things can change, support for redesigned modern keyboard is not part of NVDA screen reader at this time (support is provided through this add-on).
es: La compilación 20206 trajo un teclado moderno rediseñado. Se han combinado el panel de emojis y el historial del portapapeles, junto con la búsqueda de gifs (imágenes animadas). En vez del evento element selected, se usa el evento de notificación para anunciar el emoji o el elemento del portapapeles seleccionado. No será hasta la compilación 21296 cuando el panel de emojis rediseñado se vuelve usable, y como las cosas pueden cambiar, el soporte para el panel de emojis rediseñado no forma parte del lector de pantalla NVDA en este momento (se proporciona soporte mediante este complemento).

source: When this panel opens, a menu open event is fired by the emoji panel (File Explorer in build 18305 and later), an event NVDA does not detect for performance reasons. As items are selected, an item selected event (notification event in build 21296 and later) is fired, to which NVDA responds by walking the panel in a tree-like fashion in order to locate the item selected. The actual announcement of emoji characters depends on synthesizers; currently, recent SAPI5 and OneCore (aka SAPI Mobile) voices and Espeak nG ships with definitions of emoji characters, expanded to cover other synthesizers in NVDA 2018.4
es: Cuando este panel se abre, el panel de emojis dispara un evento de apertura de menú (explorador de archivos en la compilación 18305 y posteriores), un evento que NVDA no detecta por razones de rendimiento. Según se van seleccionando elementos, se dispara un evento de elemento seleccionado (evento de notificación en la compilación 21296 y posteriores), al que NVDA responde recorriendo el panel como si fuera un árbol hasta ubicar el elemento seleccionado. La verbalización real de caracteres emoji depende de los sintetizadores; actualmente, Espeak NG y las voces recientes de Sapi 5 y OneCore (Sapi Mobile) vienen con definiciones de caracteres emoji, expandidas para cubrir otros sintetizadores en NVDA 2018.4

source: Similar to emoji panel (or expanded input panel in build 18305 and later), in build 17025 and later, modern keyboard can also provide input suggestions. This is done by checking a new option in Settings/Devices/Typing, and activated when one presses up arrow while typing (only United States English keyboard layout is supported). Just like emoji panel, a floating window appears, and in this case, one can press left or right arrow to navigate between suggestions and press Enter to accept the offered item.
es: De manera similar al panel de emojis (o panel de entrada expandido en la compilación 18305 y posteriores), en la compilación 17025 y posteriores, el teclado moderno también puede proporcionar sugerencias de entrada. Esto se hace marcando una nueva opción en Configuración / Dispositivos / Escritura, y que se activa también al pulsar flecha arriba mientras se escribe (sólo se soporta la distribución de teclado en inglés de Estados Unidos). Al igual que en el panel de emojis, aparece una ventana flotante, y en este caso se pueden pulsar flechas izquierda y derecha para navegar entre sugerencias y pulsar intro para aceptar el elemento ofrecido.

source: The above mechanism for selecting input suggestions is also employed when pasting items from cloud clipboard. In build 17666 and later, one can copy text and small images to the clipboard to be pasted later, and Windows will keep a history of items copied to the clipboard. When Windows+V is pressed, a list of clipboard items will be displayed, and one can use left or right arrows to select the desired item.
es: El mecanismo anterior para seleccionar sugerencias de entrada también se emplea al pegar elementos desde el portapapeles en la nube. En la compilación 17666 y posteriores, se pueden copiar textos y pequeñas imágenes al portapapeles para pegarlos más tarde. Windows conservará un historial de elementos copiados al portapapeles. Al pulsar Windows+v, se mostrará una lista de elementos del portapapeles, y en ella se pueden pulsar flechas izquierda y derecha para seleccionar el elemento deseado.

source: In NVDA 2018.3, support for all of these (modern keyboard features) plus dictation window (also part of modern keyboard) have become part of NVDA, with modern IME support coming with NVDA 2020.4. The add-on is still required in order to support more recent panel redesigns (see above), in particular redesigned emoji panel in build 21296.
es: En NVDA 2018.3, el soporte para estas características (teclado moderno) más la ventana de dictado (parte también del teclado moderno) forma parte del propio NVDA, llegando el soporte de IME moderno en NVDA 2020.4. No obstante, el complemento es necesario todavía para soportar los nuevos diseños de panel (explicados más arriba), en particular el panel de emojis rediseñado en la compilación 21296.

source: ### What to announce, what not to announce
es: ### Qué verbalizar, qué callar

source: It is sometimes helpful to let users know what's going on by announcing various status information, while at other times it is equally important to not announce extraneous messages. The former was the case for majority of app modules below in the past, but since mid-2017, reverse is happening more frequently.
es: En ocasiones es útil hacer que los usuarios sepan qué está pasando anunciando información de diversos estados, mientras que otras veces es igualmente importante no anunciar mensajes extra. El primero era el caso para la mayoría de los siguientes módulos de aplicación en el pasado, pero desde mediados de 2017 se está evolucionando precisamente hacia lo contrario.

source: The app modules (and for one in particular, more than an app module) in question are:
es: Los módulos de aplicación (y para uno en particular, más de un módulo de aplicación) en cuestión son:

source: * Calculator (calculator.py): while entering calculations, entered expression will be announced via name change handler. Because this may interfere with typed character announcement in NVDA, the calculator display will be announced only when actual results appear or when the display is cleared.
es: * Calculadora (calculator.py): mientras se introducen cálculos, se anuncia la expresión introducida mediante el manejador de evento de cambio de nombre. Como esto puede interferir con la verbalización de caracteres introducidos en NVDA, sólo se verbalizará el contenido de la pantalla de la calculadora cuando aparezcan los resultados reales o cuando se limpie.

source: * People (peopleapp.py): NVDA will announce first suggestion when looking for a contact. Unlike other search fields, there is no controller for event. However, the suggestion raises item selected event.
es: * Personas (peopleapp.py): NVDA anunciará la primera sugerencia al buscar un contacto. A diferencia de otros campos de búsqueda, no hay un controlador para evento. Sin embargo, la sugerencia lanza un evento de elemento seleccionado.

source: * Cortana (searchui.py)/new Start menu and Windows Search experience (searchapp.py in Windows 10, searchhost.py in Windows 11): classic Cortana uses name change events and specific Automation Id's to convey text messages. Name change event is also employed when Cortana tries to understand the text a user is dictating, which in old releases of the add-on meant NVDA would announce gibberish, subsequently resolved in later add-on releases. In recent Windows 10 releases, due to Windows Search redesign (which also involve changing executable for Windows Search to searchapp), search box content instead of result details is announced, or if results are announced, they are announced twice.
es: * Cortana (searchui.py) / nuevo menú Inicio y experiencia de búsqueda en Windows (searchapp.py en Windows 10, searchhost.py en Windows 11): Cortana clásico usa eventos de cambio de nombre e identificadores de automatización específicos para transmitir mensajes de texto. El evento de cambio de nombre también se emplea cuando Cortana intenta entender el texto dictado por un usuario, lo que en las versiones antiguas del complemento se traducía en que NVDA podía verbalizar galimatías. Esto se resolvió en versiones posteriores del complemento. En versiones recientes de Windows 10, debido al cambio de diseño de Windows Search (que también implica renombrar el ejecutable de Windows Search a searchapp), se anuncia el contenido del cuadro de búsqueda en lugar de los detalles del resultado, o si se anuncian los resultados, lo hacen dos veces.

source: * Cortana conversations (cortana.py): similar to classic Cortana, Cortana's responses are announced.
es: * Conversaciones de Cortana (cortana.py): similar al Cortana clásico, se anuncian las respuestas de Cortana.

source: * Settings (systemsettings.py): NVDA will announce messages such as Windows Update notifications, and this is done through live region changed event (name change event in older add-on releases).
es: * Configuración (systemsettings.py): NVDA verbalizará mensajes tales como las notificaciones de Windows Update, y esto se hace mediante el evento de región viva cambiada (evento de cambio de nombre en versiones del complemento más antiguas).

source: * Microsoft Store (winstore_app.py): just like Settings app, status messages are announced, this time dealing with product downloads such as apps and multimedia content.
es: * Tienda de Microsoft (winstore_app.py): al igual que en la aplicación de configuración, se verbalizan mensajes de estado, en esta ocasión relacionados con la descarga de productos como aplicaciones o contenido multimedia.

source: ### Hunting for UIA implementation issues
es: ### Cazando problemas de implementación de UIA

source: As noted above, some controls ship with odd or bad UIA implementations, and universal apps are no exception (at least for app modules included with the add-on). Because of this, the following app modules (and in case of two, taken care of by Windows App Objects global plugin itself) include workarounds for various UIA problems:
es: Como se ha explicado arriba, algunos controles vienen con implementaciones UIA malas o defectuosas, y las aplicaciones universales no son una excepción (al menos para los módulos de aplicación que vienen en el complemento). Por este motivo, los siguientes módulos de aplicación (y en dos casos, la extensión global Objetos de aplicación de Windows) incluyen soluciones para diversos problemas de UIA:

source: * Calendar (hxcalendarappimm.py) and Mail (hxoutlook.py): some edit fields, such as appointment title and others are shown as read-only when they are not, and removing this state from states set for these controls resolved this problem.
es: * Calendario (hxcalendarappimm.py) y Correo (hxoutlook.py): algunos cuadros de edición, como el título de la cita y otros, se muestran como de sólo lectura cuando en realidad no lo son, y eliminando este estado del conjunto de estados para estos controles resolvía este problema.

source: * Cortana: some search suggestions expose same text for name and description, which results in repeats for suggestion result text. This was corrected by comparing name and description and nullifying the description (obj.description = None). This workaround is no longer applicable due to Windows Search redesign in Version 1903. Also, when opening Sets version of Cortana search box (builds 17666 and 17692), wrong controller for event is fired, which prevents NVDA from announcing suggestions, and this has been corrected.
es: * Cortana: algunas sugerencias de búsqueda exponen el mismo texto en su nombre y descripción, lo que resulta en repeticiones del texto con el resultado de la sugerencia. Esto fue corregido comparando nombre y descripción, y anulando la descripción (obj.description=None). Este truco ya no se puede aplicar por el cambio de diseño de Windows Search en la versión 1903. Además, al abrir la versión de Conjuntos del cuadro de búsqueda de Cortana (compilaciones 17666 y 17692), se dispara el controlador de evento equivocado, que evita que NVDA anuncie las sugerencias. Esto se ha corregido.

source: * Maps: despite no changes to the app, live region changed event is fired by map title control, so NVDA includes a way to suppress repetitions.
es: * Mapas: a pesar de que no hay cambios en la aplicación, el control con el título del mapa dispara el evento de región viva cambiada, por lo que NVDA incluye una forma de suprimir repeticiones.
