Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/w10addoninternals.po
Languages: es

source: # NVDA Add-on internals: Windows App Essentials
es: # Complementos de NVDA vistos por dentro: Windows App Essentials

source: Author: Joseph Lee
es: Autor: Joseph Lee

source: Revision: July 2021
es: Revisión: julio de 2021

source: Note: originally called Windows 10 App Essentials, the add-on was renamed to Windows App Essentials in 2021 with the introduction of Windows 11. Parts of this document will refer to the original add-on name or Windows 10.
es: Nota: llamado originalmente Windows 10 App Essentials, el complemento se renombró como Windows App Essentials en 2021 con la presentación de Windows 11. Algunas partes de este documento harán referencia al nombre original del complemento o Windows 10.

source: ## Introduction
es: ## Introducción

source: Supporting new technologies can be fun and challenging, especially a new operating system version that changes how people perform certain tasks and introduces new ways of keeping up with changes. This is more so when it comes to letting screen readers support new operating systems such as Windows 10 and 11, which brings new ways of interacting with a computer, new set of apps and technologies, and accessibility improvements and challenges. NVDA includes solid support for Windows 10 (support may vary on newer releases), including Microsoft Edge, the new Start menu, navigation in universal apps, emoji panel and so on, all made possible thanks to collaboration between users, Microsoft, NV Access and others, part of which involves the add-on we will meet in this article.
es: Dar soporte a nuevas tecnologías puede ser un reto divertido, especialmente si hablamos de la nueva versión de un sistema operativo que cambia el modo que tiene la gente de realizar ciertas tareas y presenta nuevas formas de mantenerse al día. Este reto es aún mayor cuando se centra en dar soporte a los lectores de pantalla para que funcionen en nuevos sistemas operativos tales como Windows 10 y 11, que traen nuevas formas de interactuar con el ordenador, un nuevo conjunto de aplicaciones y tecnologías, y mejoras y retos de accesibilidad. NVDA viene con un soporte sólido para Windows 10 (dicho soporte puede variar en versiones más recientes), incluyendo Microsoft Edge, el nuevo menú de inicio, navegación en aplicaciones universales y mucho más, todo hecho posible gracias a la colaboración entre los usuarios, Microsoft, NV Access y otros. Parte de este soporte se da gracias al complemento que encontraremos en este artículo.

source: In NVDA Add-on Internals: Windows App Essentials, we'll look at how this add-on came about, how it works, its development, and go over recommendations from the add-on author (me) regarding accessibility practices. You'll also glimpse how UI Automation works at a high level, how features start out as an add-on component and end up as an NVDA feature and so on.
es: En Complementos de NVDA vistos por dentro: Windows App Essentials, veremos cómo se creó este complemento, cómo funciona, su desarrollo, y algunas recomendaciones de su autor (yo) relacionadas con prácticas de accesibilidad. También estudiaremos cómo funciona UI Automation a alto nivel, cómo algunas funciones empiezan en forma de complemento y acaban integradas en NVDA, y mucho más.

source: To download the add-on, visit https://addons.nvda-project.org/addons/wintenApps.en.html. The source code for this add-on can be found at https://github.com/josephsl/wintenApps. As Windows (10 and later, more so for Windows 11) and universal apps are UI Automation universes, it is essential that you know some things about UIA, which are covered later.
es: Para descargar este complemento, visita la sección correspondiente, que encontrarás en el menú superior de nuestra web. El código fuente puede encontrarse en https://github.com/josephsl/wintenApps. Ya que Windows (10 y posterior, más aún Windows 11) y las aplicaciones universales pertenecen al mundo de UI Automation, es esencial que sepas algunas cosas sobre UIA, que se tratan más adelante.

source: Disclaimer: Despite the article text and knowledge that's contained within, I (Joseph Lee, the add-on author) do not work for NV Access nor Microsoft.
es: Descargo de responsabilidad: a pesar del texto del artículo y los conocimientos que contiene, yo (Joseph Lee, el creador del complemento) no trabajo para NV Access ni Microsoft.

source: Note: some of the features described may change as Windows and NVDA development progresses. As of July 2021 revision, features from NVDA 2021.1 release and recent Windows Insider Preview builds are documented for reference purposes. Also, when refering to Windows releases (in particularly, Windows 10 feature updates), release Id (YYMM/YYHn) is used instead of using marketing label unless specified (for example, 1709 instead of Fall Creators Update, or 20H2 instead of 2009). To account for Windows 11, releases will be denoted as "Windows release YYMM/YYHn" e.g. Windows 10 21H1 for Windows 10 May 2021 Update or Windows 11 21H2 for first Windows 11 release.
es: Nota: algunas de las funciones descritas pueden cambiar según progresen el desarrollo de NVDA y Windows. En la revisión de julio de 2021, se han documentado las funciones de NVDA 2021.1 y las compilaciones de Windows Insider Preview más recientes con propósitos de referencia. Además, al referirse a versiones de Windows (en concreto, las actualizaciones de Windows 10), se usa el identificador de la versión (aamm) en lugar de la etiqueta de mercado a menos que se especifique (por ejemplo, versión 1709 en vez de actualización Fall Creators, o 20H2 en vez de 2009). Para tener en cuenta a Windows 11, las versiones se indicarán como "Windows versión AAMM/AAhN". Por ejemplo, Windows 10 21H1 para la actualización de mayo de 2021 de Windows 10 o Windows 11 21H2 para la primera versión de Windows 11.

source: Copyright: Microsoft Windows, Windows API, UI Automation, Microsoft Edge, Universal Windows Platform (UWP) and related technologies are copyright Microsoft Corporation. NVDA is copyright NV Access. Windows App Essentials add-on is copyright 2015-2021 Joseph Lee and contributors, released under GPL 2.
es: Derechos de copia: Microsoft Windows, Windows 10, Windows API, UI Automation, Microsoft Edge, Universal Windows Platform (UWP) y otras tecnologías relacionadas tienen copyright de Microsoft Corporation. NVDA tiene copyright de NV Access. El complemento Windows App Essentials tiene copyright 2015-2021 de Joseph Lee y otros colaboradores, y está liberado bajo la GPL versión 2.

source: ## Windows releases and Windows App Essentials
es: ## Versiones de Windows y Windows App Essentials

source: The first version of Windows was 1.01, released in 1985. Over time, Microsoft released familiar Windows releases such as 95, 2000, XP, Vista, 7, 8, 10, 11, and so on. Each release took years to develop - five years for Windows Vista, three years for Windows 7, and almost two years for initial Windows 11 version (21H2).
es: La primera versión de Windows fue la 1.01, publicada en 1985. Con el tiempo, Microsoft liberó versiones familiares de Windows como 95, 2000, XP, Vista, 7, 8, 10, 11, y demás. Cada versión supuso años de desarrollo - cinco años para Windows Vista, tres años para Windows 7, y casi dos años para la versión inicial de Windows 11 (21H2).

source: What I would call the modern Windows began with Windows 10 with the introduction of Windows as a Service (WaaS) where major updates are developed months at a time in collaboration with Windows Insiders. For example, it took Microsoft about five months (June to October 2015) to develop Windows 10 1511 (November Update). Internally, a given Windows release takes more time to develop (up to a year or more), with quality checks done by Microsoft and feedback from Windows Insiders deciding which features will appear for the general public. This practice continues in Windows 11, and so does my work on championing accessibility, especially when it comes to making sure third-party universal apps are usable by many, supporting features such as modern input facility and so on.
es: Lo que yo denominaría Windows moderno comenzó con la llegada de Windows 10 y la presentación de Windows como servicio (WaaS), donde las actualizaciones principales se desarrollan durante varios meses en colaboración con los Windows Insiders. Por ejemplo, Microsoft estuvo aproximadamente cinco meses (desde junio hasta octubre de 2015) desarrollando Windows 10 1511 (actualización de noviembre). Internamente, el desarrollo de una versión de Windows dura más tiempo (hasta un año o más), con Microsoft realizando comprobaciones de calidad y los comentarios de los Windows Insiders decidiendo qué características generales llegarán al público general. Esta práctica continúa en Windows 11, y también lo hace mi trabajo de defender la accesibilidad, especialmente cuando hay que asegurarse de que las aplicaciones universales de terceros son usables para muchos, dando soporte a funciones como la entrada moderna y demás.

source: Originally, Windows App Essentials supported Windows 10 only, hence the original name (Windows 10 App Essentials). This became an issue in June 2021 when Microsoft introduced Windows 11. Despite being called Windows 11, it is still powered by Windows 10 technologies, as evidenced by the system version being 10.0, the same as Windows 10 releases. As a result, the need to expand the add-on to support Windows 11 and future Windows releases became a high priority, and as part of this change, "10" was dropped from add-on name in June 2021. To acknowledge its origins and since Windows system version is 10.0 across Windows releases from 10 onwards (unless this changes), parts of the add-on and this internal article will refer to Windows 10 App Essentials (WinTenApps for short) where context matters.
es: Originalmente, Windows App Essentials sólo soportaba Windows 10, de ahí su nombre original (Windows 10 app essentials). Esto se convirtió en un problema en junio de 2021, cuando Microsoft presentó Windows 11. A pesar de que se llama Windows 11, todavía funciona con tecnologías de Windows 10, como evidencia la versión del sistema, que es 10.0, igual que la de las versiones de Windows 10. Como resultado, la necesidad de expandir el complemento para soportar Windows 11 y versiones futuras de Windows se volvió de alta prioridad, y como parte de este cambio, el "10" se eliminó del nombre del complemento en junio de 2021. Para reconocer sus orígenes y dado que la versión del sistema de Windows es 10.0 desde la 10 en adelante en todas sus liberaciones (a menos que esto cambie), partes del complemento y de este artículo interno harán referencia a Windows 10 App Essentials (WintenApps para abreviar) donde el contexto importe.

source: Windows 10 is the "last major" version of Windows... or was promoted as such until Windows 11 debuted in 2021. It introduced a completely new way of keeping track of changes through Windows Insider Program and Windows as a Service (WaaS, a fancy term for continuous delivery), new application development framework, unification strategy in terms of user experience across devices and a new web browser. In addition, it featured the return of an older style of Start menu, virtual desktops, Action Center to centralize notifications, a way to run command-line Linux utilities, and refinements to Narrator, the built-in screen reader.
es: Windows 10 es la "última" gran versión de Windows... o así se promocionaba hasta que llegó Windows 11 en 2021. Nos presentó una forma completamente nueva de mantener un seguimiento de los cambios a través del programa Windows Insider y Windows como servicio (WAAS, un término fantástico para hablar de entrega continua), un nuevo marco de trabajo de desarrollo de aplicaciones, estrategias de unificación en términos de experiencia de usuario a través de dispositivos y un nuevo explorador web. Además, destacan el regreso del viejo estilo del menú inicio, los escritorios virtuales, el centro de actividades para centralizar las notificaciones, una nueva forma de ejecutar utilidades de consola de Linux, y mejoras en Narrador, el lector de pantalla incorporado.

source: Windows 10 made its maiden flight in October 2014. Back then, it was called Windows Technical Preview, and after several weeks, it was renamed to Windows Insider Preview. Between October 2014 and July 2015 when Windows 10 Version 1507 (build 10240) shipped, more than five million users became Insiders, testing new builds and apps, submitting feedback and so on.
es: Windows 10 hizo su vuelo inaugural en octubre de 2014. Antes de eso, era conocido como Windows Technical Preview, y tras varias semanas, su nombre cambió al de programa Windows Insider. Entre octubre de 2014 y julio de 2015, cuando se liberó la versión 1507 (compilación 10240), más de cinco millones de usuarios se convirtieron en insiders, probando nuevas compilaciones y aplicaciones, enviando retroalimentación, etc.

source: I call the October 2014 preview (build 9841) a maiden flight for several reasons. First, this is the first time where Microsoft did show interest in user-level feedback. Although betas existed for earlier versions such as Windows 7 and 8.1, Windows 10 is the first attempt from Microsoft at connecting with users and taking comments seriously. Second, build 9841 (the first Insider Preview build) hailed the start of Windows as a Service, a completely different approach to upgrading Windows where Microsoft wanted to provide two things: continuous delivery and feedback loop, and a unified configuration that works well with most devices. There were setbacks such as privacy concerns due to telemetry and data losses in October 2018 Update, but for the most part, Windows 10 was received positively.
es: Llamo a la beta de octubre de 2014 (compilación 9841) vuelo inaugural por varias razones. En primer lugar, es la primera vez donde Microsoft mostró interés en las opiniones de los usuarios. Aunque existieron betas para versiones anteriores de Windows, como Windows 7 y 8.1, Windows 10 es el primer intento de Microsoft de conectar con los usuarios y tomar los comentarios en serio. En segundo lugar, la compilación 9841 (la primera compilación para insiders) marcó el comienzo de Windows como un servicio, un enfoque completamente diferente para mejorar Windows en el que Microsoft quería ofrecer dos cosas: entrega continua y bucle de realimentación, y una configuración unificada que funcione bien con la mayoría de dispositivos. Hubo contratiempos, como las preocupaciones que se generaron en privacidad debido a la telemetría y pérdida de datos en la actualización de 2018, pero en la mayoría de los casos Windows 10 fue recibido positivamente.

source: There is another, more personal reason for calling October 2014 release a maiden flight: I became one of the first Windows Insiders, and due to my work on NVDA, I have decided to make sure screen reader users were treated with respect. This included sending accessibility-related feedback, getting other screen reader users onboard as Insiders, and releasing NVDA try builds that resolved important issues for Windows Insiders. This culminated in the release of Windows 10 App Essentials add-on in November 2015 (in time for Windows 10 Version 1511/build 10586 release) that provided basic support for Insider Hub (now Feedback Hub) and other workarounds, which translated to superb user experience for NVDA users when it comes to using Windows 10 and various universal apps.
es: Hay otra razón más personal para llamar a la compilación de octubre de 2014 el vuelo inaugural: yo fui uno de los primeros insiders, y debido a mis trabajos con NVDA, decidí que los usuarios de lectores de pantalla debíamos ser tratados con respeto. Esto incluía enviar retroalimentación relacionada con la accesibilidad, conseguir que otros usuarios de lectores de pantalla subieran a bordo del programa Windows Insider, y liberar versiones de desarrollo de NVDA que resolvieran problemas importantes para los Windows insiders. Esto culminó con la publicación del complemento Windows 10 App Essentials en noviembre de 2015 (justo a tiempo de que se liberara la versión 1511 / compilación 10586) que traía soporte para el centro de Windows Insider (actualmente centro de comentarios) y otras soluciones, que se tradujeron en una experiencia magnífica para los usuarios de NVDA al usar Windows 10 y diversas aplicaciones universales.

source: Windows 11 is described as the next generation of Windows. It introduced user interface tweaks, combined input experience panel where users can select from emojis and clipboard history, a revamped Store, support for Android apps distributed through Amazon App Store, and other under the hood system tweaks. Despite its name, Windows 11's internal system version is 10.0.
es: Windows 11 se describe como la siguiente generación de Windows. Introdujo retoques en la interfaz de usuario, un panel de experiencia combinado donde los usuarios pueden seleccionar emojis e historial del portapapeles, una tienda reformada, soporte de aplicaciones Android distribuidas por la tienda de aplicaciones de Amazon, y otros retoques imperceptibles del sistema. A pesar de su nombre, la versión interna del sistema de Windows 11 es 10.0.

source: Windows 11 development could be best described as a reaction to changes to Windows ecosystem around 2020. First, Microsoft announced in December 2019 that Windows Insiders on fast ring (now dev channel) wil receive builds that are not tied to upcoming Windows releases. Six months later, Windows Insiders were notified that the "Insider ring" model was being replaced by "Insider channels" that clarified the quality of a Windows build. For example, people subscribed to slow ring were redirected to beta channel where the next feature update build was released for testing in advance.
es: El desarrollo de Windows 11 se podría describir mejor como una reacción ante los cambios del ecosistema de Windows en 2020. Primero, Microsoft anunció en diciembre de 2019 que los insiders de Windows del anillo rápido (ahora canal de desarrollo) recibirían compilaciones que no iban a tener relación con futuras versiones de Windows. Seis meses después, los Windows Insiders fueron notificados de que el modelo de "anillo de Insider" estaba siendo sustituido por "canales Insider" que aclaraban la calidad de una compilación de Windows. Por ejemplo, la gente suscrita al anillo lento fue redirigida al canal beta, donde se publicaba con antelación la siguiente compilación de actualización de características para pruebas.

source: At the same tine, Microsoft was working on Windows 10 X, an operating system designed for dual screen devices. Windows 10 X was designed to be "secure by default", meaning that it will let go of legacy components that could compromise operating system security such as running classic desktop apps locally. Because Windows 10 X downplayed classic desktop apps, I and others were wondering as to how would desktop apps (in my case, screen readers) would work in this environment, with Microsoft noting that an app container will be used to run classic apps securely. But by 2021, it was clear that Windows 10 X was not ready for the world (originally designed for dual screen devices, later becoming a single screen environment), and the world was a different place than 2019 when Windows 10 X was first announced.
es: Al mismo tiempo, Microsoft estaba trabajando en Windows 10 X, un sistema operativo diseñado para dispositivos con pantalla dual. Windows 10 X se diseñó para ser "seguro por defecto", lo que significaba que dejaría atrás componentes heredados que pudieran comprometer la seguridad del sistema operativo, como la ejecución local de aplicaciones de escritorio clásicas. Al minimizar las aplicaciones clásicas de escritorio en Windows 10 X, tanto yo como otras personas nos preguntamos cómo iban a funcionar dichas aplicaciones en este entorno (en mi caso, lectores de pantalla). Microsoft puntualizó que habría un contenedor para ejecutar estas aplicaciones con seguridad. Pero en 2021, estaba claro que Windows 10 X no estaba listo para el mundo (diseñado originalmente para dispositivos con dos pantallas, después se convirtió en un entorno para pantalla única), y el mundo era un lugar diferente a 2019, cuando Windows 10 X se anunció por primera vez.

source: Most significantly, the COVID-19 (Coronavirus Disease 2019) pandemic brought changes to lives of billions. Schools shifted to remote learning, and businesses accelerated adoption of hybrid and remote work. Responding to the pandemic and its impact, coupled with the state of Windows 10 X, Microsoft suspended Windows 10 X development in early 2021 and refined it as Sun Valley, a project to improve the user interface and related tweaks. This culminated in Sun Valley being revealed as Windows 11.
es: Más importante aún, la pandemia de Covid-19 (la enfermedad del coronavirus de 2019) trajo cambios a las vidas de millones de personas. Las escuelas pasaron a la enseñanza remota, y los negocios aceleraron la adopción del trabajo híbrido y remoto. Respondiendo a la pandemia y su impacto, junto con el estado de Windows 10 X, Microsoft suspendió el desarrollo de Windows 10 X a principios de 2021 y lo redefinió como Sun Valley, un proyecto para mejorar la interfaz de usuario y retoques relacionados. Esto culminó en que Sun Valley se revelara como Windows 11.

source: The first Windows 11 Insider Preview build (22000.51) was released on June 28, 2021. The biggest difference from Windows 10 era was how the user interface was presented and coded. For example, Settings app was reorganized, and many File Explorer controls and Shell elements such as buttons on the taskbar are UIA controls. Just like old Windows 10 Insider Preview builds, accessibility regressions were found, the most significant being inability to activate items with shortcut keys in quick menu (Windows+X).
es: La primera compilación de prueba Insider de Windows 11 (22000.51) se publicó el 28 de junio de 2021. La mayor diferencia de la época de Windows 10 es cómo se presentaba y codificaba la interfaz de usuario. Por ejemplo, se reorganizó la aplicación Configuración, y muchos controles del explorador de archivos y elementos de la Shell, como los botones de la barra de tareas, son controles UIA. Al igual que con las viejas compilaciones de prueba de Insider de Windows 10, se encontraron regresiones de accesibilidad, siendo la más importante la incapacidad de activar elementos con teclas de atajo en el menú rápido (Windows+X).
