Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/w10addoninternals.po
Languages: es

source: As noted above, some add-on features are being (or have been) integrated into NVDA. These include search suggestion notification, modern keyboard support, live region changed event tracking and announcement and so on. As described above, these changes can come from Windows, apps, and other sources such as internal NVDA changes.
es: Como se ha explicado arriba, algunas funciones del complemento se están (o se han) integrando en NVDA. Aquí se incluyen la notificación de sugerencias de búsqueda, soporte del teclado moderno, rastreo y verbalización del evento de región viva cambiada y así sucesivamente. Como se ha descrito anteriormente, estos cambios pueden proceder de Windows, las aplicaciones, y otras fuentes, como el interior de NVDA.

source: Typically, when a feature from an add-on is integrated into NVDA, it goes through a typical issue-prototype-review-test-documentation cycle. To illustrate this, let us go through steps involved in getting search suggestions into NVDA:
es: Normalmente, cuando se integra la función de un complemento en NVDA, sigue el típico ciclo de incidencia-prototipo-revisión-pruebas-documentación. Para ilustrarlo, vayamos por los pasos implicados en la integración de sugerencias de búsqueda en NVDA:

source: 1. Issue: an issue regarding search suggestions was filed in 2016.
es: 1. Incidencia: se creó una incidencia relacionada con las sugerencias de búsqueda en 2016.

source: 2. Prototype: support for search suggestions was included in the add-on.
es: 2. Prototipo: se incluyó el soporte para sugerencias de búsqueda en el complemento.

source: 3. Review: while transforming the prototype into an NVDA pull request, I and NV Access went through a review phase where implementation detail were discussed and test cases written.
es: 3. Revisión: mientras el prototipo se transformaba en una solicitud de cambios de NVDA, NV Access y yo iniciamos una fase de revisión donde se discutieron detalles de implementación y se escribieron casos de prueba.

source: 4. Test: in 2017, search suggestion feature made its debut in an NVDA next snapshod. This resulted in feedback from users regarding braille support, sounds and others. After several weeks, this feature was made available to master snapshot users, thus ready for NVDA 2017.3.
es: 4. Prueba: en 2017, se estrenó la función de sugerencias de búsqueda en la versión next de desarrollo de NVDA. Esto dio como resultado retroalimentación de los usuarios relacionada con el soporte Braille, sonidos y otros. Después de varias semanas, esta característica se puso a disposición de los usuarios de la versión de desarrollo master, y por tanto estuvo lista para NVDA 2017.3.

source: 5. Documentation: the search suggestion feature was documented in the user guide. Discussion of this feature in this article is a special case of documentation step.
es: 5. Documentación: la característica de sugerencias de búsqueda se documentó en la guía de usuario. La exposición de esta función en este artículo es un caso especial del paso de documentación.

source: After search suggestions support became part of NVDA, I edited the add-on to assume this feature was always available.
es: Después de que el soporte de sugerencias de búsqueda se integrara en NVDA, edité el complemento para asumir que esta función siempre estaba disponible.

source: Due to changes to release process in 2018, testing occurs via pull requests.
es: Debido a los cambios del proceso de liberación en 2018, las pruebas se hacen mediante solicitudes de cambio.

source: In addition, when a feature from an add-on is under consideration for inclusion in NVDA, I modify the add-on source code to make it compliant with NVDA source code guidelines, such as commenting style, copyright header and so on.
es: Además, cuando se considera que se puede incluir en NVDA alguna función de un complemento, modifico el código fuente del complemento para que cumpla las pautas del código fuente de NVDA, como el estilo de comentarios, cabecera de copyright y así sucesivamente.

source: ### Giving feedback to app developers
es: ### Cómo dar retroalimentación a los desarrolladores de aplicaciones

source: Feedback drives Windows and universal apps. one of the reasons for instituting Windows Insider Program, as noted by Microsoft and others, is to gather feedback from millions of users in hopes of making Windows better in the long run. As such, sending feedback regarding Windows and preinstalled universal apps, as well as third-party apps is crucial at the age of feedback-driven development.
es: La retroalimentación dirige a Windows y las aplicaciones universales. Una de las razones para crear el programa Windows Insider, como han indicado Microsoft y otros, es recopilar comentarios de millones de usuarios, con la esperanza de hacer Windows mejor a largo plazo. Por tanto, enviar retroalimentación sobre Windows y las aplicaciones universales preinstaladas, así como de las aplicaciones de terceros, es crucial en la era del desarrollo dirigido por comentarios.

source: Here are some tips regarding sending feedback to app writers:
es: Aquí hay algunos consejos que se pueden poner en práctica a la hora de enviar comentarios a los desarrolladores de aplicaciones:

source: 1. Embrace: have willingness to embrace (use and test) the app in question.
es: 1. Compromiso: ten la disposición para comprometerte a usar y probar la aplicación en cuestión.

source: 2. Document: if something happens, document what happened, steps to reproduce, and possible workarounds.
es: 2. Documenta: si algo pasa, documenta qué ha pasado, pasos para reproducirlo, y posibles soluciones.

source: 3. Send: send feedback to developers (Feedback Hub, contacting developers of third-party universal apps, screen reader vendors and so on).
es: 3. Envía: envía tu retroalimentación a los desarrolladores (centro de comentarios, contacto con desarrolladores de aplicaciones universales de terceros, fabricantes de lectores de pantalla, etc.).

source: 4. Follow-up: follow-up with developers if they have questions for you or you want to know what's going on with your feedback.
es: 4. Seguimiento: seguimiento con los desarrolladores para ver si tienen preguntas para ti o para saber qué ocurre con tu retroalimentación.

source: ### Accessibility best practices for universal apps
es: ### Buenas prácticas de accesibilidad para aplicaciones universales

source: As a Windows Insider, a screen reader contributor and the author of a screen reader add-on for Windows 10 and later and universal apps, I came across numerous examples where apps were inaccessible at first, or usability was overshadowed by issues when working with controls, navigation and so on.
es: Como Windows insider, colaborador de un lector de pantalla y autor de un complemento para Windows 10 y posterior y las aplicaciones universales, me he encontrado numerosos ejemplos donde las aplicaciones eran inaccesibles al principio, o su usabilidad se veía ensombrecida por problemas al trabajar con los controles, la navegación y así sucesivamente.

source: Here are some tips in hopes of making universal apps truly universally accessible and usable:
es: Aquí hay algunos consejos que espero sirvan para hacer las aplicaciones universales verdaderamente accesibles y usables:

source: * Listen to feedback, especially feedback coming from users with disabilities such as screen reader users.
es: * Escucha la retroalimentación, especialmente los comentarios que vengan de usuarios con discapacidad, como por ejemplo usuarios de lectores de pantalla.

source: * Do not put accessibility as an afterthought, nor something you want to work in the future (say, version 3). Proactive accessibility and investigations into issues is something app developers should learn as they develop apps.
es: * No pongas la accesibilidad como un pensamiento de último momento, ni como algo que quieras dejar para trabajar en el futuro (digamos, versión 3). La investigación proactiva de la accesibilidad y sus problemas es algo que los desarrolladores de aplicaciones deberían aprender según las desarrollan.

source: * Test with screen readers and other assistive technologies: one way to validate accessibility issues raised by users with disabilities is using assistive technologies in real life. Use facilities offered by screen readers such as Python console in NVDA, developer mode in Narator and so on in hopes of locating where the root of the issue lies.
es: * Haz pruebas con lectores de pantalla y otras ayudas técnicas: una forma de validar problemas de accesibilidad reportados por usuarios con discapacidad es usar las ayudas técnicas en la vida real. Usa las herramientas ofrecidas por los lectores de pantalla, como la consola Python de NVDA, el modo desarrollador en Narrador, etc. para localizar dónde se encuentra la raíz del problema.

source: * Try using keyboards and other input methods offered by various assistive technologies: touchscreen isn't the only input method used in universal apps. Many screen reader users use a keyboard to interact with apps, and some use touchscreen gestures offered by screen readers to navigate an app and respond to changes. Try using them to make sure app features are working as advertised when using keyboards and other input methods.
es: * Intenta usar teclados y otros métodos de entrada ofrecidos por diversas ayudas técnicas: la pantalla táctil no es el único método de entrada usado en las aplicaciones universales. Muchos usuarios de lectores de pantalla usan un teclado para interactuar con aplicaciones, y otros usan gestos en sus pantallas táctiles ofrecidos por los lectores de pantalla para navegar por la aplicación y reaccionar a los cambios. Intenta usarlos para asegurarte de que las funciones de la aplicación funcionan como se espera al utilizar teclados y otros métodos de entrada.

source: * Use useful labels: in case the control has no label as reported by screen readers, be sure to provide labels. A good historical case is Windows Defender Security Center where there was no label for various buttons in 2016, which was fixed in 2017 with Creators Update. Also, avoid generic XAML labels such as someclass.someotherclass.such (especialy lists and list items), as it does not provide an accurate picture as to where one is located. A classic case is Feedback Hub app where generic labels for lists were presnet in older versions, subsequently fixed in recent updates.
es: * Usa etiquetas útiles: en caso de que el lector de pantalla te informe de que tu control no tiene etiqueta, asegúrate de ofrecerla. Un buen caso histórico es el centro de seguridad de Windows Defender, donde no había etiquetas para diversos botones en 2016, y que se solucionó en 2017 con la actualización Creators. Además, evita etiquetas XAML genéricas, como clase.otraclase.algo (especialmente en listas y elementos de lista), ya que no proporcionan un cuadro preciso que permita conocer al usuario su ubicación. Un caso clásico es la aplicación del centro de comentarios, donde las etiquetas genéricas para listas estaban presentes en las versiones más antiguas, problema que se ha solucionado en las actualizaciones más recientes.

source: * Raise appropriate UIA events: screen readers listen to UIA events to detect what's happening with apps. For example, if there's a need to anounce suggestions, controller for event should be fired. An example is Store where old releases did not raise controller for event when content suggestions appeared, with recent versions raising this event.
es: * Lanza eventos UIA apropiados: los lectores de pantalla escuchan los eventos UIA para detectar qué está ocurriendo con las aplicaciones. Por ejemplo, si existe la necesidad de verbalizar sugerencias, debería dispararse el evento controlador para. Un ejemplo es la tienda, donde las antiguas versiones no disparaban el evento controlador para cuando aparecían las sugerencias de contenido. Las versiones más recientes ya lanzan este evento.

source: ## Conclusion
es: ## Conclusión

source: With the introduction of Windows 10 and Universal Windows Platform, a new way of connecting users and developers has emerged: feedback-driven development. This allows users to send feedback regarding features and bugs, including that of accessibility feedback. Although accessibility of Windows and universal apps were spotty at first, this situation is improving, driven by Microsoft's commitment to accessibility, continued feedback, and collaboration between Microsoft and assistive technology vendors. This trend continues in Windows 11.
es: Con la introducción de Windows 10 y la plataforma Windows Universal ha emergido una nueva forma de conectar a usuarios y desarrolladores: desarrollo dirigido por retroalimentación. Esto permite a los usuarios enviar retroalimentación relacionada con características y fallos, incluyendo los de accesibilidad. Aunque la accesibilidad de Windows y las aplicaciones universales era irregular al principio, esta situación está mejorando, dirigida por el compromiso de Microsoft hacia la accesibilidad, la retroalimentación continuada, y la colaboración entre Microsoft y los fabricantes de ayudas técnicas. Esta tendencia continúa en Windows 11.

source: In terms of NVDA, what made usability of Windows 10 and later better was not only changes made from within Windows and universal apps, but also proactive investigations into making sure NVDA users have a great time with Windows. Windows App Essentials add-on is part of that work, as discussed throughout this article when talking about UIA workarounds, improving support for apps and controls and others. But there are limits as to what the add-on can do, as the other puzzle pieces are willingness from developers (especially third-party UWP developers) to embrace accessibility as a pillar in their apps, and willingness from users to send accessibility feedback. Although some add-on features are being integrated into NVDA, there are some areas where the add-on is needed (especially when supporting features introduced in Windows Insider Preview builds), and until the day accessibility is everywhere in modern Windows ecosystem and universal apps, the add-on will still be here.
es: Ya centrándonos en NVDA, lo que hizo posible la usabilidad de Windows 10 y posterior no fueron solamente los cambios introducidos en Windows y las aplicaciones universales, sino también la investigación proactiva para asegurarse de que los usuarios de NVDA disfrutan de una experiencia fantástica con Windows. El complemento Windows App Essentials es parte de ese trabajo, como se ha expuesto en este artículo al hablar sobre las soluciones de UIA, el soporte mejorado de aplicaciones, controles y demás. Sin embargo, hay límites que el complemento no puede superar, y las otras piezas del puzle deben ponerlas los desarrolladores (especialmente los desarrolladores UWP de aplicaciones de terceros) para establecer la accesibilidad como un pilar en sus desarrollos, y los usuarios que envían retroalimentación sobre accesibilidad. Aunque algunas funciones del complemento se están integrando en NVDA, hay algunas áreas donde el complemento es necesario (especialmente al introducir funciones nuevas en las compilaciones de Windows Insider Preview), y mientras no llegue el día en que la accesibilidad esté en todas partes en el ecosistema de Windows y las aplicaciones universales, el complemento seguirá aquí.

source: ## References
es: ## Referencias

source: * Windows as a Service Overview (Microsoft Docs): https://docs.microsoft.com/en-us/windows/deployment/update/waas-overview
es: * Descripción de Windows como servicio (Microsoft Docs): https://docs.microsoft.com/en-us/windows/deployment/update/waas-overview

source: * What's a Universal Windows Platform (UWP) App (Microsoft UWP App Developer): https://docs.microsoft.com/en-us/windows/uwp/get-started/whats-a-uwp
es: * Qué es una aplicación de la plataforma de Windows universal (UWP) (desarrollador de aplicaciones Microsoft UWP): https://docs.microsoft.com/en-us/windows/uwp/get-started/whats-a-uwp

source: * UI Automation Overview (MSDN): https://msdn.microsoft.com/en-us/library/windows/desktop/ee684076(v=vs.85).aspx
es: * Descripción de UI Automation (MSDN): https://msdn.microsoft.com/en-us/library/windows/desktop/ee684076(v=vs.85).aspx

source: * MSAA overview (MSDN): https://msdn.microsoft.com/en-us/library/windows/desktop/dd373592(v=vs.85).aspx
es: * Descripción de MSAA (MSDN): https://msdn.microsoft.com/en-us/library/windows/desktop/dd373592(v=vs.85).aspx

source: * UI Automation and Active Accessibility (MSDN): https://msdn.microsoft.com/en-us/library/windows/desktop/ee671585(v=vs.85).aspx
es: * UI Automation y Active Accessibility (MSDN): https://msdn.microsoft.com/en-us/library/windows/desktop/ee671585(v=vs.85).aspx

source: * Component Object Model Overview (MSDN): https://msdn.microsoft.com/en-us/library/windows/desktop/ms680573(v=vs.85).aspx
es: * Descripción de Component Object Model (MSDN): https://msdn.microsoft.com/en-us/library/windows/desktop/ms680573(v=vs.85).aspx

source: * IUIAutomationElement interface (MSDN): https://msdn.microsoft.com/en-us/library/windows/desktop/ee671425(v=vs.85).aspx
es: * La interfaz IUIAutomationElement (MSDN): https://msdn.microsoft.com/en-us/library/windows/desktop/ee671425(v=vs.85).aspx

source: * UI Automation Properties Overview (MSDN): https://msdn.microsoft.com/en-us/library/windows/desktop/ee671594(v=vs.85).aspx
es: * Descripción de las propiedades de UI Automation (MSDN): https://msdn.microsoft.com/en-us/library/windows/desktop/ee671594(v=vs.85).aspx

source: * UI Automation Events Overview (MSDN): https://msdn.microsoft.com/en-us/library/windows/desktop/ee671221(v=vs.85).aspx
es: * Descripción de los eventos de UI Automation (MSDN): https://msdn.microsoft.com/en-us/library/windows/desktop/ee671221(v=vs.85).aspx

source: * UI Automation Event Identifiers (MSDN): https://msdn.microsoft.com/en-us/library/windows/desktop/ee671223(v=vs.85).aspx
es: * Identificadores de eventos en UI Automation (MSDN): https://msdn.microsoft.com/en-us/library/windows/desktop/ee671223(v=vs.85).aspx

source: * Auto-suggest accessibility, part of Accessible Text Requirements (Microsoft Docs): https://docs.microsoft.com/en-us/windows/uwp/accessibility/accessible-text-requirements
es: * Accesibilidad de sugerencias automáticas, parte de los requisitos de textos accesibles (Microsoft Docs): https://docs.microsoft.com/en-us/windows/uwp/accessibility/accessible-text-requirements
