Repository: nvda-es/devguides_translation
Catalog: translations/*/LC_MESSAGES/w10addoninternals.po
Languages: es

source: Just like first Windows 10 Insider Preview build (9841), build 22000 is personal. Although I was disappointed that the main add-on development machine isn't compatible with Windows 11, Windows 11 preview ran well as a virtual machine. At least this gave me a head start on bringing experimental support for Windows 11 user interface through Windows App Essentials, made easier as I have learned a lot during Windows 10 era. Many add-on snapshots were released days following the availability of the first preview build, and as of time of this writing (July 2021), Windows 11 is usable with NVDA.
es: Al igual que con la primera compilación de prueba de Windows 10 Insider (9841), la compilación 22000 es personal. Aunque me decepcionó que el equipo principal de desarrollo del complemento no fuera compatible con Windows 11, Windows 11 Preview arrancó bien como máquina virtual. Al menos esto me trajo un punto de partida para dar soporte a la interfaz de usuario de Windows 11 a través de Windows App Essentials, que se ha vuelto más fácil, ya que he aprendido mucho durante la era de Windows 10. En los días siguientes a la disponibilidad de la primera compilación de prueba, se han liberado muchas versiones de desarrollo del complemento, y en el momento de redacción de este apartado (julio de 2021), Windows 11 es usable con NVDA.

source: ## Purposes of Windows App Essentials
es: ## Propósitos de Windows App Essentials

source: Windows App Essentials add-on is built on top of four pillars:
es: El complemento Windows App Essentials se ha construido sobre cuatro pilares:

source: * New features support: part of making sure screen reader users were treated with respect was showcasing new Windows features early through this NVDA add-on, particularly on Windows 10. These include support for really old versions of Feedback Hub app, emoji panel in Windows 10 Fall Creators Update and so on.
es: * Soporte de nuevas características: una forma de asegurarse de que los usuarios de lectores de pantalla eran tratados con respeto era adaptando características de Windows según aparecían a través de este complemento, particularmente en Windows 10. Entre ellas se incluyen un soporte para la antigua aplicación del centro de comentarios, y el panel de emojis en Windows 10 creators update.

source: * Essential features and announcements: Until early 2017, NVDA did not announce important information such as status of Windows Update installations in Settings app. This has changed significantly in 2017 (see notes on live region change event for details).
es: * Características esenciales y verbalización: hasta principios del 2017, NVDA no verbalizaba información importante, como el estado de la instalación de actualizaciones en Windows Update en la aplicación de configuración. Esto está a punto de cambiar (mira las notas del evento de cambio en región activa para más detalles).

source: * UI Automation and accessibility workarounds: every day, new features and bug fixes are added to various universal apps or Windows itself. At the same time, there is at least one app where accessibility, particularly UI Automation, gets broken, especially during development of Windows 11. Some of the add-on code is devoted to providing workarounds for odd UIA implementations.
es: * Solución de problemas de accesibilidad y UI Automation: cada día se añaden nuevas funciones y se solucionan fallos en diversas aplicaciones universales y en el propio Windows. Al mismo tiempo, hay al menos una aplicación donde la accesibilidad, particularmente la de UI Automation, se rompe, especialmente durante el desarrollo de Windows 11. Parte del código del complemento se destina a solucionar implementaciones defectuosas de UIA.

source: * Demonstrating commitment to accessibility advocacy: some accessibility champions, including I, have recently stressed that accessibility is important in app designs, and that developers should take accessibility feedback seriously. Through workarounds and features, the add-on provides a way to demonstrate this commitment and advocacy.
es: * Demostración de compromiso y promoción de la accesibilidad: algunos defensores de la accesibilidad, incluyéndome a mí, hemos subrayado recientemente que la accesibilidad es importante en los diseños de aplicaciones, y que los desarrolladores deberían tomarse los comentarios de accesibilidad en serio. A través de características y solución de errores, el complemento ofrece una forma de demostrar este compromiso y promoción.

source: There is a fifth pillar that has emerged in recent years: providing a testing ground for potential NVDA features dealing with Windows and apps. Recently, parts of this add-on have made their way to NVDA screen reader, including emoji panel support, suggestion sounds, dialog detection and others.
es: Existe un quinto pilar que ha emergido en los últimos años: proporcionar una base de pruebas para potenciales características de NVDA que traten con Windows y las aplicaciones. Recientemente, algunas partes de este complemento se han transferido al lector de pantalla NVDA, incluyendo el soporte para el panel de emojis, sonidos de sugerencias, detección de diálogo y otras.

source: ## Add-on contents
es: ## Contenidos del complemento

source: The Windows App Essentials add-on consists of a global plugin and app modules for various universal apps included with Windows 10 and later. The Windows App Objects (shortened to WinAppObjs), the global plugin portion of this add-on, provides foundations such as overlay classes for frequently encountered controls in Windows an universal apps, along with UIA event tracking and logger facility. Until 2018, the global plugin was also responsible for add-on update feature, documented here for sake of completeness.
es: El complemento Windows App Essentials está formado por una extensión global y módulos de aplicación para diversas aplicaciones universales que vienen con Windows 10 y posterior. Los objetos de Windows (abreviados como WinAppObjs), la porción de extensión global de este complemento, ofrecen soluciones como clases de superposición para controles que se encuentran frecuentemente en Windows y las aplicaciones universales, junto con rastreo de eventos UIA y registro. Hasta 2018, la extensión global también era responsable de la función de actualización del complemento, y se documenta aquí con motivos de completitud.

source: In regards to app modules, these were included to either provide workarounds or enhance the user experience. For example, the app module for Settings app (systemsettings) allows NVDA to announce Windows Update download and installation progress, and app module for modern keyboard (windowsinternal_composableshell_experiences_textinput_inputapp) provides support for more modern input facilities such as enhanced dictation and clipboard history. We'll meet some of these app modules in subsequent sections.
es: En cuanto a los módulos de aplicación, se han incluido para ofrecer solución de errores o mejorar la experiencia de usuario. Por ejemplo, el módulo de aplicación para la aplicación de configuración (systemsettings) permite a NVDA anunciar el progreso de descarga e instalación en Windows Update, y el módulo de aplicación para el teclado moderno (windowsinternal_composableshell_experiences_textinput_inputapp) proporciona soporte para más funciones modernas de entrada, tales como el dictado mejorado y el historial del portapapeles. Conoceremos estos módulos de aplicación con detalle en las siguientes secciones.

source: ### A note on feature parity with NVDA screen reader
es: ### Nota relacionada con la paridad de características en el lector de pantalla NVDA

source: As noted above, some features discussed in this article (such as suggestion sound playback and UIA notification event handler) were integrated into recent NVDA releases. I will point out some of these, as well as provide how these were integrated, including planning involved and some tips on modifying add-on features to fit into NVDA's code base.
es: Como se ha dicho antes, algunas características discutidas en este artículo (tales como la reproducción de un sonido de sugerencias y el manejador de evento de notificación de UIA) se han integrado en las últimas versiones de NVDA. Voy a señalar algunas de ellas y explicar cómo se han integrado, incluyendo la planificación involucrada y algunos consejos para modificar las características del complemento para que encajen bien en el código base de NVDA.

source: ### Information on add-on update feature
es: ### Información sobre la función de actualización del complemento

source: This article will sometimes reference add-on update feature, which is gone in 2019. Information about it is kept here for reference purposes. An add-on appropriately named "Add-on Updater" is used to update windows App Essentials and other add-ons.
es: Este artículo hará referencia en ocasiones a una función de actualización del complemento, que se ha ido en 2019. La información relacionada con esta característica se mantiene con propósitos de referencia. Ahora se usa un complemento llamado "Add-on Updater" para actualizar Windows App Essentials y otros complementos.

source: ### Special note on feature updates support on Windows 10 and later
es: ### Nota especial sobre el soporte de actualización de características de Windows 10 y posterior

source: Windows App Essentials add-on supports a given Windows feature update (release) for at least one year. In addition, it comes with support for features found in Windows Insider Preview (WIP) builds, including features that may not appear in subsequent feature updates.
es: El complemento Windows App Essentials soporta una actualización de características de Windows dada (versión) durante al menos un año. Además, viene con soporte para las funciones disponibles en las compilaciones de Windows Insider Preview (WIP), incluyendo funciones que pueden no aparecer en las siguientes actualizaciones de características.

source: ## Fun with UI Automation
es: ## Introducción a UI Automation

source: Before we dive into how the add-on works, it is helpful to understand what UIA is and wy it is important. Only then the rest of the article makes sense, as Windows (10 and later) and universal apps are UIA universes (exceptions exist, including desktop apps submitted (either converted (Windows 10) or installer (Windows 11) for distribution in Microsoft Store).
es: Antes de pasar a explicar cómo funciona el complemento, es útil entender cómo es UIA y por qué es importante. Sólo entonces el resto del artículo tiene sentido, ya que Windows (10 y posterior) y las aplicaciones universales se apoyan en UIA (existen excepciones, como aplicaciones de escritorio (convertidas (Windows 10) o instaladores (Windows 11) para su distribución en la tienda Microsoft).

source: UI Automation (UIA), released in 2007, is an accessibility API based on Component Object Model (COM) that allows assistive technologies and other programs to communicate with each other regarding accessibility information about a control. In some respects, this API is a replacement for Microsoft Active Accessibility (MSAA), sometimes called IAccessible that was released in the 1990's. Being a COM-based API set, it allows programs and objects to expose essential information regardless of programming language in use as long as an object exposes documented routines that other programs can use.
es: UI Automation (UIA), publicada en 2007, es una api de accesibilidad basada en el modelo de componentes y objetos (COM) que permite a las ayudas técnicas y otros programas comunicarse con los demás transmitiendo información de accesibilidad sobre un control. En algunos ámbitos, esta api reemplaza a Microsoft Active Accessibility (MSAA), a veces llamada IAccessible, y que se publicó en los años 90. Siendo una api basada en COM, permite a los programas y objetos exponer información esencial sin importar el lenguaje de programación que se use, ya que cada objeto expone rutinas documentadas que cualquier otro programa puede usar.

source: In UIA world, an object on screen is termed an "element". Just like any accessibility API's, UIA exposes various elements to assistive technologies, which are termed "clients", with programs with the set elements termed "servers". These elements are organized into a UI tree, with the Windows Shell (desktop) object being the root, with tree being pruned and new leafs springing constantly whenever apps are started and closed, elements are created and destroyed, controls are shown and hidden on screen and so on.
es: En el mundo UIA, un objeto en pantalla se denomina "elemento". Como en cualquier api de accesibilidad, UIA expone varios elementos a las ayudas técnicas, llamadas "clientes", siendo el programa que ofrece estos elementos un "servidor". Estos elementos se organizan en un árbol de interfaz, con la Shell de Windows (Escritorio) como raíz, y con el árbol podado y nuevas hojas brotando constantemente cada vez que las aplicaciones se inician y se cierran, los elementos son creados y destruidos, los controles se muestran y se ocultan en la pantalla y así sucesivamente.

source: Although UIA is meant to replace MSAA due to modernized accessibility information that can be gathered, screen reader vendors such as NV Access publishes workarounds for poor or odd UIA implementations. One such case is UIA issues in older versions of Microsoft Office, such as label problem in various combo boxes. Certain areas in Windows and universal apps still have UIA issues, such as odd or badly applied control labels, generic XAML (eXtensible Application Markup Language)/UI labels, expected events not being fired and so on. This is one of the reasons for creating Windows App Essentials add-on: to provide workarounds for issues like these.
es: Aunque UIA se ha diseñado para reemplazar a MSAA debido a la información de accesibilidad modernizada que puede recuperarse, los fabricantes de lectores de pantalla como NV Access publican solución de errores para implementaciones UIA pobres o defectuosas. Un caso conocido se encuentra en los problemas de UIA en versiones antiguas de Microsoft Office, tales como problemas de etiquetado en algunos cuadros combinados. Ciertas áreas en Windows y las aplicaciones universales todavía tienen problemas con UIA, tales como etiquetas de controles defectuosas o mal aplicadas, etiquetas genéricas de interfaz o de XAML (lenguaje de marcas extensible para aplicaciones), eventos que se esperan y que nunca llegan a dispararse, y así sucesivamente. Esta es una de las razones para crear el complemento Windows App Essentials: ofrecer soluciones para problemas como estos.

source: ### Automation Id and other interfaces and properties
es: ### ID de automatización y otras interfaces y propiedades

source: A key piece of information UIA exposes (or attempts to gather) is Automation Identifier (Id), a string that uniquely identifies an element. For example, some search fields expose "SearchEditBox" as Automation Id, which allows screen readers such as NVDA to detect these controls. Although most controls do expose unique Automation Id's, some uses generic or auto-generated identifiers (such as update history in Settings app).
es: Una pieza clave de información que UIA expone (o intenta exponer) es el ID de automatización, una cadena que identifica unívocamente un elemento. Por ejemplo, algunos campos de búsqueda exponen "SearchEditBox" como ID de automatización, que permite a lectores de pantalla como NVDA detectar estos controles. Aunque la mayoría de los controles exponen identificadores de automatización únicos, algunos utilizan identificadores genéricos o generados automáticamente (como por ejemplo el historial de actualizaciones en la aplicación de configuración).

source: Other useful information exposed by UIA elements are:
es: Otra información útil expuesta por los elementos UIA es la siguiente:

source: * Class name: the class name for this control, a string that denotes the class of this element (not to be confused with Automation Id that uniquely identifies an element).
es: * Nombre de clase: el nombre de la clase para este control, una cadena que identifica la clase de este elemento (no debe confundirse con el ID de automatización, que identifica unívocamente un elemento).

source: * Framework: the underlying framework used to create a given control such as XAML, Direct UI and others.
es: * Marco de trabajo: el marco de trabajo subyacente usado para crear un control dado, por ejemplo XAML, Direct UI y otros.

source: * Localized control type: a role type text that should be spoken by screen readers in different languages.
es: * Tipo de control localizado: un texto con el tipo de rol que debería ser verbalizado por los lectores de pantalla en diferentes idiomas.

source: * Controller for: a list (array) of controls that this element manipulates when performing actions such as search suggestions (explained below).
es: * Controlador para: una lista (array) de controles que este elemento manipula cuando realiza acciones tales como sugerencias de búsqueda (se explica más abajo).

source: * ARIA properties: a map of ARIA properties such as role description, mostly encountered in Microsoft Edge elements.
es: * Propiedades ARIA: un mapa de propiedades ARIA tales como descripción del rol, situadas mayoritariamente en elementos de Microsoft Edge.

source: ### UIA events
es: ### Eventos UIA

source: In addition to standard events expected from accessibility API's such as focus manipulation and object property (such as name and state) changes, UIA comes with some interesting events, including controller for, live region changed, notification and many others. Due to performance reasons, NVDA ignores certain events such as structure change and others. How NVDA and Windows App Essentials add-on deals with certain UIA events is covered later in this article.
es: Además de los eventos estándar esperados de las apis de accesibilidad, tales como manipulación de foco y cambios en las propiedades de un objeto (como nombre y estado), UIA viene con algunos eventos interesantes, incluyendo controlador para (Controller for), cambios en región viva (live región changed), notificación y muchos otros. Por razones de rendimiento, NVDA ignora ciertos eventos como cambio de estructura y algunos más. Más adelante en este artículo se explica cómo trabajan NVDA y Windows App Essentials con ciertos eventos UIA.

source: ### UIA-related additions, fixes and workarounds
es: ### Solución de fallos y características añadidas relacionadas con UIA

source: The Windows App Essentials add-on includes the following additions, fixes and workarounds for UIA issues and control problems:
es: El complemento Windows App Essentials incluye los siguientes extras, parches y soluciones para problemas de UIA y controles:

source: * Search suggestions: NVDA now plays a sound to indicate appearance of search suggestions, incorporated into NVDA 2017.3. More on this below.
es: * Sugerencias de búsqueda: NVDA ahora reproduce un sonido para indicar la aparición de sugerencias de búsqueda, incorporado en NVDA 2017.3. Más detalles sobre esto más adelante.

source: * Live region change announcements in various apps. In the global plugin portion, a way to define and track this event is included.
es: * Verbalización de cambio de regiones vivas en diversas aplicaciones. En la parte de extensión global se incluye una forma de definir y rastrear este evento.

source: * Floating suggestions such as Emoji panel in Windows 10 1709 (Fall Creators Update) and hardware keyboard suggestions in 1803 (April 2018 Update). This has been incorporated into NVDA 2018.3 release, but more recent changes do require support from this add-on.
es: * Sugerencias flotantes como el panel de emojis en Windows 10 1709 (actualización Fall Creators) y sugerencias del teclado hardware en la versión 1803 (actualización de abril de 2018). Esto se ha incorporado en la versión 2018.3 de NVDA, pero se necesita el complemento para dar apoyo a algunos cambios más recientes.

source: * Support for UIA notification event introduced in Windows 10 1709. This became part of NVDA in 2018.2, and refined in 2019.2 to interupt users when important notifications are pending.
es: * Soporte para el evento de notificación de UIA introducido en Windows 10 1709. Esto pasó a formar parte de NVDA en la versión 2018.2, y se redefinió en 2019.2 para interrumpir a los usuarios cuando hay notificaciones importantes pendientes.

source: * Providing more meaningful labels for certain controls such as update history in Settings/Update and Security/Windows Update, sensitive to changes in Insider Preview builds.
es: * Se ofrecen etiquetas más significativas para ciertos controles, como el historial de actualizaciones en configuración / actualización y seguridad / Windows Update, sensibles a los cambios en las compilaciones Insider Preview.

source: * Announcing tooltips from universal apps, incorporated into NVDA 2019.3.
es: * verbalización de consejos en aplicaciones universales, parte de NVDA 2019.3.

source: * Recognizing dialogs powered by XAML and various frameworks. Since NVDA 2018.3, NVDA itself takes care of this in most situations.
es: * Reconocimiento de diálogos proporcionados por XAML y diversos marcos de trabajo. En NVDA 2018.3, el propio NVDA se encarga de esto en la mayoría de situaciones.

source: We'll meet various UIA controls and workarounds throughout this article.
es: Conoceremos varios controles y soluciones a lo largo de este artículo.

source: ## Windows App Objects
es: ## Objetos de aplicación de Windows

source: Windows App Essentials add-on comes with Windows App Objects (formerly Windows 10 Objects or WinTenObjs for short), a global plugin that contains definitions of common controls encountered in Windows and various universal apps. These include search suggestion handling, tool tips for universal apps and so on. It also includes additional UIA handling routines and configuration and update facility for the add-on (the latter was removed in 2019).
es: El complemento Windows App Essentials viene con Objetos de aplicación de Windows (antes Objetos de Windows 10 o WinTenObjs para abreviar), una extensión global que contiene definiciones de controles comunes que se encuentran en Windows y diversas aplicaciones universales. Aquí se incluyen el manejo de sugerencias de búsqueda, consejos de aplicaciones universales y así sucesivamente. También incluye procedimientos de manejo adicionales para UIA, y las características de configuración y actualización del complemento (esta última se eliminó en 2019).

source: ### Source code layout
es: ### Estructura del código fuente

source: The main global plugin is housed inside winappObjs.py and is laid out thus:
es: El archivo con la extensión global principal se aloja en winappObjs.py y se presenta así:

source: 1. Usual add-on header such as copyright information.
es: 1. Cabecera típica de cualquier complemento con información de derechos de copia, autor, etc.

source: 2. UIA constants not included in NVDA, including property ID's such as controller for event. Most are now part of NVDA itself.
es: 2. Constantes UIA no incluidas en NVDA, incluyendo identificadores de propiedades tales como los del evento controlador para (controller for). La mayoría ya forman parte de NVDA.

source: 3. Classes defining various Windows and universal app controls, including search suggestions, looping selectors and so on.
es: 3. Clases que definen diversos controles de Windows y las aplicaciones universales, incluyendo sugerencias de búsqueda, selectores en bucle y así sucesivamente.
